From eb9436b663a2c1df17286c7c7c9e93bf208f3bf6 Mon Sep 17 00:00:00 2001
From: MalwareMechanic <malwaremechanic@gmail.com>
Date: Thu, 25 Jul 2019 12:19:18 -0400
Subject: [PATCH 1/3] Initial FLARE Windows 10 memory compression support.

---
 README.txt                                    | 131 +++
 .../addrspaces/win10_memcompression.py        | 690 ++++++++++++++
 .../overlays/windows/win10_memcompression.py  | 843 ++++++++++++++++++
 volatility/plugins/win10deflate.py            | 137 +++
 volatility/plugins/win10smglobals.py          |  60 ++
 5 files changed, 1861 insertions(+)
 create mode 100644 volatility/plugins/addrspaces/win10_memcompression.py
 create mode 100644 volatility/plugins/overlays/windows/win10_memcompression.py
 create mode 100644 volatility/plugins/win10deflate.py
 create mode 100644 volatility/plugins/win10smglobals.py

diff --git a/README.txt b/README.txt
index 7fcc6262..10dd59a5 100644
--- a/README.txt
+++ b/README.txt
@@ -1,4 +1,135 @@
 ============================================================================
+Volatility Framework with Windows 10 Memory Compression
+============================================================================
+
+This repository contains Volatility with additions made to support Windows 10
+memory compression. If a supported Windows 10 profile is used, it will attempt
+to apply the corresponding address space that enables memory decompression.
+This allows plugins to read previously unreadable, compressed data. If a

+            buf = self._partial_read(addr, length)
+            if not buf:
+                break
+
+            addr += len(buf)
+            length -= len(buf)
+            result += buf
+
+        if result == '':
+            if zread:
+                return '\0' * length
+
+            result = obj.NoneObject("Unable to read data at {0:#x} "
+                                    "for length {1:#x}".format(addr, length))
+        else:
+            if zread:
+                result += ('\0' * length)
+
+        return result
+
+    def zread(self, addr, length):
+        return self.read(addr, length, zread = True)
+
+
+class Win10CompressedAMD64PagedMemory(Win10CompressedPagedMemory,
+                                      amd64.SkipDuplicatesAMD64PagedMemory):
+    order = 50
+
+    def __init__(self, base, config, *args, **kwargs):
+        # We must be stacked on someone else
+        self.as_assert(base, "No base Address Space")
+
+        # Initialize a local copy of the paged address space to use
+        self.paged_as = amd64.SkipDuplicatesAMD64PagedMemory(base, config,
+                                                             *args, **kwargs)
+
+        if obj.VolMagic(self.paged_as).DisableWin10MemCompress.v():
+            raise Exception("Disabling Win10 memory decompression AS")
+
+        # Object to decompress Windows 10 compressed memory
+        self.memcompress = WindowsMemoryCompression(
+            addrspace = self.paged_as,
+            sm_globals = self.sm_globals,
+            page_file_number = self.page_file_number)
+
+        # Initialize our memory compression parent address space
+        Win10CompressedPagedMemory.__init__(self, paged_as = self.paged_as,
+                                            memcompress = self.memcompress)
+
+        # Initialize our paged parent address space
+        amd64.SkipDuplicatesAMD64PagedMemory.__init__(self, base, config,
+                                                      *args, **kwargs)
+
+
+class Win10CompressedIA32PagedMemory(Win10CompressedPagedMemory,
+                                     intel.IA32PagedMemory):
+    order = 55
+
+    def __init__(self, base, config, *args, **kwargs):
+        # We must be stacked on someone else
+        self.as_assert(base, "No base Address Space")
+
+        # Initialize a local copy of the paged address space to use
+        self.paged_as = intel.IA32PagedMemory(base, config, *args, **kwargs)
+
+        if obj.VolMagic(self.paged_as).DisableWin10MemCompress.v():
+            raise Exception("Disabling Win10 memory decompression AS")
+
+        # Object to decompress Windows 10 compressed memory
+        self.memcompress = WindowsMemoryCompression(
+            addrspace = self.paged_as,
+            sm_globals = self.sm_globals,
+            page_file_number = self.page_file_number)
+
+        # Initialize our memory compression parent address space
+        Win10CompressedPagedMemory.__init__(self, paged_as = self.paged_as,
+                                            memcompress = self.memcompress)
+
+        # Initialize our parent address space
+        intel.IA32PagedMemory.__init__(self, base, config, *args, **kwargs)
+
+
+class Win10CompressedIA32PagedMemoryPae(Win10CompressedPagedMemory,
+                                        intel.IA32PagedMemoryPae):
+    order = 50
+
+    def __init__(self, base, config, *args, **kwargs):
+        # We must be stacked on someone else
+        self.as_assert(base, "No base Address Space")
+
+        # Initialize a local copy of the paged address space to use
+        self.paged_as = intel.IA32PagedMemoryPae(base, config, *args, **kwargs)
+
+        if obj.VolMagic(self.paged_as).DisableWin10MemCompress.v():
+            raise Exception("Disabling Win10 memory decompression AS")
+
+        # Object to decompress Windows 10 compressed memory
+        self.memcompress = WindowsMemoryCompression(
+            addrspace = self.paged_as,
+            sm_globals = self.sm_globals,
+            page_file_number = self.page_file_number)
+
+        # Initialize our memory compression parent address space
+        Win10CompressedPagedMemory.__init__(self, paged_as = self.paged_as,
+                                            memcompress = self.memcompress)
+
+        # Initialize our parent address space
+        intel.IA32PagedMemoryPae.__init__(self, base, config, *args, **kwargs)
diff --git a/volatility/plugins/overlays/windows/win10_memcompression.py b/volatility/plugins/overlays/windows/win10_memcompression.py
new file mode 100644
index 00000000..3f7de7a9
--- /dev/null
+++ b/volatility/plugins/overlays/windows/win10_memcompression.py
@@ -0,0 +1,843 @@
+# Volatility
+# Copyright (C) 2007-2019 Volatility Foundation
+#
+# Authors:
+# Blaine Stancill <blaine.stancill@FireEye.com>
+#
+# This file is part of Volatility.
+#
+# Volatility is free software; you can redistribute it and/or modify
+# it under the terms of the GNU General Public License as published by
+# the Free Software Foundation; either version 2 of the License, or
+# (at your option) any later version.
+#
+# Volatility is distributed in the hope that it will be useful,
+# but WITHOUT ANY WARRANTY; without even the implied warranty of
+# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
+# GNU General Public License for more details.
+#
+# You should have received a copy of the GNU General Public License
+# along with Volatility.  If not, see <http://www.gnu.org/licenses/>.
+#
+
+import struct
+
+import volatility.debug as debug
+import volatility.obj as obj
+import volatility.plugins.malware.malfind as malfind
+import volatility.win32.tasks as tasks
+
+try:
+    import yara
+
+    has_yara = True
+except ImportError:
+    has_yara = False
+
+###############################################################################
+# General V-Types
+###############################################################################
+win10_mem_comp_general_vtypes = {
+    '_ST_PAGE_RECORD': [None, {
+        'Key': [0x0, ['unsigned int']],
+        'CompressedSize': [0x4, ['unsigned short int']],
+        'NextKey': [0x4, ['unsigned int']]
+    }],
+    '_SMKM': [None, {
+        'StoreMetaDataPtrArray': [0x0, ['array', 32,
+                                        ['pointer', ['array', 32, [
+                                            "_SMKM_STORE_METADATA"]]]]]
+    }],
+    '_SM_GLOBALS': [None, {
+        'SmkmStoreMgr': [0x0, ['_SMKM_STORE_MGR']]
+    }]
+}
+
+###############################################################################
+# x86 Specific V-Types
+###############################################################################
+win10_mem_comp_general_x86_vtypes = {
+    '_B_TREE_LEAF_NODE': [0x8, {
+        'Key': [0x0, ['unsigned int']],
+        'Value': [0x4, ['unsigned int']],
+    }],
+    '_B_TREE_LEAF': [None, {
+        'Elements': [0x0, ['unsigned short int']],
+        'Level': [0x2, ['unsigned char']],
+        'Leaf': [0x3, ['unsigned char']],
+        'LeftChild': [0x4, ['pointer', ['_B_TREE']]],
+        'Nodes': [0x8, ['array', lambda x: x.Elements, ['_B_TREE_LEAF_NODE']]]
+    }],
+    '_B_TREE_NODE': [0x8, {
+        'Key': [0x0, ['unsigned int']],
+        'Child': [0x4, ['pointer', ['_B_TREE']]]
+    }],
+    '_B_TREE': [None, {
+        'Elements': [0x0, ['unsigned short int']],
+        'Level': [0x2, ['unsigned char']],
+        'Leaf': [0x3, ['unsigned char']],
+        'LeftChild': [0x4, ['pointer', ['_B_TREE']]],
+        'Nodes': [0x8, ['array', lambda x: x.Elements, ['_B_TREE_NODE']]]
+    }],
+    '_SMHP_CHUNK_METADATA': [None, {
+        'ChunkPtrArray': [0x0, ['array', 32, ['pointer', ['void']]]],
+        'BitValue': [0x88, ['unsigned int']],
+        'PageRecordsPerChunkMask': [0x8C, ['unsigned int']],
+        'PageRecordSize': [0x90, ['unsigned int']],
+        'ChunkPageHeaderSize': [0x98, ['unsigned int']],
+    }],
+    '_ST_STORE': [None, {
+        'StDataMgr': [0x38, ['_ST_DATA_MGR']]
+    }],
+    '_SMKM_STORE_METADATA': [0x14, {
+        'SmkmStore': [0x0, ['pointer', ["_SMKM_STORE"]]],
+    }],
+    '_SMKM_STORE_MGR': [None, {
+        'Smkm': [0x0, ['_SMKM']],
+        'KeyToStoreTree': [0xF4, ['pointer', ['_B_TREE']]]
+    }]
+}
+
+###############################################################################
+# x64 Specific V-Types
+###############################################################################
+win10_mem_comp_general_x64_vtypes = {
+    '_B_TREE_LEAF_NODE': [0x8, {
+        'Key': [0x0, ['unsigned int']],
+        'Value': [0x4, ['unsigned int']],
+    }],
+    '_B_TREE_LEAF': [None, {
+        'Elements': [0x0, ['unsigned short int']],
+        'Level': [0x2, ['unsigned char']],
+        'Leaf': [0x3, ['unsigned char']],
+        'LeftChild': [0x8, ['pointer', ['_B_TREE']]],
+        'Nodes': [0x10, ['array', lambda x: x.Elements, ['_B_TREE_LEAF_NODE']]]
+    }],
+    '_B_TREE_NODE': [0x10, {
+        'Key': [0x0, ['unsigned int']],
+        'Child': [0x8, ['pointer', ['_B_TREE']]]
+    }],
+    '_B_TREE': [None, {
+        'Elements': [0x0, ['unsigned short int']],
+        'Level': [0x2, ['unsigned char']],
+        'Leaf': [0x3, ['unsigned char']],
+        'LeftChild': [0x8, ['pointer', ['_B_TREE']]],
+        'Nodes': [0x10, ['array', lambda x: x.Elements, ['_B_TREE_NODE']]]
+    }],
+    '_SMHP_CHUNK_METADATA': [None, {
+        'ChunkPtrArray': [0x0, ['array', 32, ['pointer', ['void']]]],
+        'BitValue': [0x108, ['unsigned int']],
+        'PageRecordsPerChunkMask': [0x10C, ['unsigned int']],
+        'PageRecordSize': [0x110, ['unsigned int']],
+        'ChunkPageHeaderSize': [0x118, ['unsigned int']],
+    }],
+    '_ST_STORE': [None, {
+        'StDataMgr': [0x50, ['_ST_DATA_MGR']]
+    }],
+    '_SMKM_STORE_METADATA': [0x28, {
+        'SmkmStore': [0x0, ['pointer', ["_SMKM_STORE"]]],
+    }],
+    '_SMKM_STORE_MGR': [None, {
+        'Smkm': [0x0, ['_SMKM']],
+        'KeyToStoreTree': [0x1C0, ['pointer', ['_B_TREE']]]
+    }]
+}
+
+###############################################################################
+# x64 1903 Specific V-Types
+###############################################################################
+win10_mem_comp_x64_1903 = {
+    '_ST_DATA_MGR': [None, {
+        'PagesTree': [0x0, ['pointer', ['_B_TREE']]],
+        'ChunkMetaData': [0xC0, ['_SMHP_CHUNK_METADATA']],
+        'SmkmStore': [0x320, ['pointer', ["_SMKM_STORE"]]],
+        'RegionSizeMask': [0x328, ['unsigned int']],
+        'RegionIndexMask': [0x32C, ['unsigned int']],
+        'CompressionAlgorithm': [0x3E0, ['unsigned short int']],
+    }],
+    '_SMKM_STORE': [None, {
+        'StStore': [0x0, ['_ST_STORE']],
+        'CompressedRegionPtrArray': [0x1848, ['pointer', ['void']]],
+        'OwnerProcess': [0x19A8, ['pointer', ["_EPROCESS"]]]
+    }]
+}
+
+###############################################################################
+# x86 1903 Specific V-Types
+###############################################################################
+win10_mem_comp_x86_1903 = {
+    '_ST_DATA_MGR': [None, {
+        'PagesTree': [0x0, ['pointer', ['_B_TREE']]],
+        'ChunkMetaData': [0x6C, ['_SMHP_CHUNK_METADATA']],
+        'SmkmStore': [0x1C0, ['pointer', ["_SMKM_STORE"]]],
+        'RegionSizeMask': [0x1C4, ['unsigned int']],
+        'RegionIndexMask': [0x1C8, ['unsigned int']],
+        'CompressionAlgorithm': [0x224, ['unsigned short int']],
+    }],
+    '_SMKM_STORE': [None, {
+        'StStore': [0x0, ['_ST_STORE']],
+        'CompressedRegionPtrArray': [0x1184, ['pointer', ['void']]],
+        'OwnerProcess': [0x1254, ['pointer', ["_EPROCESS"]]]
+    }]
+}
+
+###############################################################################
+# x64 1809 Specific V-Types
+###############################################################################
+win10_mem_comp_x64_1809 = {
+    '_ST_DATA_MGR': [None, {
+        'PagesTree': [0x0, ['pointer', ['_B_TREE']]],
+        'ChunkMetaData': [0xC0, ['_SMHP_CHUNK_METADATA']],
+        'SmkmStore': [0x320, ['pointer', ["_SMKM_STORE"]]],
+        'RegionSizeMask': [0x328, ['unsigned int']],
+        'RegionIndexMask': [0x32C, ['unsigned int']],
+        'CompressionAlgorithm': [0x3E0, ['unsigned short int']],
+    }],
+    '_SMKM_STORE': [None, {
+        'StStore': [0x0, ['_ST_STORE']],
+        'CompressedRegionPtrArray': [0x1848, ['pointer', ['void']]],
+        'OwnerProcess': [0x19A8, ['pointer', ["_EPROCESS"]]]
+    }]
+}
+
+###############################################################################
+# x86 1809 Specific V-Types
+###############################################################################
+win10_mem_comp_x86_1809 = {
+    '_ST_DATA_MGR': [None, {
+        'PagesTree': [0x0, ['pointer', ['_B_TREE']]],
+        'ChunkMetaData': [0x6C, ['_SMHP_CHUNK_METADATA']],
+        'SmkmStore': [0x1C0, ['pointer', ["_SMKM_STORE"]]],
+        'RegionSizeMask': [0x1C4, ['unsigned int']],
+        'RegionIndexMask': [0x1C8, ['unsigned int']],
+        'CompressionAlgorithm': [0x224, ['unsigned short int']],
+    }],
+    '_SMKM_STORE': [None, {
+        'StStore': [0x0, ['_ST_STORE']],
+        'CompressedRegionPtrArray': [0x1184, ['pointer', ['void']]],
+        'OwnerProcess': [0x1254, ['pointer', ["_EPROCESS"]]]
+    }]
+}
+
+###############################################################################
+# x64 1803 Specific V-Types
+###############################################################################
+win10_mem_comp_x64_1803 = {
+    '_ST_DATA_MGR': [None, {
+        'PagesTree': [0x0, ['pointer', ['_B_TREE']]],
+        'ChunkMetaData': [0xC0, ['_SMHP_CHUNK_METADATA']],
+        'SmkmStore': [0x320, ['pointer', ["_SMKM_STORE"]]],
+        'RegionSizeMask': [0x328, ['unsigned int']],
+        'RegionIndexMask': [0x32C, ['unsigned int']],
+        'CompressionAlgorithm': [0x3E0, ['unsigned short int']],
+    }],
+    '_SMKM_STORE': [None, {
+        'StStore': [0x0, ['_ST_STORE']],
+        'CompressedRegionPtrArray': [0x1848, ['pointer', ['void']]],
+        'OwnerProcess': [0x19A8, ['pointer', ["_EPROCESS"]]]
+    }]
+}
+
+###############################################################################
+# x86 1803 Specific V-Types
+###############################################################################
+win10_mem_comp_x86_1803 = {
+    '_ST_DATA_MGR': [None, {
+        'PagesTree': [0x0, ['pointer', ['_B_TREE']]],
+        'ChunkMetaData': [0x6C, ['_SMHP_CHUNK_METADATA']],
+        'SmkmStore': [0x1C0, ['pointer', ["_SMKM_STORE"]]],
+        'RegionSizeMask': [0x1C4, ['unsigned int']],
+        'RegionIndexMask': [0x1C8, ['unsigned int']],
+        'CompressionAlgorithm': [0x224, ['unsigned short int']],
+    }],
+    '_SMKM_STORE': [None, {
+        'StStore': [0x0, ['_ST_STORE']],
+        'CompressedRegionPtrArray': [0x1184, ['pointer', ['void']]],
+        'OwnerProcess': [0x1254, ['pointer', ["_EPROCESS"]]]
+    }]
+}
+
+###############################################################################
+# x64 1709 Specific V-Types
+###############################################################################
+win10_mem_comp_x64_1709 = {
+    '_ST_DATA_MGR': [None, {
+        'PagesTree': [0x0, ['pointer', ['_B_TREE']]],
+        'ChunkMetaData': [0xC0, ['_SMHP_CHUNK_METADATA']],
+        'SmkmStore': [0x320, ['pointer', ["_SMKM_STORE"]]],
+        'RegionSizeMask': [0x328, ['unsigned int']],
+        'RegionIndexMask': [0x32C, ['unsigned int']],
+        'CompressionAlgorithm': [0x3E0, ['unsigned short int']],
+    }],
+    '_SMKM_STORE': [None, {
+        'StStore': [0x0, ['_ST_STORE']],
+        'CompressedRegionPtrArray': [0x1848, ['pointer', ['void']]],
+        'OwnerProcess': [0x19A8, ['pointer', ["_EPROCESS"]]]
+    }]
+}
+
+###############################################################################
+# x86 1709 Specific V-Types
+###############################################################################
+win10_mem_comp_x86_1709 = {
+    '_ST_DATA_MGR': [None, {
+        'PagesTree': [0x0, ['pointer', ['_B_TREE']]],
+        'ChunkMetaData': [0x6C, ['_SMHP_CHUNK_METADATA']],
+        'SmkmStore': [0x1C0, ['pointer', ["_SMKM_STORE"]]],
+        'RegionSizeMask': [0x1C4, ['unsigned int']],
+        'RegionIndexMask': [0x1C8, ['unsigned int']],
+        'CompressionAlgorithm': [0x224, ['unsigned short int']],
+    }],
+    '_SMKM_STORE': [None, {
+        'StStore': [0x0, ['_ST_STORE']],
+        'CompressedRegionPtrArray': [0x1184, ['pointer', ['void']]],
+        'OwnerProcess': [0x1254, ['pointer', ["_EPROCESS"]]]
+    }]
+}
+
+###############################################################################
+# x64 1703 Specific V-Types
+###############################################################################
+win10_mem_comp_x64_1703 = {
+    '_ST_DATA_MGR': [None, {
+        'PagesTree': [0x0, ['pointer', ['_B_TREE']]],
+        'ChunkMetaData': [0xC0, ['_SMHP_CHUNK_METADATA']],
+        'SmkmStore': [0x320, ['pointer', ["_SMKM_STORE"]]],
+        'RegionSizeMask': [0x328, ['unsigned int']],
+        'RegionIndexMask': [0x32C, ['unsigned int']],
+        'CompressionAlgorithm': [0x3D0, ['unsigned short int']],
+    }],
+    '_SMKM_STORE': [None, {
+        'StStore': [0x0, ['_ST_STORE']],
+        'CompressedRegionPtrArray': [0x1828, ['pointer', ['void']]],
+        'OwnerProcess': [0x1988, ['pointer', ["_EPROCESS"]]]
+    }]
+}
+
+###############################################################################
+# x86 1703 Specific V-Types
+###############################################################################
+win10_mem_comp_x86_1703 = {
+    '_ST_DATA_MGR': [None, {
+        'PagesTree': [0x0, ['pointer', ['_B_TREE']]],
+        'ChunkMetaData': [0x6C, ['_SMHP_CHUNK_METADATA']],
+        'SmkmStore': [0x1C0, ['pointer', ["_SMKM_STORE"]]],
+        'RegionSizeMask': [0x1C4, ['unsigned int']],
+        'RegionIndexMask': [0x1C8, ['unsigned int']],
+        'CompressionAlgorithm': [0x220, ['unsigned short int']],
+    }],
+    '_SMKM_STORE': [None, {
+        'StStore': [0x0, ['_ST_STORE']],
+        'CompressedRegionPtrArray': [0x1174, ['pointer', ['void']]],
+        'OwnerProcess': [0x1244, ['pointer', ["_EPROCESS"]]]
+    }]
+}
+
+###############################################################################
+# x64 1607 Specific V-Types
+###############################################################################
+win10_mem_comp_x64_1607 = {
+    '_ST_DATA_MGR': [None, {
+        'PagesTree': [0x0, ['pointer', ['_B_TREE']]],
+        'ChunkMetaData': [0xC0, ['_SMHP_CHUNK_METADATA']],
+        'SmkmStore': [0x320, ['pointer', ["_SMKM_STORE"]]],
+        'RegionSizeMask': [0x328, ['unsigned int']],
+        'RegionIndexMask': [0x32C, ['unsigned int']],
+        'CompressionAlgorithm': [0x3D0, ['unsigned short int']],
+    }],
+    '_SMKM_STORE': [None, {
+        'StStore': [0x0, ['_ST_STORE']],
+        'CompressedRegionPtrArray': [0x17A8, ['pointer', ['void']]],
+        'OwnerProcess': [0x1918, ['pointer', ["_EPROCESS"]]]
+    }]
+}
+
+###############################################################################
+# x86 1607 Specific V-Types
+###############################################################################
+win10_mem_comp_x86_1607 = {
+    '_ST_DATA_MGR': [None, {
+        'PagesTree': [0x0, ['pointer', ['_B_TREE']]],
+        'ChunkMetaData': [0x6C, ['_SMHP_CHUNK_METADATA']],
+        'SmkmStore': [0x1C0, ['pointer', ["_SMKM_STORE"]]],
+        'RegionSizeMask': [0x1C4, ['unsigned int']],
+        'RegionIndexMask': [0x1C8, ['unsigned int']],
+        'CompressionAlgorithm': [0x220, ['unsigned short int']],
+    }],
+    '_SMKM_STORE': [None, {
+        'StStore': [0x0, ['_ST_STORE']],
+        'CompressedRegionPtrArray': [0x1124, ['pointer', ['void']]],
+        'OwnerProcess': [0x1204, ['pointer', ["_EPROCESS"]]]
+    }]
+}
+
+
+###############################################################################
+# Add V-Types Based on Conditions
+###############################################################################
+class Win10MemCompressWin10x641903(obj.ProfileModification):
+    before = ['WindowsObjectClasses']
+    conditions = {'os': lambda x: x == 'windows',
+                  'major': lambda x: x == 6,
+                  'minor': lambda x: x == 4,
+                  'build': lambda x: x == 18362,
+                  'memory_model': lambda x: x == '64bit'}
+
+    def modification(self, profile):
+        profile.vtypes.update(win10_mem_comp_general_vtypes)
+        profile.vtypes.update(win10_mem_comp_general_x64_vtypes)
+        profile.vtypes.update(win10_mem_comp_x64_1903)
+
+
+class Win10MemCompressWin10x861903(obj.ProfileModification):
+    before = ['WindowsObjectClasses']
+    conditions = {'os': lambda x: x == 'windows',
+                  'major': lambda x: x == 6,
+                  'minor': lambda x: x == 4,
+                  'build': lambda x: x == 18362,
+                  'memory_model': lambda x: x == '32bit'}
+
+    def modification(self, profile):
+        profile.vtypes.update(win10_mem_comp_general_vtypes)
+        profile.vtypes.update(win10_mem_comp_general_x86_vtypes)
+        profile.vtypes.update(win10_mem_comp_x86_1903)
+
+
+class Win10MemCompressWin10x641809(obj.ProfileModification):
+    before = ['WindowsObjectClasses']
+    conditions = {'os': lambda x: x == 'windows',
+                  'major': lambda x: x == 6,
+                  'minor': lambda x: x == 4,
+                  'build': lambda x: x == 17763,
+                  'memory_model': lambda x: x == '64bit'}
+
+    def modification(self, profile):
+        profile.vtypes.update(win10_mem_comp_general_vtypes)
+        profile.vtypes.update(win10_mem_comp_general_x64_vtypes)
+        profile.vtypes.update(win10_mem_comp_x64_1809)
+
+
+class Win10MemCompressWin10x861809(obj.ProfileModification):
+    before = ['WindowsObjectClasses']
+    conditions = {'os': lambda x: x == 'windows',
+                  'major': lambda x: x == 6,
+                  'minor': lambda x: x == 4,
+                  'build': lambda x: x == 17763,
+                  'memory_model': lambda x: x == '32bit'}
+
+    def modification(self, profile):
+        profile.vtypes.update(win10_mem_comp_general_vtypes)
+        profile.vtypes.update(win10_mem_comp_general_x86_vtypes)
+        profile.vtypes.update(win10_mem_comp_x86_1809)
+
+
+class Win10MemCompressWin10x641803(obj.ProfileModification):
+    before = ['WindowsObjectClasses']
+    conditions = {'os': lambda x: x == 'windows',
+                  'major': lambda x: x == 6,
+                  'minor': lambda x: x == 4,
+                  'build': lambda x: x == 17134,
+                  'memory_model': lambda x: x == '64bit'}
+
+    def modification(self, profile):
+        profile.vtypes.update(win10_mem_comp_general_vtypes)
+        profile.vtypes.update(win10_mem_comp_general_x64_vtypes)
+        profile.vtypes.update(win10_mem_comp_x64_1803)
+
+
+class Win10MemCompressWin10x861803(obj.ProfileModification):
+    before = ['WindowsObjectClasses']
+    conditions = {'os': lambda x: x == 'windows',
+                  'major': lambda x: x == 6,
+                  'minor': lambda x: x == 4,
+                  'build': lambda x: x == 17134,
+                  'memory_model': lambda x: x == '32bit'}
+
+    def modification(self, profile):
+        profile.vtypes.update(win10_mem_comp_general_vtypes)
+        profile.vtypes.update(win10_mem_comp_general_x86_vtypes)
+        profile.vtypes.update(win10_mem_comp_x86_1803)
+
+
+class Win10MemCompressWin10x641709(obj.ProfileModification):
+    before = ['WindowsObjectClasses']
+    conditions = {'os': lambda x: x == 'windows',
+                  'major': lambda x: x == 6,
+                  'minor': lambda x: x == 4,
