From df7778c94f08a73de95531e954b4497bc14558a3 Mon Sep 17 00:00:00 2001
From: wikijm <wikijm@users.noreply.github.com>
Date: Sat, 23 Nov 2019 15:47:20 +0100
Subject: [PATCH 1/2] Add profile "Windows 10 x64 Insider Preview Fast Build
 19028 (20H1)"

---
 .../windows/win10_x64_19028_vtypes.py         | 16755 ++++++++++++++++
 .../windows/win10_x64_19028_vtypes.pyc        |   Bin 0 -> 608807 bytes
 2 files changed, 16755 insertions(+)
 create mode 100644 volatility/plugins/overlays/windows/win10_x64_19028_vtypes.py
 create mode 100644 volatility/plugins/overlays/windows/win10_x64_19028_vtypes.pyc

diff --git a/volatility/plugins/overlays/windows/win10_x64_19028_vtypes.py b/volatility/plugins/overlays/windows/win10_x64_19028_vtypes.py
new file mode 100644
index 00000000..85357456
--- /dev/null
+++ b/volatility/plugins/overlays/windows/win10_x64_19028_vtypes.py
@@ -0,0 +1,16755 @@
+ntkrnlmp_types = {
+  'LIST_ENTRY64' : [ 0x10, {
+    'Flink' : [ 0x0, ['unsigned long long']],
+    'Blink' : [ 0x8, ['unsigned long long']],
+} ],
+  'LIST_ENTRY32' : [ 0x8, {
+    'Flink' : [ 0x0, ['unsigned long']],
+    'Blink' : [ 0x4, ['unsigned long']],
+} ],
+  '_PS_MITIGATION_OPTIONS_MAP' : [ 0x10, {
+    'Map' : [ 0x0, ['array', 2, ['unsigned long long']]],
+} ],
+  '_PS_MITIGATION_AUDIT_OPTIONS_MAP' : [ 0x10, {
+    'Map' : [ 0x0, ['array', 2, ['unsigned long long']]],
+} ],
+  '_KUSER_SHARED_DATA' : [ 0x710, {
+    'TickCountLowDeprecated' : [ 0x0, ['unsigned long']],
+    'TickCountMultiplier' : [ 0x4, ['unsigned long']],
+    'InterruptTime' : [ 0x8, ['_KSYSTEM_TIME']],
+    'SystemTime' : [ 0x14, ['_KSYSTEM_TIME']],
+    'TimeZoneBias' : [ 0x20, ['_KSYSTEM_TIME']],
+    'ImageNumberLow' : [ 0x2c, ['unsigned short']],
+    'ImageNumberHigh' : [ 0x2e, ['unsigned short']],
+    'NtSystemRoot' : [ 0x30, ['array', 260, ['wchar']]],
+    'MaxStackTraceDepth' : [ 0x238, ['unsigned long']],
+    'CryptoExponent' : [ 0x23c, ['unsigned long']],
+    'TimeZoneId' : [ 0x240, ['unsigned long']],
+    'LargePageMinimum' : [ 0x244, ['unsigned long']],
+    'AitSamplingValue' : [ 0x248, ['unsigned long']],
+    'AppCompatFlag' : [ 0x24c, ['unsigned long']],
+    'RNGSeedVersion' : [ 0x250, ['unsigned long long']],
+    'GlobalValidationRunlevel' : [ 0x258, ['unsigned long']],
+    'TimeZoneBiasStamp' : [ 0x25c, ['long']],
+    'NtBuildNumber' : [ 0x260, ['unsigned long']],
+    'NtProductType' : [ 0x264, ['Enumeration', dict(target = 'long', choices = {1: u'NtProductWinNt', 2: u'NtProductLanManNt', 3: u'NtProductServer'})]],
+    'ProductTypeIsValid' : [ 0x268, ['unsigned char']],
+    'Reserved0' : [ 0x269, ['array', 1, ['unsigned char']]],
+    'NativeProcessorArchitecture' : [ 0x26a, ['unsigned short']],
+    'NtMajorVersion' : [ 0x26c, ['unsigned long']],
+    'NtMinorVersion' : [ 0x270, ['unsigned long']],
+    'ProcessorFeatures' : [ 0x274, ['array', 64, ['unsigned char']]],
+    'Reserved1' : [ 0x2b4, ['unsigned long']],
+    'Reserved3' : [ 0x2b8, ['unsigned long']],
+    'TimeSlip' : [ 0x2bc, ['unsigned long']],
+    'AlternativeArchitecture' : [ 0x2c0, ['Enumeration', dict(target = 'long', choices = {0: u'StandardDesign', 1: u'NEC98x86', 2: u'EndAlternatives'})]],
+    'BootId' : [ 0x2c4, ['unsigned long']],
+    'SystemExpirationDate' : [ 0x2c8, ['_LARGE_INTEGER']],
+    'SuiteMask' : [ 0x2d0, ['unsigned long']],
+    'KdDebuggerEnabled' : [ 0x2d4, ['unsigned char']],
+    'MitigationPolicies' : [ 0x2d5, ['unsigned char']],
+    'NXSupportPolicy' : [ 0x2d5, ['BitField', dict(start_bit = 0, end_bit = 2, native_type='unsigned char')]],
+    'SEHValidationPolicy' : [ 0x2d5, ['BitField', dict(start_bit = 2, end_bit = 4, native_type='unsigned char')]],
+    'CurDirDevicesSkippedForDlls' : [ 0x2d5, ['BitField', dict(start_bit = 4, end_bit = 6, native_type='unsigned char')]],
+    'Reserved' : [ 0x2d5, ['BitField', dict(start_bit = 6, end_bit = 8, native_type='unsigned char')]],
+    'CyclesPerYield' : [ 0x2d6, ['unsigned short']],
+    'ActiveConsoleId' : [ 0x2d8, ['unsigned long']],
+    'DismountCount' : [ 0x2dc, ['unsigned long']],
+    'ComPlusPackage' : [ 0x2e0, ['unsigned long']],
+    'LastSystemRITEventTickCount' : [ 0x2e4, ['unsigned long']],
+    'NumberOfPhysicalPages' : [ 0x2e8, ['unsigned long']],
+    'SafeBootMode' : [ 0x2ec, ['unsigned char']],
+    'VirtualizationFlags' : [ 0x2ed, ['unsigned char']],
+    'Reserved12' : [ 0x2ee, ['array', 2, ['unsigned char']]],
+    'SharedDataFlags' : [ 0x2f0, ['unsigned long']],
+    'DbgErrorPortPresent' : [ 0x2f0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
+    'DbgElevationEnabled' : [ 0x2f0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
+    'DbgVirtEnabled' : [ 0x2f0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
+    'DbgInstallerDetectEnabled' : [ 0x2f0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
+    'DbgLkgEnabled' : [ 0x2f0, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
+    'DbgDynProcessorEnabled' : [ 0x2f0, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
+    'DbgConsoleBrokerEnabled' : [ 0x2f0, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
+    'DbgSecureBootEnabled' : [ 0x2f0, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
+    'DbgMultiSessionSku' : [ 0x2f0, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long')]],
+    'DbgMultiUsersInSessionSku' : [ 0x2f0, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long')]],
+    'DbgStateSeparationEnabled' : [ 0x2f0, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned long')]],
+    'SpareBits' : [ 0x2f0, ['BitField', dict(start_bit = 11, end_bit = 32, native_type='unsigned long')]],
+    'DataFlagsPad' : [ 0x2f4, ['array', 1, ['unsigned long']]],
+    'TestRetInstruction' : [ 0x2f8, ['unsigned long long']],
+    'QpcFrequency' : [ 0x300, ['long long']],
+    'SystemCall' : [ 0x308, ['unsigned long']],
+    'SystemCallPad0' : [ 0x30c, ['unsigned long']],
+    'SystemCallPad' : [ 0x310, ['array', 2, ['unsigned long long']]],
+    'TickCount' : [ 0x320, ['_KSYSTEM_TIME']],
+    'TickCountQuad' : [ 0x320, ['unsigned long long']],
+    'ReservedTickCountOverlay' : [ 0x320, ['array', 3, ['unsigned long']]],
+    'TickCountPad' : [ 0x32c, ['array', 1, ['unsigned long']]],
+    'Cookie' : [ 0x330, ['unsigned long']],
+    'CookiePad' : [ 0x334, ['array', 1, ['unsigned long']]],
+    'ConsoleSessionForegroundProcessId' : [ 0x338, ['long long']],
+    'TimeUpdateLock' : [ 0x340, ['unsigned long long']],
+    'BaselineSystemTimeQpc' : [ 0x348, ['unsigned long long']],
+    'BaselineInterruptTimeQpc' : [ 0x350, ['unsigned long long']],
+    'QpcSystemTimeIncrement' : [ 0x358, ['unsigned long long']],
+    'QpcInterruptTimeIncrement' : [ 0x360, ['unsigned long long']],
+    'QpcSystemTimeIncrementShift' : [ 0x368, ['unsigned char']],
+    'QpcInterruptTimeIncrementShift' : [ 0x369, ['unsigned char']],
+    'UnparkedProcessorCount' : [ 0x36a, ['unsigned short']],
+    'EnclaveFeatureMask' : [ 0x36c, ['array', 4, ['unsigned long']]],
+    'TelemetryCoverageRound' : [ 0x37c, ['unsigned long']],
+    'UserModeGlobalLogger' : [ 0x380, ['array', 16, ['unsigned short']]],
+    'ImageFileExecutionOptions' : [ 0x3a0, ['unsigned long']],
+    'LangGenerationCount' : [ 0x3a4, ['unsigned long']],
+    'Reserved4' : [ 0x3a8, ['unsigned long long']],
+    'InterruptTimeBias' : [ 0x3b0, ['unsigned long long']],
+    'QpcBias' : [ 0x3b8, ['unsigned long long']],
+    'ActiveProcessorCount' : [ 0x3c0, ['unsigned long']],
+    'ActiveGroupCount' : [ 0x3c4, ['unsigned char']],
+    'Reserved9' : [ 0x3c5, ['unsigned char']],
+    'QpcData' : [ 0x3c6, ['unsigned short']],
+    'QpcBypassEnabled' : [ 0x3c6, ['unsigned char']],
+    'QpcShift' : [ 0x3c7, ['unsigned char']],
+    'TimeZoneBiasEffectiveStart' : [ 0x3c8, ['_LARGE_INTEGER']],
+    'TimeZoneBiasEffectiveEnd' : [ 0x3d0, ['_LARGE_INTEGER']],
+    'XState' : [ 0x3d8, ['_XSTATE_CONFIGURATION']],
+} ],
+  '__unnamed_108b' : [ 0x8, {
+    'LowPart' : [ 0x0, ['unsigned long']],
+    'HighPart' : [ 0x4, ['unsigned long']],
+} ],
+  '_ULARGE_INTEGER' : [ 0x8, {
+    'LowPart' : [ 0x0, ['unsigned long']],
+    'HighPart' : [ 0x4, ['unsigned long']],
+    'u' : [ 0x0, ['__unnamed_108b']],
+    'QuadPart' : [ 0x0, ['unsigned long long']],
+} ],
+  '__unnamed_10a3' : [ 0x4, {
+    'LongFunction' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
+    'Persistent' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
+    'Private' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 32, native_type='unsigned long')]],
+} ],
+  '__unnamed_10a5' : [ 0x4, {
+    'Flags' : [ 0x0, ['unsigned long']],
+    's' : [ 0x0, ['__unnamed_10a3']],
+} ],
+  '_TP_CALLBACK_ENVIRON_V3' : [ 0x48, {
+    'Version' : [ 0x0, ['unsigned long']],
+    'Pool' : [ 0x8, ['pointer64', ['_TP_POOL']]],
+    'CleanupGroup' : [ 0x10, ['pointer64', ['_TP_CLEANUP_GROUP']]],
+    'CleanupGroupCancelCallback' : [ 0x18, ['pointer64', ['void']]],
+    'RaceDll' : [ 0x20, ['pointer64', ['void']]],
+    'ActivationContext' : [ 0x28, ['pointer64', ['_ACTIVATION_CONTEXT']]],
+    'FinalizationCallback' : [ 0x30, ['pointer64', ['void']]],
+    'u' : [ 0x38, ['__unnamed_10a5']],
+    'CallbackPriority' : [ 0x3c, ['Enumeration', dict(target = 'long', choices = {0: u'TP_CALLBACK_PRIORITY_HIGH', 1: u'TP_CALLBACK_PRIORITY_NORMAL', 2: u'TP_CALLBACK_PRIORITY_LOW', 3: u'TP_CALLBACK_PRIORITY_COUNT'})]],
+    'Size' : [ 0x40, ['unsigned long']],
+} ],
+  '_TEB' : [ 0x1838, {
+    'NtTib' : [ 0x0, ['_NT_TIB']],
+    'EnvironmentPointer' : [ 0x38, ['pointer64', ['void']]],
+    'ClientId' : [ 0x40, ['_CLIENT_ID']],
+    'ActiveRpcHandle' : [ 0x50, ['pointer64', ['void']]],
+    'ThreadLocalStoragePointer' : [ 0x58, ['pointer64', ['void']]],
+    'ProcessEnvironmentBlock' : [ 0x60, ['pointer64', ['_PEB']]],
+    'LastErrorValue' : [ 0x68, ['unsigned long']],
+    'CountOfOwnedCriticalSections' : [ 0x6c, ['unsigned long']],
+    'CsrClientThread' : [ 0x70, ['pointer64', ['void']]],
+    'Win32ThreadInfo' : [ 0x78, ['pointer64', ['void']]],
+    'User32Reserved' : [ 0x80, ['array', 26, ['unsigned long']]],
+    'UserReserved' : [ 0xe8, ['array', 5, ['unsigned long']]],
+    'WOW32Reserved' : [ 0x100, ['pointer64', ['void']]],
+    'CurrentLocale' : [ 0x108, ['unsigned long']],
+    'FpSoftwareStatusRegister' : [ 0x10c, ['unsigned long']],
+    'ReservedForDebuggerInstrumentation' : [ 0x110, ['array', 16, ['pointer64', ['void']]]],
+    'SystemReserved1' : [ 0x190, ['array', 30, ['pointer64', ['void']]]],
+    'PlaceholderCompatibilityMode' : [ 0x280, ['unsigned char']],
+    'PlaceholderHydrationAlwaysExplicit' : [ 0x281, ['unsigned char']],
+    'PlaceholderReserved' : [ 0x282, ['array', 10, ['unsigned char']]],
+    'ProxiedProcessId' : [ 0x28c, ['unsigned long']],
+    '_ActivationStack' : [ 0x290, ['_ACTIVATION_CONTEXT_STACK']],
+    'WorkingOnBehalfTicket' : [ 0x2b8, ['array', 8, ['unsigned char']]],
+    'ExceptionCode' : [ 0x2c0, ['long']],
+    'Padding0' : [ 0x2c4, ['array', 4, ['unsigned char']]],
+    'ActivationContextStackPointer' : [ 0x2c8, ['pointer64', ['_ACTIVATION_CONTEXT_STACK']]],
+    'InstrumentationCallbackSp' : [ 0x2d0, ['unsigned long long']],
+    'InstrumentationCallbackPreviousPc' : [ 0x2d8, ['unsigned long long']],
+    'InstrumentationCallbackPreviousSp' : [ 0x2e0, ['unsigned long long']],
+    'TxFsContext' : [ 0x2e8, ['unsigned long']],
+    'InstrumentationCallbackDisabled' : [ 0x2ec, ['unsigned char']],
+    'UnalignedLoadStoreExceptions' : [ 0x2ed, ['unsigned char']],
+    'Padding1' : [ 0x2ee, ['array', 2, ['unsigned char']]],
+    'GdiTebBatch' : [ 0x2f0, ['_GDI_TEB_BATCH']],
+    'RealClientId' : [ 0x7d8, ['_CLIENT_ID']],
+    'GdiCachedProcessHandle' : [ 0x7e8, ['pointer64', ['void']]],
+    'GdiClientPID' : [ 0x7f0, ['unsigned long']],
+    'GdiClientTID' : [ 0x7f4, ['unsigned long']],
+    'GdiThreadLocalInfo' : [ 0x7f8, ['pointer64', ['void']]],
+    'Win32ClientInfo' : [ 0x800, ['array', 62, ['unsigned long long']]],
+    'glDispatchTable' : [ 0x9f0, ['array', 233, ['pointer64', ['void']]]],
+    'glReserved1' : [ 0x1138, ['array', 29, ['unsigned long long']]],
+    'glReserved2' : [ 0x1220, ['pointer64', ['void']]],
+    'glSectionInfo' : [ 0x1228, ['pointer64', ['void']]],
+    'glSection' : [ 0x1230, ['pointer64', ['void']]],
+    'glTable' : [ 0x1238, ['pointer64', ['void']]],
+    'glCurrentRC' : [ 0x1240, ['pointer64', ['void']]],
+    'glContext' : [ 0x1248, ['pointer64', ['void']]],
+    'LastStatusValue' : [ 0x1250, ['unsigned long']],
+    'Padding2' : [ 0x1254, ['array', 4, ['unsigned char']]],
+    'StaticUnicodeString' : [ 0x1258, ['_UNICODE_STRING']],
+    'StaticUnicodeBuffer' : [ 0x1268, ['array', 261, ['wchar']]],
+    'Padding3' : [ 0x1472, ['array', 6, ['unsigned char']]],
+    'DeallocationStack' : [ 0x1478, ['pointer64', ['void']]],
+    'TlsSlots' : [ 0x1480, ['array', 64, ['pointer64', ['void']]]],
+    'TlsLinks' : [ 0x1680, ['_LIST_ENTRY']],
+    'Vdm' : [ 0x1690, ['pointer64', ['void']]],
+    'ReservedForNtRpc' : [ 0x1698, ['pointer64', ['void']]],
+    'DbgSsReserved' : [ 0x16a0, ['array', 2, ['pointer64', ['void']]]],
+    'HardErrorMode' : [ 0x16b0, ['unsigned long']],
+    'Padding4' : [ 0x16b4, ['array', 4, ['unsigned char']]],
+    'Instrumentation' : [ 0x16b8, ['array', 11, ['pointer64', ['void']]]],
+    'ActivityId' : [ 0x1710, ['_GUID']],
+    'SubProcessTag' : [ 0x1720, ['pointer64', ['void']]],
+    'PerflibData' : [ 0x1728, ['pointer64', ['void']]],
+    'EtwTraceData' : [ 0x1730, ['pointer64', ['void']]],
+    'WinSockData' : [ 0x1738, ['pointer64', ['void']]],
+    'GdiBatchCount' : [ 0x1740, ['unsigned long']],
+    'CurrentIdealProcessor' : [ 0x1744, ['_PROCESSOR_NUMBER']],
+    'IdealProcessorValue' : [ 0x1744, ['unsigned long']],
+    'ReservedPad0' : [ 0x1744, ['unsigned char']],
+    'ReservedPad1' : [ 0x1745, ['unsigned char']],
+    'ReservedPad2' : [ 0x1746, ['unsigned char']],
+    'IdealProcessor' : [ 0x1747, ['unsigned char']],
+    'GuaranteedStackBytes' : [ 0x1748, ['unsigned long']],
+    'Padding5' : [ 0x174c, ['array', 4, ['unsigned char']]],
+    'ReservedForPerf' : [ 0x1750, ['pointer64', ['void']]],
+    'ReservedForOle' : [ 0x1758, ['pointer64', ['void']]],
+    'WaitingOnLoaderLock' : [ 0x1760, ['unsigned long']],
+    'Padding6' : [ 0x1764, ['array', 4, ['unsigned char']]],
+    'SavedPriorityState' : [ 0x1768, ['pointer64', ['void']]],
+    'ReservedForCodeCoverage' : [ 0x1770, ['unsigned long long']],
+    'ThreadPoolData' : [ 0x1778, ['pointer64', ['void']]],
+    'TlsExpansionSlots' : [ 0x1780, ['pointer64', ['pointer64', ['void']]]],
+    'DeallocationBStore' : [ 0x1788, ['pointer64', ['void']]],
+    'BStoreLimit' : [ 0x1790, ['pointer64', ['void']]],
+    'MuiGeneration' : [ 0x1798, ['unsigned long']],
+    'IsImpersonating' : [ 0x179c, ['unsigned long']],
+    'NlsCache' : [ 0x17a0, ['pointer64', ['void']]],
+    'pShimData' : [ 0x17a8, ['pointer64', ['void']]],
+    'HeapData' : [ 0x17b0, ['unsigned long']],
+    'Padding7' : [ 0x17b4, ['array', 4, ['unsigned char']]],
+    'CurrentTransactionHandle' : [ 0x17b8, ['pointer64', ['void']]],
+    'ActiveFrame' : [ 0x17c0, ['pointer64', ['_TEB_ACTIVE_FRAME']]],
+    'FlsData' : [ 0x17c8, ['pointer64', ['void']]],
+    'PreferredLanguages' : [ 0x17d0, ['pointer64', ['void']]],
+    'UserPrefLanguages' : [ 0x17d8, ['pointer64', ['void']]],
+    'MergedPrefLanguages' : [ 0x17e0, ['pointer64', ['void']]],
+    'MuiImpersonation' : [ 0x17e8, ['unsigned long']],
+    'CrossTebFlags' : [ 0x17ec, ['unsigned short']],
+    'SpareCrossTebBits' : [ 0x17ec, ['BitField', dict(start_bit = 0, end_bit = 16, native_type='unsigned short')]],
+    'SameTebFlags' : [ 0x17ee, ['unsigned short']],
+    'SafeThunkCall' : [ 0x17ee, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned short')]],
+    'InDebugPrint' : [ 0x17ee, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned short')]],
+    'HasFiberData' : [ 0x17ee, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned short')]],
+    'SkipThreadAttach' : [ 0x17ee, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned short')]],
+    'WerInShipAssertCode' : [ 0x17ee, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned short')]],
+    'RanProcessInit' : [ 0x17ee, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned short')]],
+    'ClonedThread' : [ 0x17ee, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned short')]],
+    'SuppressDebugMsg' : [ 0x17ee, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned short')]],
+    'DisableUserStackWalk' : [ 0x17ee, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned short')]],
+    'RtlExceptionAttached' : [ 0x17ee, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned short')]],
+    'InitialThread' : [ 0x17ee, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned short')]],
+    'SessionAware' : [ 0x17ee, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned short')]],
+    'LoadOwner' : [ 0x17ee, ['BitField', dict(start_bit = 12, end_bit = 13, native_type='unsigned short')]],
+    'LoaderWorker' : [ 0x17ee, ['BitField', dict(start_bit = 13, end_bit = 14, native_type='unsigned short')]],
+    'SkipLoaderInit' : [ 0x17ee, ['BitField', dict(start_bit = 14, end_bit = 15, native_type='unsigned short')]],
+    'SpareSameTebBits' : [ 0x17ee, ['BitField', dict(start_bit = 15, end_bit = 16, native_type='unsigned short')]],
+    'TxnScopeEnterCallback' : [ 0x17f0, ['pointer64', ['void']]],
+    'TxnScopeExitCallback' : [ 0x17f8, ['pointer64', ['void']]],
+    'TxnScopeContext' : [ 0x1800, ['pointer64', ['void']]],
+    'LockCount' : [ 0x1808, ['unsigned long']],
+    'WowTebOffset' : [ 0x180c, ['long']],
+    'ResourceRetValue' : [ 0x1810, ['pointer64', ['void']]],
+    'ReservedForWdf' : [ 0x1818, ['pointer64', ['void']]],
+    'ReservedForCrt' : [ 0x1820, ['unsigned long long']],
+    'EffectiveContainerId' : [ 0x1828, ['_GUID']],
+} ],
+  '_LIST_ENTRY' : [ 0x10, {
+    'Flink' : [ 0x0, ['pointer64', ['_LIST_ENTRY']]],
+    'Blink' : [ 0x8, ['pointer64', ['_LIST_ENTRY']]],
+} ],
+  '_SINGLE_LIST_ENTRY' : [ 0x8, {
+    'Next' : [ 0x0, ['pointer64', ['_SINGLE_LIST_ENTRY']]],
+} ],
+  '_RTL_SPLAY_LINKS' : [ 0x18, {
+    'Parent' : [ 0x0, ['pointer64', ['_RTL_SPLAY_LINKS']]],
+    'LeftChild' : [ 0x8, ['pointer64', ['_RTL_SPLAY_LINKS']]],
+    'RightChild' : [ 0x10, ['pointer64', ['_RTL_SPLAY_LINKS']]],
+} ],
+  '_RTL_DYNAMIC_HASH_TABLE_CONTEXT' : [ 0x18, {
+    'ChainHead' : [ 0x0, ['pointer64', ['_LIST_ENTRY']]],
+    'PrevLinkage' : [ 0x8, ['pointer64', ['_LIST_ENTRY']]],
+    'Signature' : [ 0x10, ['unsigned long long']],
+} ],
+  '_RTL_DYNAMIC_HASH_TABLE_ENUMERATOR' : [ 0x28, {
+    'HashEntry' : [ 0x0, ['_RTL_DYNAMIC_HASH_TABLE_ENTRY']],
+    'CurEntry' : [ 0x0, ['pointer64', ['_LIST_ENTRY']]],
+    'ChainHead' : [ 0x18, ['pointer64', ['_LIST_ENTRY']]],
+    'BucketIndex' : [ 0x20, ['unsigned long']],
+} ],
+  '_RTL_DYNAMIC_HASH_TABLE' : [ 0x28, {
+    'Flags' : [ 0x0, ['unsigned long']],
+    'Shift' : [ 0x4, ['unsigned long']],
+    'TableSize' : [ 0x8, ['unsigned long']],
+    'Pivot' : [ 0xc, ['unsigned long']],
+    'DivisorMask' : [ 0x10, ['unsigned long']],
+    'NumEntries' : [ 0x14, ['unsigned long']],
+    'NonEmptyBuckets' : [ 0x18, ['unsigned long']],
+    'NumEnumerators' : [ 0x1c, ['unsigned long']],
+    'Directory' : [ 0x20, ['pointer64', ['void']]],
+} ],
+  '_UNICODE_STRING' : [ 0x10, {
+    'Length' : [ 0x0, ['unsigned short']],
+    'MaximumLength' : [ 0x2, ['unsigned short']],
+    'Buffer' : [ 0x8, ['pointer64', ['wchar']]],
+} ],
+  '_STRING' : [ 0x10, {
+    'Length' : [ 0x0, ['unsigned short']],
+    'MaximumLength' : [ 0x2, ['unsigned short']],
+    'Buffer' : [ 0x8, ['pointer64', ['unsigned char']]],
+} ],
+  '__unnamed_1119' : [ 0x8, {
+    'LowPart' : [ 0x0, ['unsigned long']],
+    'HighPart' : [ 0x4, ['long']],
+} ],
+  '_LARGE_INTEGER' : [ 0x8, {
+    'LowPart' : [ 0x0, ['unsigned long']],
+    'HighPart' : [ 0x4, ['long']],
+    'u' : [ 0x0, ['__unnamed_1119']],
+    'QuadPart' : [ 0x0, ['long long']],
+} ],
+  '_RTL_BITMAP' : [ 0x10, {
+    'SizeOfBitMap' : [ 0x0, ['unsigned long']],
+    'Buffer' : [ 0x8, ['pointer64', ['unsigned long']]],
+} ],
+  '_LUID' : [ 0x8, {
+    'LowPart' : [ 0x0, ['unsigned long']],
+    'HighPart' : [ 0x4, ['long']],
+} ],
+  '_CUSTOM_SYSTEM_EVENT_TRIGGER_CONFIG' : [ 0x10, {
+    'Size' : [ 0x0, ['unsigned long']],
+    'TriggerId' : [ 0x8, ['pointer64', ['wchar']]],
+} ],
+  '_IMAGE_NT_HEADERS64' : [ 0x108, {
+    'Signature' : [ 0x0, ['unsigned long']],
+    'FileHeader' : [ 0x4, ['_IMAGE_FILE_HEADER']],
+    'OptionalHeader' : [ 0x18, ['_IMAGE_OPTIONAL_HEADER64']],
+} ],
+  '_IMAGE_DOS_HEADER' : [ 0x40, {
+    'e_magic' : [ 0x0, ['unsigned short']],
+    'e_cblp' : [ 0x2, ['unsigned short']],
+    'e_cp' : [ 0x4, ['unsigned short']],
+    'e_crlc' : [ 0x6, ['unsigned short']],
+    'e_cparhdr' : [ 0x8, ['unsigned short']],
+    'e_minalloc' : [ 0xa, ['unsigned short']],
+    'e_maxalloc' : [ 0xc, ['unsigned short']],
+    'e_ss' : [ 0xe, ['unsigned short']],
+    'e_sp' : [ 0x10, ['unsigned short']],
+    'e_csum' : [ 0x12, ['unsigned short']],
+    'e_ip' : [ 0x14, ['unsigned short']],
+    'e_cs' : [ 0x16, ['unsigned short']],
+    'e_lfarlc' : [ 0x18, ['unsigned short']],
+    'e_ovno' : [ 0x1a, ['unsigned short']],
+    'e_res' : [ 0x1c, ['array', 4, ['unsigned short']]],
+    'e_oemid' : [ 0x24, ['unsigned short']],
+    'e_oeminfo' : [ 0x26, ['unsigned short']],
+    'e_res2' : [ 0x28, ['array', 10, ['unsigned short']]],
+    'e_lfanew' : [ 0x3c, ['long']],
+} ],
+  '_RTL_RB_TREE' : [ 0x10, {
+    'Root' : [ 0x0, ['pointer64', ['_RTL_BALANCED_NODE']]],
+    'Encoded' : [ 0x8, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
+    'Min' : [ 0x8, ['pointer64', ['_RTL_BALANCED_NODE']]],
+} ],
+  '_RTL_BALANCED_NODE' : [ 0x18, {
+    'Children' : [ 0x0, ['array', 2, ['pointer64', ['_RTL_BALANCED_NODE']]]],
+    'Left' : [ 0x0, ['pointer64', ['_RTL_BALANCED_NODE']]],
+    'Right' : [ 0x8, ['pointer64', ['_RTL_BALANCED_NODE']]],
+    'Red' : [ 0x10, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
+    'Balance' : [ 0x10, ['BitField', dict(start_bit = 0, end_bit = 2, native_type='unsigned char')]],
+    'ParentValue' : [ 0x10, ['unsigned long long']],
+} ],
+  '_RTL_AVL_TREE' : [ 0x8, {
+    'Root' : [ 0x0, ['pointer64', ['_RTL_BALANCED_NODE']]],
+} ],
+  '_GUID' : [ 0x10, {
+    'Data1' : [ 0x0, ['unsigned long']],
+    'Data2' : [ 0x4, ['unsigned short']],
+    'Data3' : [ 0x6, ['unsigned short']],
+    'Data4' : [ 0x8, ['array', 8, ['unsigned char']]],
+} ],
+  '_KPCR' : [ 0x9080, {
+    'NtTib' : [ 0x0, ['_NT_TIB']],
+    'GdtBase' : [ 0x0, ['pointer64', ['_KGDTENTRY64']]],
+    'TssBase' : [ 0x8, ['pointer64', ['_KTSS64']]],
+    'UserRsp' : [ 0x10, ['unsigned long long']],
+    'Self' : [ 0x18, ['pointer64', ['_KPCR']]],
+    'CurrentPrcb' : [ 0x20, ['pointer64', ['_KPRCB']]],
+    'LockArray' : [ 0x28, ['pointer64', ['_KSPIN_LOCK_QUEUE']]],
+    'Used_Self' : [ 0x30, ['pointer64', ['void']]],
+    'IdtBase' : [ 0x38, ['pointer64', ['_KIDTENTRY64']]],
+    'Unused' : [ 0x40, ['array', 2, ['unsigned long long']]],
+    'Irql' : [ 0x50, ['unsigned char']],
+    'SecondLevelCacheAssociativity' : [ 0x51, ['unsigned char']],
+    'ObsoleteNumber' : [ 0x52, ['unsigned char']],
+    'Fill0' : [ 0x53, ['unsigned char']],
+    'Unused0' : [ 0x54, ['array', 3, ['unsigned long']]],
+    'MajorVersion' : [ 0x60, ['unsigned short']],
+    'MinorVersion' : [ 0x62, ['unsigned short']],
+    'StallScaleFactor' : [ 0x64, ['unsigned long']],
+    'Unused1' : [ 0x68, ['array', 3, ['pointer64', ['void']]]],
+    'KernelReserved' : [ 0x80, ['array', 15, ['unsigned long']]],
+    'SecondLevelCacheSize' : [ 0xbc, ['unsigned long']],
+    'HalReserved' : [ 0xc0, ['array', 16, ['unsigned long']]],
+    'Unused2' : [ 0x100, ['unsigned long']],
+    'KdVersionBlock' : [ 0x108, ['pointer64', ['void']]],
+    'Unused3' : [ 0x110, ['pointer64', ['void']]],
+    'PcrAlign1' : [ 0x118, ['array', 24, ['unsigned long']]],
+    'Prcb' : [ 0x180, ['_KPRCB']],
+} ],
+  '__unnamed_11db' : [ 0x38, {
+    'UpdateCycle' : [ 0x0, ['unsigned long']],
+    'PairLocal' : [ 0x4, ['short']],
+    'PairLocalLow' : [ 0x4, ['unsigned char']],
+    'PairLocalForceStibp' : [ 0x5, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
+    'Reserved' : [ 0x5, ['BitField', dict(start_bit = 1, end_bit = 5, native_type='unsigned char')]],
+    'Frozen' : [ 0x5, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned char')]],
+    'ForceUntrusted' : [ 0x5, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned char')]],
+    'SynchIpi' : [ 0x5, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned char')]],
+    'PairRemote' : [ 0x6, ['short']],
+    'PairRemoteLow' : [ 0x6, ['unsigned char']],
+    'Reserved2' : [ 0x7, ['unsigned char']],
+    'Trace' : [ 0x8, ['array', 24, ['unsigned char']]],
+    'LocalDomain' : [ 0x20, ['unsigned long long']],
+    'RemoteDomain' : [ 0x28, ['unsigned long long']],
+    'Thread' : [ 0x30, ['pointer64', ['_KTHREAD']]],
+} ],
+  '_KPRCB' : [ 0x8f00, {
+    'MxCsr' : [ 0x0, ['unsigned long']],
+    'LegacyNumber' : [ 0x4, ['unsigned char']],
+    'ReservedMustBeZero' : [ 0x5, ['unsigned char']],
+    'InterruptRequest' : [ 0x6, ['unsigned char']],
+    'IdleHalt' : [ 0x7, ['unsigned char']],
+    'CurrentThread' : [ 0x8, ['pointer64', ['_KTHREAD']]],
+    'NextThread' : [ 0x10, ['pointer64', ['_KTHREAD']]],
+    'IdleThread' : [ 0x18, ['pointer64', ['_KTHREAD']]],
+    'NestingLevel' : [ 0x20, ['unsigned char']],
+    'ClockOwner' : [ 0x21, ['unsigned char']],
+    'PendingTickFlags' : [ 0x22, ['unsigned char']],
+    'PendingTick' : [ 0x22, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
+    'PendingBackupTick' : [ 0x22, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned char')]],
+    'IdleState' : [ 0x23, ['unsigned char']],
+    'Number' : [ 0x24, ['unsigned long']],
+    'RspBase' : [ 0x28, ['unsigned long long']],
+    'PrcbLock' : [ 0x30, ['unsigned long long']],
+    'PriorityState' : [ 0x38, ['pointer64', ['unsigned char']]],
+    'CpuType' : [ 0x40, ['unsigned char']],
+    'CpuID' : [ 0x41, ['unsigned char']],
+    'CpuStep' : [ 0x42, ['unsigned short']],
+    'CpuStepping' : [ 0x42, ['unsigned char']],
+    'CpuModel' : [ 0x43, ['unsigned char']],
+    'MHz' : [ 0x44, ['unsigned long']],
+    'HalReserved' : [ 0x48, ['array', 8, ['unsigned long long']]],
+    'MinorVersion' : [ 0x88, ['unsigned short']],
+    'MajorVersion' : [ 0x8a, ['unsigned short']],
+    'BuildType' : [ 0x8c, ['unsigned char']],
+    'CpuVendor' : [ 0x8d, ['unsigned char']],
+    'CoresPerPhysicalProcessor' : [ 0x8e, ['unsigned char']],
+    'LogicalProcessorsPerCore' : [ 0x8f, ['unsigned char']],
+    'TscFrequency' : [ 0x90, ['unsigned long long']],
+    'PrcbPad04' : [ 0x98, ['array', 5, ['unsigned long long']]],
+    'ParentNode' : [ 0xc0, ['pointer64', ['_KNODE']]],
+    'GroupSetMember' : [ 0xc8, ['unsigned long long']],
+    'Group' : [ 0xd0, ['unsigned char']],
+    'GroupIndex' : [ 0xd1, ['unsigned char']],
+    'PrcbPad05' : [ 0xd2, ['array', 2, ['unsigned char']]],
+    'InitialApicId' : [ 0xd4, ['unsigned long']],
+    'ScbOffset' : [ 0xd8, ['unsigned long']],
+    'ApicMask' : [ 0xdc, ['unsigned long']],
+    'AcpiReserved' : [ 0xe0, ['pointer64', ['void']]],
+    'CFlushSize' : [ 0xe8, ['unsigned long']],
+    'PrcbFlags' : [ 0xec, ['_KPRCBFLAG']],
+    'TrappedSecurityDomain' : [ 0xf0, ['unsigned long long']],
+    'BpbState' : [ 0xf8, ['unsigned char']],
+    'BpbCpuIdle' : [ 0xf8, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
+    'BpbFlushRsbOnTrap' : [ 0xf8, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned char')]],
+    'BpbIbpbOnReturn' : [ 0xf8, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned char')]],
+    'BpbIbpbOnTrap' : [ 0xf8, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned char')]],
+    'BpbIbpbOnRetpolineExit' : [ 0xf8, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned char')]],
+    'BpbStateReserved' : [ 0xf8, ['BitField', dict(start_bit = 5, end_bit = 8, native_type='unsigned char')]],
+    'BpbFeatures' : [ 0xf9, ['unsigned char']],
+    'BpbClearOnIdle' : [ 0xf9, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
+    'BpbEnabled' : [ 0xf9, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned char')]],
+    'BpbSmep' : [ 0xf9, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned char')]],
+    'BpbFeaturesReserved' : [ 0xf9, ['BitField', dict(start_bit = 3, end_bit = 8, native_type='unsigned char')]],
+    'BpbCurrentSpecCtrl' : [ 0xfa, ['unsigned char']],
+    'BpbKernelSpecCtrl' : [ 0xfb, ['unsigned char']],
+    'BpbNmiSpecCtrl' : [ 0xfc, ['unsigned char']],
+    'BpbUserSpecCtrl' : [ 0xfd, ['unsigned char']],
+    'PairRegister' : [ 0xfe, ['short']],
+    'PrcbPad11' : [ 0xf0, ['array', 2, ['unsigned long long']]],
+    'ProcessorState' : [ 0x100, ['_KPROCESSOR_STATE']],
+    'ExtendedSupervisorState' : [ 0x6c0, ['pointer64', ['_XSAVE_AREA_HEADER']]],
+    'ProcessorSignature' : [ 0x6c8, ['unsigned long']],
+    'ProcessorFlags' : [ 0x6cc, ['unsigned long']],
+    'BpbRetpolineExitSpecCtrl' : [ 0x6d0, ['unsigned char']],
+    'BpbTrappedRetpolineExitSpecCtrl' : [ 0x6d1, ['unsigned char']],
+    'BpbTrappedBpbState' : [ 0x6d2, ['unsigned char']],
+    'BpbTrappedCpuIdle' : [ 0x6d2, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
+    'BpbTrappedFlushRsbOnTrap' : [ 0x6d2, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned char')]],
+    'BpbTrappedIbpbOnReturn' : [ 0x6d2, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned char')]],
+    'BpbTrappedIbpbOnTrap' : [ 0x6d2, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned char')]],
+    'BpbTrappedIbpbOnRetpolineExit' : [ 0x6d2, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned char')]],
+    'BpbtrappedBpbStateReserved' : [ 0x6d2, ['BitField', dict(start_bit = 5, end_bit = 8, native_type='unsigned char')]],
+    'BpbRetpolineState' : [ 0x6d3, ['unsigned char']],
+    'BpbRunningNonRetpolineCode' : [ 0x6d3, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
+    'BpbIndirectCallsSafe' : [ 0x6d3, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned char')]],
+    'BpbRetpolineEnabled' : [ 0x6d3, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned char')]],
+    'BpbRetpolineStateReserved' : [ 0x6d3, ['BitField', dict(start_bit = 3, end_bit = 8, native_type='unsigned char')]],
+    'PrcbPad12b' : [ 0x6d4, ['unsigned long']],
+    'PrcbPad12a' : [ 0x6d0, ['unsigned long long']],
+    'PrcbPad12' : [ 0x6d8, ['array', 3, ['unsigned long long']]],
+    'LockQueue' : [ 0x6f0, ['array', 17, ['_KSPIN_LOCK_QUEUE']]],
+    'PPLookasideList' : [ 0x800, ['array', 16, ['_PP_LOOKASIDE_LIST']]],
+    'PPNxPagedLookasideList' : [ 0x900, ['array', 32, ['_GENERAL_LOOKASIDE_POOL']]],
+    'PPNPagedLookasideList' : [ 0x1500, ['array', 32, ['_GENERAL_LOOKASIDE_POOL']]],
+    'PPPagedLookasideList' : [ 0x2100, ['array', 32, ['_GENERAL_LOOKASIDE_POOL']]],
+    'PrcbPad20' : [ 0x2d00, ['unsigned long long']],
+    'DeferredReadyListHead' : [ 0x2d08, ['_SINGLE_LIST_ENTRY']],
+    'MmPageFaultCount' : [ 0x2d10, ['long']],
+    'MmCopyOnWriteCount' : [ 0x2d14, ['long']],
+    'MmTransitionCount' : [ 0x2d18, ['long']],
+    'MmDemandZeroCount' : [ 0x2d1c, ['long']],
+    'MmPageReadCount' : [ 0x2d20, ['long']],
+    'MmPageReadIoCount' : [ 0x2d24, ['long']],
+    'MmDirtyPagesWriteCount' : [ 0x2d28, ['long']],
+    'MmDirtyWriteIoCount' : [ 0x2d2c, ['long']],
+    'MmMappedPagesWriteCount' : [ 0x2d30, ['long']],
+    'MmMappedWriteIoCount' : [ 0x2d34, ['long']],
+    'KeSystemCalls' : [ 0x2d38, ['unsigned long']],
+    'KeContextSwitches' : [ 0x2d3c, ['unsigned long']],
+    'PrcbPad40' : [ 0x2d40, ['unsigned long']],
+    'CcFastReadNoWait' : [ 0x2d44, ['unsigned long']],
+    'CcFastReadWait' : [ 0x2d48, ['unsigned long']],
+    'CcFastReadNotPossible' : [ 0x2d4c, ['unsigned long']],
+    'CcCopyReadNoWait' : [ 0x2d50, ['unsigned long']],
+    'CcCopyReadWait' : [ 0x2d54, ['unsigned long']],
+    'CcCopyReadNoWaitMiss' : [ 0x2d58, ['unsigned long']],
+    'IoReadOperationCount' : [ 0x2d5c, ['long']],
+    'IoWriteOperationCount' : [ 0x2d60, ['long']],
+    'IoOtherOperationCount' : [ 0x2d64, ['long']],
+    'IoReadTransferCount' : [ 0x2d68, ['_LARGE_INTEGER']],
+    'IoWriteTransferCount' : [ 0x2d70, ['_LARGE_INTEGER']],
+    'IoOtherTransferCount' : [ 0x2d78, ['_LARGE_INTEGER']],
+    'PacketBarrier' : [ 0x2d80, ['long']],
+    'TargetCount' : [ 0x2d84, ['long']],
+    'IpiFrozen' : [ 0x2d88, ['unsigned long']],
+    'PrcbPad30' : [ 0x2d8c, ['unsigned long']],
+    'IsrDpcStats' : [ 0x2d90, ['pointer64', ['void']]],
+    'DeviceInterrupts' : [ 0x2d98, ['unsigned long']],
+    'LookasideIrpFloat' : [ 0x2d9c, ['long']],
+    'InterruptLastCount' : [ 0x2da0, ['unsigned long']],
+    'InterruptRate' : [ 0x2da4, ['unsigned long']],
+    'LastNonHrTimerExpiration' : [ 0x2da8, ['unsigned long long']],
+    'PairPrcb' : [ 0x2db0, ['pointer64', ['_KPRCB']]],
+    'PrcbPad35' : [ 0x2db8, ['array', 1, ['unsigned long long']]],
+    'InterruptObjectPool' : [ 0x2dc0, ['_SLIST_HEADER']],
+    'PrcbPad41' : [ 0x2dd0, ['array', 6, ['unsigned long long']]],
+    'DpcData' : [ 0x2e00, ['array', 2, ['_KDPC_DATA']]],
+    'DpcStack' : [ 0x2e50, ['pointer64', ['void']]],
+    'MaximumDpcQueueDepth' : [ 0x2e58, ['long']],
+    'DpcRequestRate' : [ 0x2e5c, ['unsigned long']],
+    'MinimumDpcRate' : [ 0x2e60, ['unsigned long']],
+    'DpcLastCount' : [ 0x2e64, ['unsigned long']],
+    'ThreadDpcEnable' : [ 0x2e68, ['unsigned char']],
+    'QuantumEnd' : [ 0x2e69, ['unsigned char']],
+    'DpcRoutineActive' : [ 0x2e6a, ['unsigned char']],
+    'IdleSchedule' : [ 0x2e6b, ['unsigned char']],
+    'DpcRequestSummary' : [ 0x2e6c, ['long']],
+    'DpcRequestSlot' : [ 0x2e6c, ['array', 2, ['short']]],
+    'NormalDpcState' : [ 0x2e6c, ['short']],
+    'ThreadDpcState' : [ 0x2e6e, ['short']],
+    'DpcNormalProcessingActive' : [ 0x2e6c, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
+    'DpcNormalProcessingRequested' : [ 0x2e6c, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
+    'DpcNormalThreadSignal' : [ 0x2e6c, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
+    'DpcNormalTimerExpiration' : [ 0x2e6c, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
+    'DpcNormalDpcPresent' : [ 0x2e6c, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
+    'DpcNormalLocalInterrupt' : [ 0x2e6c, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
+    'DpcNormalSpare' : [ 0x2e6c, ['BitField', dict(start_bit = 6, end_bit = 16, native_type='unsigned long')]],
+    'DpcThreadActive' : [ 0x2e6c, ['BitField', dict(start_bit = 16, end_bit = 17, native_type='unsigned long')]],
+    'DpcThreadRequested' : [ 0x2e6c, ['BitField', dict(start_bit = 17, end_bit = 18, native_type='unsigned long')]],
+    'DpcThreadSpare' : [ 0x2e6c, ['BitField', dict(start_bit = 18, end_bit = 32, native_type='unsigned long')]],
+    'LastTimerHand' : [ 0x2e70, ['unsigned long']],
+    'LastTick' : [ 0x2e74, ['unsigned long']],
+    'ClockInterrupts' : [ 0x2e78, ['unsigned long']],
+    'ReadyScanTick' : [ 0x2e7c, ['unsigned long']],
+    'InterruptObject' : [ 0x2e80, ['array', 256, ['pointer64', ['void']]]],
+    'TimerTable' : [ 0x3680, ['_KTIMER_TABLE']],
+    'DpcGate' : [ 0x5880, ['_KGATE']],
+    'PrcbPad52' : [ 0x5898, ['pointer64', ['void']]],
+    'CallDpc' : [ 0x58a0, ['_KDPC']],
+    'ClockKeepAlive' : [ 0x58e0, ['long']],
+    'PrcbPad60' : [ 0x58e4, ['array', 2, ['unsigned char']]],
+    'NmiActive' : [ 0x58e6, ['unsigned short']],
+    'DpcWatchdogPeriod' : [ 0x58e8, ['long']],
+    'DpcWatchdogCount' : [ 0x58ec, ['long']],
+    'KeSpinLockOrdering' : [ 0x58f0, ['long']],
+    'DpcWatchdogProfileCumulativeDpcThreshold' : [ 0x58f4, ['unsigned long']],
+    'CachedPtes' : [ 0x58f8, ['pointer64', ['void']]],
+    'WaitListHead' : [ 0x5900, ['_LIST_ENTRY']],
+    'WaitLock' : [ 0x5910, ['unsigned long long']],
+    'ReadySummary' : [ 0x5918, ['unsigned long']],
+    'AffinitizedSelectionMask' : [ 0x591c, ['long']],
+    'QueueIndex' : [ 0x5920, ['unsigned long']],
+    'PrcbPad75' : [ 0x5924, ['array', 3, ['unsigned long']]],
+    'TimerExpirationDpc' : [ 0x5930, ['_KDPC']],
+    'ScbQueue' : [ 0x5970, ['_RTL_RB_TREE']],
+    'DispatcherReadyListHead' : [ 0x5980, ['array', 32, ['_LIST_ENTRY']]],
+    'InterruptCount' : [ 0x5b80, ['unsigned long']],
+    'KernelTime' : [ 0x5b84, ['unsigned long']],
+    'UserTime' : [ 0x5b88, ['unsigned long']],
+    'DpcTime' : [ 0x5b8c, ['unsigned long']],
+    'InterruptTime' : [ 0x5b90, ['unsigned long']],
+    'AdjustDpcThreshold' : [ 0x5b94, ['unsigned long']],
+    'DebuggerSavedIRQL' : [ 0x5b98, ['unsigned char']],
+    'GroupSchedulingOverQuota' : [ 0x5b99, ['unsigned char']],
+    'DeepSleep' : [ 0x5b9a, ['unsigned char']],
+    'PrcbPad80' : [ 0x5b9b, ['unsigned char']],
+    'DpcTimeCount' : [ 0x5b9c, ['unsigned long']],
+    'DpcTimeLimit' : [ 0x5ba0, ['unsigned long']],
+    'PeriodicCount' : [ 0x5ba4, ['unsigned long']],
+    'PeriodicBias' : [ 0x5ba8, ['unsigned long']],
+    'AvailableTime' : [ 0x5bac, ['unsigned long']],
+    'KeExceptionDispatchCount' : [ 0x5bb0, ['unsigned long']],
+    'ReadyThreadCount' : [ 0x5bb4, ['unsigned long']],
+    'ReadyQueueExpectedRunTime' : [ 0x5bb8, ['unsigned long long']],
+    'StartCycles' : [ 0x5bc0, ['unsigned long long']],
+    'TaggedCyclesStart' : [ 0x5bc8, ['unsigned long long']],
+    'TaggedCycles' : [ 0x5bd0, ['array', 2, ['unsigned long long']]],
+    'GenerationTarget' : [ 0x5be0, ['unsigned long long']],
+    'AffinitizedCycles' : [ 0x5be8, ['unsigned long long']],
+    'ImportantCycles' : [ 0x5bf0, ['unsigned long long']],
+    'UnimportantCycles' : [ 0x5bf8, ['unsigned long long']],
+    'DpcWatchdogProfileSingleDpcThreshold' : [ 0x5c00, ['unsigned long']],
+    'MmSpinLockOrdering' : [ 0x5c04, ['long']],
+    'CachedStack' : [ 0x5c08, ['pointer64', ['void']]],
+    'PageColor' : [ 0x5c10, ['unsigned long']],
+    'NodeColor' : [ 0x5c14, ['unsigned long']],
+    'NodeShiftedColor' : [ 0x5c18, ['unsigned long']],
+    'SecondaryColorMask' : [ 0x5c1c, ['unsigned long']],
+    'PrcbPad81' : [ 0x5c20, ['array', 6, ['unsigned char']]],
+    'ExceptionStackActive' : [ 0x5c26, ['unsigned char']],
+    'TbFlushListActive' : [ 0x5c27, ['unsigned char']],
+    'ExceptionStack' : [ 0x5c28, ['pointer64', ['void']]],
+    'PrcbPad82' : [ 0x5c30, ['array', 1, ['unsigned long long']]],
+    'CycleTime' : [ 0x5c38, ['unsigned long long']],
+    'Cycles' : [ 0x5c40, ['array', 4, ['array', 2, ['unsigned long long']]]],
+    'CcFastMdlReadNoWait' : [ 0x5c80, ['unsigned long']],
+    'CcFastMdlReadWait' : [ 0x5c84, ['unsigned long']],
+    'CcFastMdlReadNotPossible' : [ 0x5c88, ['unsigned long']],
+    'CcMapDataNoWait' : [ 0x5c8c, ['unsigned long']],
+    'CcMapDataWait' : [ 0x5c90, ['unsigned long']],
+    'CcPinMappedDataCount' : [ 0x5c94, ['unsigned long']],
+    'CcPinReadNoWait' : [ 0x5c98, ['unsigned long']],
+    'CcPinReadWait' : [ 0x5c9c, ['unsigned long']],
+    'CcMdlReadNoWait' : [ 0x5ca0, ['unsigned long']],
+    'CcMdlReadWait' : [ 0x5ca4, ['unsigned long']],
+    'CcLazyWriteHotSpots' : [ 0x5ca8, ['unsigned long']],
+    'CcLazyWriteIos' : [ 0x5cac, ['unsigned long']],
+    'CcLazyWritePages' : [ 0x5cb0, ['unsigned long']],
+    'CcDataFlushes' : [ 0x5cb4, ['unsigned long']],
+    'CcDataPages' : [ 0x5cb8, ['unsigned long']],
+    'CcLostDelayedWrites' : [ 0x5cbc, ['unsigned long']],
+    'CcFastReadResourceMiss' : [ 0x5cc0, ['unsigned long']],
+    'CcCopyReadWaitMiss' : [ 0x5cc4, ['unsigned long']],
+    'CcFastMdlReadResourceMiss' : [ 0x5cc8, ['unsigned long']],
+    'CcMapDataNoWaitMiss' : [ 0x5ccc, ['unsigned long']],
+    'CcMapDataWaitMiss' : [ 0x5cd0, ['unsigned long']],
+    'CcPinReadNoWaitMiss' : [ 0x5cd4, ['unsigned long']],
+    'CcPinReadWaitMiss' : [ 0x5cd8, ['unsigned long']],
+    'CcMdlReadNoWaitMiss' : [ 0x5cdc, ['unsigned long']],
+    'CcMdlReadWaitMiss' : [ 0x5ce0, ['unsigned long']],
+    'CcReadAheadIos' : [ 0x5ce4, ['unsigned long']],
+    'MmCacheTransitionCount' : [ 0x5ce8, ['long']],
+    'MmCacheReadCount' : [ 0x5cec, ['long']],
+    'MmCacheIoCount' : [ 0x5cf0, ['long']],
+    'PrcbPad91' : [ 0x5cf4, ['unsigned long']],
+    'MmInternal' : [ 0x5cf8, ['pointer64', ['void']]],
+    'PowerState' : [ 0x5d00, ['_PROCESSOR_POWER_STATE']],
+    'HyperPte' : [ 0x5f00, ['pointer64', ['void']]],
+    'ScbList' : [ 0x5f08, ['_LIST_ENTRY']],
+    'ForceIdleDpc' : [ 0x5f18, ['_KDPC']],
+    'DpcWatchdogDpc' : [ 0x5f58, ['_KDPC']],
+    'DpcWatchdogTimer' : [ 0x5f98, ['_KTIMER']],
+    'Cache' : [ 0x5fd8, ['array', 5, ['_CACHE_DESCRIPTOR']]],
+    'CacheCount' : [ 0x6014, ['unsigned long']],
+    'CachedCommit' : [ 0x6018, ['unsigned long']],
+    'CachedResidentAvailable' : [ 0x601c, ['unsigned long']],
+    'WheaInfo' : [ 0x6020, ['pointer64', ['void']]],
+    'EtwSupport' : [ 0x6028, ['pointer64', ['void']]],
+    'ExSaPageArray' : [ 0x6030, ['pointer64', ['void']]],
+    'KeAlignmentFixupCount' : [ 0x6038, ['unsigned long']],
+    'PrcbPad95' : [ 0x603c, ['unsigned long']],
+    'HypercallPageList' : [ 0x6040, ['_SLIST_HEADER']],
+    'StatisticsPage' : [ 0x6050, ['pointer64', ['unsigned long long']]],
+    'PrcbPad85' : [ 0x6058, ['array', 5, ['unsigned long long']]],
+    'HypercallCachedPages' : [ 0x6080, ['pointer64', ['void']]],
+    'VirtualApicAssist' : [ 0x6088, ['pointer64', ['void']]],
+    'PackageProcessorSet' : [ 0x6090, ['_KAFFINITY_EX']],
+    'PackageId' : [ 0x6138, ['unsigned long']],
+    'PrcbPad86' : [ 0x613c, ['unsigned long']],
+    'SharedReadyQueueMask' : [ 0x6140, ['unsigned long long']],
+    'SharedReadyQueue' : [ 0x6148, ['pointer64', ['_KSHARED_READY_QUEUE']]],
+    'SharedQueueScanOwner' : [ 0x6150, ['unsigned long']],
+    'ScanSiblingIndex' : [ 0x6154, ['unsigned long']],
+    'CoreProcessorSet' : [ 0x6158, ['unsigned long long']],
+    'ScanSiblingMask' : [ 0x6160, ['unsigned long long']],
+    'LLCMask' : [ 0x6168, ['unsigned long long']],
+    'CacheProcessorMask' : [ 0x6170, ['array', 5, ['unsigned long long']]],
+    'ProcessorProfileControlArea' : [ 0x6198, ['pointer64', ['_PROCESSOR_PROFILE_CONTROL_AREA']]],
+    'ProfileEventIndexAddress' : [ 0x61a0, ['pointer64', ['void']]],
+    'DpcWatchdogProfile' : [ 0x61a8, ['pointer64', ['pointer64', ['void']]]],
+    'DpcWatchdogProfileCurrentEmptyCapture' : [ 0x61b0, ['pointer64', ['pointer64', ['void']]]],
+    'SchedulerAssist' : [ 0x61b8, ['pointer64', ['void']]],
+    'SynchCounters' : [ 0x61c0, ['_SYNCH_COUNTERS']],
+    'PrcbPad94' : [ 0x6278, ['unsigned long long']],
+    'FsCounters' : [ 0x6280, ['_FILESYSTEM_DISK_COUNTERS']],
+    'VendorString' : [ 0x6290, ['array', 13, ['unsigned char']]],
+    'PrcbPad100' : [ 0x629d, ['array', 3, ['unsigned char']]],
+    'FeatureBits' : [ 0x62a0, ['unsigned long long']],
+    'UpdateSignature' : [ 0x62a8, ['_LARGE_INTEGER']],
+    'PteBitCache' : [ 0x62b0, ['unsigned long long']],
+    'PteBitOffset' : [ 0x62b8, ['unsigned long']],
+    'PrcbPad105' : [ 0x62bc, ['unsigned long']],
+    'Context' : [ 0x62c0, ['pointer64', ['_CONTEXT']]],
+    'ContextFlagsInit' : [ 0x62c8, ['unsigned long']],
+    'PrcbPad115' : [ 0x62cc, ['unsigned long']],
+    'ExtendedState' : [ 0x62d0, ['pointer64', ['_XSAVE_AREA']]],
+    'IsrStack' : [ 0x62d8, ['pointer64', ['void']]],
+    'EntropyTimingState' : [ 0x62e0, ['_KENTROPY_TIMING_STATE']],
+    'PrcbPad110' : [ 0x6430, ['unsigned long long']],
+    'StibpPairingTrace' : [ 0x6438, ['__unnamed_11db']],
+    'AbSelfIoBoostsList' : [ 0x6470, ['_SINGLE_LIST_ENTRY']],
+    'AbPropagateBoostsList' : [ 0x6478, ['_SINGLE_LIST_ENTRY']],
+    'AbDpc' : [ 0x6480, ['_KDPC']],
+    'IoIrpStackProfilerCurrent' : [ 0x64c0, ['_IOP_IRP_STACK_PROFILER']],
+    'IoIrpStackProfilerPrevious' : [ 0x6514, ['_IOP_IRP_STACK_PROFILER']],
+    'SecureFault' : [ 0x6568, ['_KSECURE_FAULT_INFORMATION']],
+    'PrcbPad120' : [ 0x6578, ['unsigned long long']],
+    'LocalSharedReadyQueue' : [ 0x6580, ['_KSHARED_READY_QUEUE']],
+    'PrcbPad125' : [ 0x67f0, ['array', 2, ['unsigned long long']]],
+    'TimerExpirationTraceCount' : [ 0x6800, ['unsigned long']],
+    'PrcbPad127' : [ 0x6804, ['unsigned long']],
+    'TimerExpirationTrace' : [ 0x6808, ['array', 16, ['_KTIMER_EXPIRATION_TRACE']]],
+    'PrcbPad128' : [ 0x6908, ['array', 7, ['unsigned long long']]],
+    'Mailbox' : [ 0x6940, ['pointer64', ['_REQUEST_MAILBOX']]],
+    'PrcbPad130' : [ 0x6948, ['array', 7, ['unsigned long long']]],
+    'McheckContext' : [ 0x6980, ['array', 2, ['_MACHINE_CHECK_CONTEXT']]],
+    'PrcbPad134' : [ 0x6a20, ['array', 4, ['unsigned long long']]],
+    'SelfmapLockHandle' : [ 0x6a40, ['array', 4, ['_KLOCK_QUEUE_HANDLE']]],
+    'PrcbPad134a' : [ 0x6aa0, ['array', 4, ['unsigned long long']]],
+    'PrcbPad138' : [ 0x6ac0, ['array', 896, ['unsigned char']]],
+    'PrcbPad138a' : [ 0x6e40, ['array', 64, ['unsigned char']]],
+    'KernelDirectoryTableBase' : [ 0x6e80, ['unsigned long long']],
+    'RspBaseShadow' : [ 0x6e88, ['unsigned long long']],
+    'UserRspShadow' : [ 0x6e90, ['unsigned long long']],
+    'ShadowFlags' : [ 0x6e98, ['unsigned long']],
+    'PrcbPad138b' : [ 0x6e9c, ['unsigned long']],
+    'PrcbPad138c' : [ 0x6ea0, ['unsigned long long']],
+    'PrcbPad138d' : [ 0x6ea8, ['unsigned short']],
+    'PrcbPad138e' : [ 0x6eaa, ['unsigned short']],
+    'DbgMceNestingLevel' : [ 0x6eac, ['unsigned long']],
+    'DbgMceFlags' : [ 0x6eb0, ['unsigned long']],
+    'PrcbPad139b' : [ 0x6eb4, ['unsigned long']],
+    'PrcbPad140' : [ 0x6eb8, ['array', 505, ['unsigned long long']]],
+    'PrcbPad140a' : [ 0x7e80, ['array', 8, ['unsigned long long']]],
+    'PrcbPad141' : [ 0x7ec0, ['array', 504, ['unsigned long long']]],
+    'PrcbPad141a' : [ 0x8e80, ['array', 64, ['unsigned char']]],
+    'RequestMailbox' : [ 0x8ec0, ['array', 1, ['_REQUEST_MAILBOX']]],
+} ],
+  '_KFLOATING_SAVE' : [ 0x4, {
+    'Dummy' : [ 0x0, ['unsigned long']],
+} ],
+  '__unnamed_11f9' : [ 0x10, {
+    'Pcid' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 12, native_type='unsigned long long')]],
+    'Reserved' : [ 0x0, ['BitField', dict(start_bit = 12, end_bit = 64, native_type='unsigned long long')]],
+    'EntirePcid' : [ 0x0, ['unsigned long long']],
+    'Virtual' : [ 0x8, ['unsigned long long']],
+} ],
+  '__unnamed_11fb' : [ 0x10, {
+    'Pcid' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 12, native_type='unsigned long long')]],
+    'Reserved' : [ 0x0, ['BitField', dict(start_bit = 12, end_bit = 64, native_type='unsigned long long')]],
+    'EntirePcid' : [ 0x0, ['unsigned long long']],
+    'Reserved2' : [ 0x8, ['unsigned long long']],
+} ],
+  '__unnamed_11fd' : [ 0x10, {
+    'Reserved' : [ 0x0, ['array', 2, ['unsigned long long']]],
+} ],
+  '_INVPCID_DESCRIPTOR' : [ 0x10, {
+    'IndividualAddress' : [ 0x0, ['__unnamed_11f9']],
+    'SingleContext' : [ 0x0, ['__unnamed_11fb']],
+    'AllContextAndGlobals' : [ 0x0, ['__unnamed_11fd']],
+    'AllContext' : [ 0x0, ['__unnamed_11fd']],
+} ],
+  '_SINGLE_LIST_ENTRY32' : [ 0x4, {
+    'Next' : [ 0x0, ['unsigned long']],
+} ],
+  '_EXT_SET_PARAMETERS_V0' : [ 0x10, {
+    'Version' : [ 0x0, ['unsigned long']],
+    'Reserved' : [ 0x4, ['unsigned long']],
+    'NoWakeTolerance' : [ 0x8, ['long long']],
+} ],
+  '_PS_TRUSTLET_CREATE_ATTRIBUTES' : [ 0x18, {
+    'TrustletIdentity' : [ 0x0, ['unsigned long long']],
+    'Attributes' : [ 0x8, ['array', 1, ['_PS_TRUSTLET_ATTRIBUTE_DATA']]],
+} ],
+  '_PS_TRUSTLET_ATTRIBUTE_DATA' : [ 0x10, {
+    'Header' : [ 0x0, ['_PS_TRUSTLET_ATTRIBUTE_HEADER']],
+    'Data' : [ 0x8, ['array', 1, ['unsigned long long']]],
+} ],
+  '_PS_TRUSTLET_ATTRIBUTE_HEADER' : [ 0x8, {
+    'AttributeType' : [ 0x0, ['_PS_TRUSTLET_ATTRIBUTE_TYPE']],
+    'InstanceNumber' : [ 0x4, ['BitField', dict(start_bit = 0, end_bit = 8, native_type='unsigned long')]],
+    'Reserved' : [ 0x4, ['BitField', dict(start_bit = 8, end_bit = 32, native_type='unsigned long')]],
+} ],
+  '_TRUSTLET_MAILBOX_KEY' : [ 0x10, {
+    'SecretValue' : [ 0x0, ['array', 2, ['unsigned long long']]],
+} ],
+  '_TRUSTLET_COLLABORATION_ID' : [ 0x10, {
+    'Value' : [ 0x0, ['array', 2, ['unsigned long long']]],
+} ],
+  '__unnamed_1247' : [ 0x8, {
+    'SecureProcess' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long long')]],
+    'Unused' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long long')]],
+} ],
+  '__unnamed_1249' : [ 0x8, {
+    'SecureHandle' : [ 0x0, ['unsigned long long']],
+    'Flags' : [ 0x0, ['__unnamed_1247']],
+} ],
+  '_KPROCESS' : [ 0x2e0, {
+    'Header' : [ 0x0, ['_DISPATCHER_HEADER']],
+    'ProfileListHead' : [ 0x18, ['_LIST_ENTRY']],
+    'DirectoryTableBase' : [ 0x28, ['unsigned long long']],
+    'ThreadListHead' : [ 0x30, ['_LIST_ENTRY']],
+    'ProcessLock' : [ 0x40, ['unsigned long']],
+    'ProcessTimerDelay' : [ 0x44, ['unsigned long']],
+    'DeepFreezeStartTime' : [ 0x48, ['unsigned long long']],
+    'Affinity' : [ 0x50, ['_KAFFINITY_EX']],
+    'ReadyListHead' : [ 0xf8, ['_LIST_ENTRY']],
+    'SwapListEntry' : [ 0x108, ['_SINGLE_LIST_ENTRY']],
+    'ActiveProcessors' : [ 0x110, ['_KAFFINITY_EX']],
+    'AutoAlignment' : [ 0x1b8, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
+    'DisableBoost' : [ 0x1b8, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
+    'DisableQuantum' : [ 0x1b8, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
+    'DeepFreeze' : [ 0x1b8, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
+    'TimerVirtualization' : [ 0x1b8, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
+    'CheckStackExtents' : [ 0x1b8, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
+    'CacheIsolationEnabled' : [ 0x1b8, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
+    'PpmPolicy' : [ 0x1b8, ['BitField', dict(start_bit = 7, end_bit = 10, native_type='unsigned long')]],
+    'VaSpaceDeleted' : [ 0x1b8, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned long')]],
+    'ReservedFlags' : [ 0x1b8, ['BitField', dict(start_bit = 11, end_bit = 32, native_type='unsigned long')]],
+    'ProcessFlags' : [ 0x1b8, ['long']],
+    'ActiveGroupsMask' : [ 0x1bc, ['unsigned long']],
+    'BasePriority' : [ 0x1c0, ['unsigned char']],
+    'QuantumReset' : [ 0x1c1, ['unsigned char']],
+    'Visited' : [ 0x1c2, ['unsigned char']],
+    'Flags' : [ 0x1c3, ['_KEXECUTE_OPTIONS']],
+    'ThreadSeed' : [ 0x1c4, ['array', 20, ['unsigned short']]],
+    'IdealProcessor' : [ 0x1ec, ['array', 20, ['unsigned short']]],
+    'IdealNode' : [ 0x214, ['array', 20, ['unsigned short']]],
+    'IdealGlobalNode' : [ 0x23c, ['unsigned short']],
+    'Spare1' : [ 0x23e, ['unsigned short']],
+    'StackCount' : [ 0x240, ['_KSTACK_COUNT']],
+    'ProcessListEntry' : [ 0x248, ['_LIST_ENTRY']],
+    'CycleTime' : [ 0x258, ['unsigned long long']],
+    'ContextSwitches' : [ 0x260, ['unsigned long long']],
+    'SchedulingGroup' : [ 0x268, ['pointer64', ['_KSCHEDULING_GROUP']]],
+    'FreezeCount' : [ 0x270, ['unsigned long']],
+    'KernelTime' : [ 0x274, ['unsigned long']],
+    'UserTime' : [ 0x278, ['unsigned long']],
+    'ReadyTime' : [ 0x27c, ['unsigned long']],
+    'UserDirectoryTableBase' : [ 0x280, ['unsigned long long']],
+    'AddressPolicy' : [ 0x288, ['unsigned char']],
+    'Spare2' : [ 0x289, ['array', 71, ['unsigned char']]],
+    'InstrumentationCallback' : [ 0x2d0, ['pointer64', ['void']]],
+    'SecureState' : [ 0x2d8, ['__unnamed_1249']],
+} ],
+  '_KTHREAD' : [ 0x600, {
+    'Header' : [ 0x0, ['_DISPATCHER_HEADER']],
+    'SListFaultAddress' : [ 0x18, ['pointer64', ['void']]],
+    'QuantumTarget' : [ 0x20, ['unsigned long long']],
+    'InitialStack' : [ 0x28, ['pointer64', ['void']]],
+    'StackLimit' : [ 0x30, ['pointer64', ['void']]],
+    'StackBase' : [ 0x38, ['pointer64', ['void']]],
+    'ThreadLock' : [ 0x40, ['unsigned long long']],
+    'CycleTime' : [ 0x48, ['unsigned long long']],
+    'CurrentRunTime' : [ 0x50, ['unsigned long']],
+    'ExpectedRunTime' : [ 0x54, ['unsigned long']],
+    'KernelStack' : [ 0x58, ['pointer64', ['void']]],
+    'StateSaveArea' : [ 0x60, ['pointer64', ['_XSAVE_FORMAT']]],
+    'SchedulingGroup' : [ 0x68, ['pointer64', ['_KSCHEDULING_GROUP']]],
+    'WaitRegister' : [ 0x70, ['_KWAIT_STATUS_REGISTER']],
+    'Running' : [ 0x71, ['unsigned char']],
+    'Alerted' : [ 0x72, ['array', 2, ['unsigned char']]],
+    'AutoBoostActive' : [ 0x74, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
+    'ReadyTransition' : [ 0x74, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
+    'WaitNext' : [ 0x74, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
+    'SystemAffinityActive' : [ 0x74, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
+    'Alertable' : [ 0x74, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
+    'UserStackWalkActive' : [ 0x74, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
+    'ApcInterruptRequest' : [ 0x74, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
+    'QuantumEndMigrate' : [ 0x74, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
+    'UmsDirectedSwitchEnable' : [ 0x74, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long')]],
+    'TimerActive' : [ 0x74, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long')]],
+    'SystemThread' : [ 0x74, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned long')]],
+    'ProcessDetachActive' : [ 0x74, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned long')]],
+    'CalloutActive' : [ 0x74, ['BitField', dict(start_bit = 12, end_bit = 13, native_type='unsigned long')]],
+    'ScbReadyQueue' : [ 0x74, ['BitField', dict(start_bit = 13, end_bit = 14, native_type='unsigned long')]],
+    'ApcQueueable' : [ 0x74, ['BitField', dict(start_bit = 14, end_bit = 15, native_type='unsigned long')]],
+    'ReservedStackInUse' : [ 0x74, ['BitField', dict(start_bit = 15, end_bit = 16, native_type='unsigned long')]],
+    'UmsPerformingSyscall' : [ 0x74, ['BitField', dict(start_bit = 16, end_bit = 17, native_type='unsigned long')]],
+    'TimerSuspended' : [ 0x74, ['BitField', dict(start_bit = 17, end_bit = 18, native_type='unsigned long')]],
+    'SuspendedWaitMode' : [ 0x74, ['BitField', dict(start_bit = 18, end_bit = 19, native_type='unsigned long')]],
+    'SuspendSchedulerApcWait' : [ 0x74, ['BitField', dict(start_bit = 19, end_bit = 20, native_type='unsigned long')]],
+    'CetUserShadowStack' : [ 0x74, ['BitField', dict(start_bit = 20, end_bit = 21, native_type='unsigned long')]],
+    'BypassProcessFreeze' : [ 0x74, ['BitField', dict(start_bit = 21, end_bit = 22, native_type='unsigned long')]],
+    'Reserved' : [ 0x74, ['BitField', dict(start_bit = 22, end_bit = 32, native_type='unsigned long')]],
+    'MiscFlags' : [ 0x74, ['long']],
+    'BamQosLevel' : [ 0x78, ['BitField', dict(start_bit = 0, end_bit = 2, native_type='unsigned long')]],
+    'AutoAlignment' : [ 0x78, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
+    'DisableBoost' : [ 0x78, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
+    'AlertedByThreadId' : [ 0x78, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
+    'QuantumDonation' : [ 0x78, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
+    'EnableStackSwap' : [ 0x78, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
+    'GuiThread' : [ 0x78, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
+    'DisableQuantum' : [ 0x78, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long')]],
+    'ChargeOnlySchedulingGroup' : [ 0x78, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long')]],
+    'DeferPreemption' : [ 0x78, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned long')]],
+    'QueueDeferPreemption' : [ 0x78, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned long')]],
+    'ForceDeferSchedule' : [ 0x78, ['BitField', dict(start_bit = 12, end_bit = 13, native_type='unsigned long')]],
+    'SharedReadyQueueAffinity' : [ 0x78, ['BitField', dict(start_bit = 13, end_bit = 14, native_type='unsigned long')]],
+    'FreezeCount' : [ 0x78, ['BitField', dict(start_bit = 14, end_bit = 15, native_type='unsigned long')]],
+    'TerminationApcRequest' : [ 0x78, ['BitField', dict(start_bit = 15, end_bit = 16, native_type='unsigned long')]],
+    'AutoBoostEntriesExhausted' : [ 0x78, ['BitField', dict(start_bit = 16, end_bit = 17, native_type='unsigned long')]],
+    'KernelStackResident' : [ 0x78, ['BitField', dict(start_bit = 17, end_bit = 18, native_type='unsigned long')]],
+    'TerminateRequestReason' : [ 0x78, ['BitField', dict(start_bit = 18, end_bit = 20, native_type='unsigned long')]],
+    'ProcessStackCountDecremented' : [ 0x78, ['BitField', dict(start_bit = 20, end_bit = 21, native_type='unsigned long')]],
+    'RestrictedGuiThread' : [ 0x78, ['BitField', dict(start_bit = 21, end_bit = 22, native_type='unsigned long')]],
+    'VpBackingThread' : [ 0x78, ['BitField', dict(start_bit = 22, end_bit = 23, native_type='unsigned long')]],
+    'ThreadFlagsSpare' : [ 0x78, ['BitField', dict(start_bit = 23, end_bit = 24, native_type='unsigned long')]],
+    'EtwStackTraceApcInserted' : [ 0x78, ['BitField', dict(start_bit = 24, end_bit = 32, native_type='unsigned long')]],
+    'ThreadFlags' : [ 0x78, ['long']],
+    'Tag' : [ 0x7c, ['unsigned char']],
+    'SystemHeteroCpuPolicy' : [ 0x7d, ['unsigned char']],
+    'UserHeteroCpuPolicy' : [ 0x7e, ['BitField', dict(start_bit = 0, end_bit = 7, native_type='unsigned char')]],
+    'ExplicitSystemHeteroCpuPolicy' : [ 0x7e, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned char')]],
+    'RunningNonRetpolineCode' : [ 0x7f, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
+    'SpecCtrlSpare' : [ 0x7f, ['BitField', dict(start_bit = 1, end_bit = 8, native_type='unsigned char')]],
+    'SpecCtrl' : [ 0x7f, ['unsigned char']],
+    'SystemCallNumber' : [ 0x80, ['unsigned long']],
+    'ReadyTime' : [ 0x84, ['unsigned long']],
+    'FirstArgument' : [ 0x88, ['pointer64', ['void']]],
+    'TrapFrame' : [ 0x90, ['pointer64', ['_KTRAP_FRAME']]],
+    'ApcState' : [ 0x98, ['_KAPC_STATE']],
+    'ApcStateFill' : [ 0x98, ['array', 43, ['unsigned char']]],
+    'Priority' : [ 0xc3, ['unsigned char']],
+    'UserIdealProcessor' : [ 0xc4, ['unsigned long']],
+    'WaitStatus' : [ 0xc8, ['long long']],
+    'WaitBlockList' : [ 0xd0, ['pointer64', ['_KWAIT_BLOCK']]],
+    'WaitListEntry' : [ 0xd8, ['_LIST_ENTRY']],
+    'SwapListEntry' : [ 0xd8, ['_SINGLE_LIST_ENTRY']],
+    'Queue' : [ 0xe8, ['pointer64', ['_DISPATCHER_HEADER']]],
+    'Teb' : [ 0xf0, ['pointer64', ['void']]],
+    'RelativeTimerBias' : [ 0xf8, ['unsigned long long']],
+    'Timer' : [ 0x100, ['_KTIMER']],
+    'WaitBlock' : [ 0x140, ['array', 4, ['_KWAIT_BLOCK']]],
+    'WaitBlockFill4' : [ 0x140, ['array', 20, ['unsigned char']]],
+    'ContextSwitches' : [ 0x154, ['unsigned long']],
+    'WaitBlockFill5' : [ 0x140, ['array', 68, ['unsigned char']]],
+    'State' : [ 0x184, ['unsigned char']],
+    'Spare13' : [ 0x185, ['unsigned char']],
+    'WaitIrql' : [ 0x186, ['unsigned char']],
+    'WaitMode' : [ 0x187, ['unsigned char']],
+    'WaitBlockFill6' : [ 0x140, ['array', 116, ['unsigned char']]],
+    'WaitTime' : [ 0x1b4, ['unsigned long']],
+    'WaitBlockFill7' : [ 0x140, ['array', 164, ['unsigned char']]],
+    'KernelApcDisable' : [ 0x1e4, ['short']],
+    'SpecialApcDisable' : [ 0x1e6, ['short']],
+    'CombinedApcDisable' : [ 0x1e4, ['unsigned long']],
+    'WaitBlockFill8' : [ 0x140, ['array', 40, ['unsigned char']]],
+    'ThreadCounters' : [ 0x168, ['pointer64', ['_KTHREAD_COUNTERS']]],
+    'WaitBlockFill9' : [ 0x140, ['array', 88, ['unsigned char']]],
+    'XStateSave' : [ 0x198, ['pointer64', ['_XSTATE_SAVE']]],
+    'WaitBlockFill10' : [ 0x140, ['array', 136, ['unsigned char']]],
+    'Win32Thread' : [ 0x1c8, ['pointer64', ['void']]],
+    'WaitBlockFill11' : [ 0x140, ['array', 176, ['unsigned char']]],
+    'Ucb' : [ 0x1f0, ['pointer64', ['_UMS_CONTROL_BLOCK']]],
+    'Uch' : [ 0x1f8, ['pointer64', ['_KUMS_CONTEXT_HEADER']]],
+    'Spare21' : [ 0x200, ['pointer64', ['void']]],
+    'QueueListEntry' : [ 0x208, ['_LIST_ENTRY']],
+    'NextProcessor' : [ 0x218, ['unsigned long']],
+    'NextProcessorNumber' : [ 0x218, ['BitField', dict(start_bit = 0, end_bit = 31, native_type='unsigned long')]],
+    'SharedReadyQueue' : [ 0x218, ['BitField', dict(start_bit = 31, end_bit = 32, native_type='unsigned long')]],
+    'QueuePriority' : [ 0x21c, ['long']],
+    'Process' : [ 0x220, ['pointer64', ['_KPROCESS']]],
+    'UserAffinity' : [ 0x228, ['_GROUP_AFFINITY']],
+    'UserAffinityFill' : [ 0x228, ['array', 10, ['unsigned char']]],
+    'PreviousMode' : [ 0x232, ['unsigned char']],
+    'BasePriority' : [ 0x233, ['unsigned char']],
+    'PriorityDecrement' : [ 0x234, ['unsigned char']],
+    'ForegroundBoost' : [ 0x234, ['BitField', dict(start_bit = 0, end_bit = 4, native_type='unsigned char')]],
+    'UnusualBoost' : [ 0x234, ['BitField', dict(start_bit = 4, end_bit = 8, native_type='unsigned char')]],
+    'Preempted' : [ 0x235, ['unsigned char']],
+    'AdjustReason' : [ 0x236, ['unsigned char']],
+    'AdjustIncrement' : [ 0x237, ['unsigned char']],
+    'AffinityVersion' : [ 0x238, ['unsigned long long']],
+    'Affinity' : [ 0x240, ['_GROUP_AFFINITY']],
+    'AffinityFill' : [ 0x240, ['array', 10, ['unsigned char']]],
+    'ApcStateIndex' : [ 0x24a, ['unsigned char']],
+    'WaitBlockCount' : [ 0x24b, ['unsigned char']],
+    'IdealProcessor' : [ 0x24c, ['unsigned long']],
+    'NpxState' : [ 0x250, ['unsigned long long']],
+    'SavedApcState' : [ 0x258, ['_KAPC_STATE']],
+    'SavedApcStateFill' : [ 0x258, ['array', 43, ['unsigned char']]],
+    'WaitReason' : [ 0x283, ['unsigned char']],
+    'SuspendCount' : [ 0x284, ['unsigned char']],
+    'Saturation' : [ 0x285, ['unsigned char']],
+    'SListFaultCount' : [ 0x286, ['unsigned short']],
+    'SchedulerApc' : [ 0x288, ['_KAPC']],
+    'SchedulerApcFill0' : [ 0x288, ['array', 1, ['unsigned char']]],
+    'ResourceIndex' : [ 0x289, ['unsigned char']],
+    'SchedulerApcFill1' : [ 0x288, ['array', 3, ['unsigned char']]],
+    'QuantumReset' : [ 0x28b, ['unsigned char']],
+    'SchedulerApcFill2' : [ 0x288, ['array', 4, ['unsigned char']]],
+    'KernelTime' : [ 0x28c, ['unsigned long']],
+    'SchedulerApcFill3' : [ 0x288, ['array', 64, ['unsigned char']]],
+    'WaitPrcb' : [ 0x2c8, ['pointer64', ['_KPRCB']]],
+    'SchedulerApcFill4' : [ 0x288, ['array', 72, ['unsigned char']]],
+    'LegoData' : [ 0x2d0, ['pointer64', ['void']]],
+    'SchedulerApcFill5' : [ 0x288, ['array', 83, ['unsigned char']]],
+    'CallbackNestingLevel' : [ 0x2db, ['unsigned char']],
+    'UserTime' : [ 0x2dc, ['unsigned long']],
+    'SuspendEvent' : [ 0x2e0, ['_KEVENT']],
+    'ThreadListEntry' : [ 0x2f8, ['_LIST_ENTRY']],
+    'MutantListHead' : [ 0x308, ['_LIST_ENTRY']],
+    'AbEntrySummary' : [ 0x318, ['unsigned char']],
+    'AbWaitEntryCount' : [ 0x319, ['unsigned char']],
+    'AbAllocationRegionCount' : [ 0x31a, ['unsigned char']],
+    'SystemPriority' : [ 0x31b, ['unsigned char']],
+    'SecureThreadCookie' : [ 0x31c, ['unsigned long']],
+    'LockEntries' : [ 0x320, ['array', 6, ['_KLOCK_ENTRY']]],
+    'PropagateBoostsEntry' : [ 0x560, ['_SINGLE_LIST_ENTRY']],
+    'IoSelfBoostsEntry' : [ 0x568, ['_SINGLE_LIST_ENTRY']],
+    'PriorityFloorCounts' : [ 0x570, ['array', 16, ['unsigned char']]],
+    'PriorityFloorSummary' : [ 0x580, ['unsigned long']],
+    'AbCompletedIoBoostCount' : [ 0x584, ['long']],
+    'AbCompletedIoQoSBoostCount' : [ 0x588, ['long']],
+    'KeReferenceCount' : [ 0x58c, ['short']],
+    'AbOrphanedEntrySummary' : [ 0x58e, ['unsigned char']],
+    'AbOwnedEntryCount' : [ 0x58f, ['unsigned char']],
+    'ForegroundLossTime' : [ 0x590, ['unsigned long']],
+    'GlobalForegroundListEntry' : [ 0x598, ['_LIST_ENTRY']],
+    'ForegroundDpcStackListEntry' : [ 0x598, ['_SINGLE_LIST_ENTRY']],
+    'InGlobalForegroundList' : [ 0x5a0, ['unsigned long long']],
+    'ReadOperationCount' : [ 0x5a8, ['long long']],
+    'WriteOperationCount' : [ 0x5b0, ['long long']],
+    'OtherOperationCount' : [ 0x5b8, ['long long']],
+    'ReadTransferCount' : [ 0x5c0, ['long long']],
+    'WriteTransferCount' : [ 0x5c8, ['long long']],
+    'OtherTransferCount' : [ 0x5d0, ['long long']],
+    'QueuedScb' : [ 0x5d8, ['pointer64', ['_KSCB']]],
+    'ThreadTimerDelay' : [ 0x5e0, ['unsigned long']],
+    'ThreadFlags2' : [ 0x5e4, ['long']],
+    'PpmPolicy' : [ 0x5e4, ['BitField', dict(start_bit = 0, end_bit = 2, native_type='unsigned long')]],
+    'ThreadFlags2Reserved' : [ 0x5e4, ['BitField', dict(start_bit = 2, end_bit = 32, native_type='unsigned long')]],
+    'TracingPrivate' : [ 0x5e8, ['array', 1, ['unsigned long long']]],
+    'SchedulerAssist' : [ 0x5f0, ['pointer64', ['void']]],
+    'AbWaitObject' : [ 0x5f8, ['pointer64', ['void']]],
+} ],
+  '_KSTACK_CONTROL' : [ 0x30, {
+    'StackBase' : [ 0x0, ['unsigned long long']],
+    'ActualLimit' : [ 0x8, ['unsigned long long']],
+    'StackExpansion' : [ 0x8, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long long')]],
+    'Previous' : [ 0x10, ['_KERNEL_STACK_SEGMENT']],
+} ],
+  '_KSPIN_LOCK_QUEUE' : [ 0x10, {
+    'Next' : [ 0x0, ['pointer64', ['_KSPIN_LOCK_QUEUE']]],
+    'Lock' : [ 0x8, ['pointer64', ['unsigned long long']]],
+} ],
+  '_FAST_MUTEX' : [ 0x38, {
+    'Count' : [ 0x0, ['long']],
+    'Owner' : [ 0x8, ['pointer64', ['void']]],
+    'Contention' : [ 0x10, ['unsigned long']],
+    'Event' : [ 0x18, ['_KEVENT']],
+    'OldIrql' : [ 0x30, ['unsigned long']],
+} ],
+  '_KEVENT' : [ 0x18, {
+    'Header' : [ 0x0, ['_DISPATCHER_HEADER']],
+} ],
+  '__unnamed_12bb' : [ 0x10, {
+    'Depth' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 16, native_type='unsigned long long')]],
+    'Sequence' : [ 0x0, ['BitField', dict(start_bit = 16, end_bit = 64, native_type='unsigned long long')]],
+    'Reserved' : [ 0x8, ['BitField', dict(start_bit = 0, end_bit = 4, native_type='unsigned long long')]],
+    'NextEntry' : [ 0x8, ['BitField', dict(start_bit = 4, end_bit = 64, native_type='unsigned long long')]],
+} ],
+  '_SLIST_HEADER' : [ 0x10, {
+    'Alignment' : [ 0x0, ['unsigned long long']],
+    'Region' : [ 0x8, ['unsigned long long']],
+    'HeaderX64' : [ 0x0, ['__unnamed_12bb']],
+} ],
+  '_LOOKASIDE_LIST_EX' : [ 0x60, {
+    'L' : [ 0x0, ['_GENERAL_LOOKASIDE_POOL']],
+} ],
+  '_SLIST_ENTRY' : [ 0x10, {
+    'Next' : [ 0x0, ['pointer64', ['_SLIST_ENTRY']]],
+} ],
+  '_NPAGED_LOOKASIDE_LIST' : [ 0x80, {
+    'L' : [ 0x0, ['_GENERAL_LOOKASIDE']],
+} ],
+  '_PAGED_LOOKASIDE_LIST' : [ 0x80, {
+    'L' : [ 0x0, ['_GENERAL_LOOKASIDE']],
+} ],
+  '_IO_STATUS_BLOCK' : [ 0x10, {
+    'Status' : [ 0x0, ['long']],
+    'Pointer' : [ 0x0, ['pointer64', ['void']]],
+    'Information' : [ 0x8, ['unsigned long long']],
+} ],
+  '_QUAD' : [ 0x8, {
+    'UseThisFieldToCopy' : [ 0x0, ['long long']],
+    'DoNotUseThisField' : [ 0x0, ['double']],
+} ],
+  '_WORK_QUEUE_ITEM' : [ 0x20, {
+    'List' : [ 0x0, ['_LIST_ENTRY']],
+    'WorkerRoutine' : [ 0x10, ['pointer64', ['void']]],
+    'Parameter' : [ 0x18, ['pointer64', ['void']]],
+} ],
+  '_EXT_DELETE_PARAMETERS' : [ 0x18, {
+    'Version' : [ 0x0, ['unsigned long']],
+    'Reserved' : [ 0x4, ['unsigned long']],
+    'DeleteCallback' : [ 0x8, ['pointer64', ['void']]],
+    'DeleteContext' : [ 0x10, ['pointer64', ['void']]],
+} ],
+  '_EX_PUSH_LOCK' : [ 0x8, {
+    'Locked' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long long')]],
+    'Waiting' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long long')]],
+    'Waking' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long long')]],
+    'MultipleShared' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long long')]],
+    'Shared' : [ 0x0, ['BitField', dict(start_bit = 4, end_bit = 64, native_type='unsigned long long')]],
+    'Value' : [ 0x0, ['unsigned long long']],
+    'Ptr' : [ 0x0, ['pointer64', ['void']]],
+} ],
+  '_PP_LOOKASIDE_LIST' : [ 0x10, {
+    'P' : [ 0x0, ['pointer64', ['_GENERAL_LOOKASIDE']]],
+    'L' : [ 0x8, ['pointer64', ['_GENERAL_LOOKASIDE']]],
+} ],
+  '_GENERAL_LOOKASIDE' : [ 0x80, {
+    'ListHead' : [ 0x0, ['_SLIST_HEADER']],
+    'SingleListHead' : [ 0x0, ['_SINGLE_LIST_ENTRY']],
+    'Depth' : [ 0x10, ['unsigned short']],
+    'MaximumDepth' : [ 0x12, ['unsigned short']],
+    'TotalAllocates' : [ 0x14, ['unsigned long']],
+    'AllocateMisses' : [ 0x18, ['unsigned long']],
+    'AllocateHits' : [ 0x18, ['unsigned long']],
+    'TotalFrees' : [ 0x1c, ['unsigned long']],
+    'FreeMisses' : [ 0x20, ['unsigned long']],
+    'FreeHits' : [ 0x20, ['unsigned long']],
+    'Type' : [ 0x24, ['Enumeration', dict(target = 'long', choices = {0: u'NonPagedPoolBase', 1: u'PagedPool', 2: u'NonPagedPoolBaseMustSucceed', 3: u'DontUseThisType', 4: u'NonPagedPoolBaseCacheAligned', 5: u'PagedPoolCacheAligned', 6: u'NonPagedPoolBaseCacheAlignedMustS', 7: u'MaxPoolType', 34: u'NonPagedPoolMustSucceedSession', 516: u'NonPagedPoolNxCacheAligned', 35: u'DontUseThisTypeSession', 32: u'NonPagedPoolSession', 512: u'NonPagedPoolNx', 544: u'NonPagedPoolSessionNx', 36: u'NonPagedPoolCacheAlignedSession', 33: u'PagedPoolSession', 38: u'NonPagedPoolCacheAlignedMustSSession', 37: u'PagedPoolCacheAlignedSession'})]],
+    'Tag' : [ 0x28, ['unsigned long']],
+    'Size' : [ 0x2c, ['unsigned long']],
+    'AllocateEx' : [ 0x30, ['pointer64', ['void']]],
+    'Allocate' : [ 0x30, ['pointer64', ['void']]],
+    'FreeEx' : [ 0x38, ['pointer64', ['void']]],
+    'Free' : [ 0x38, ['pointer64', ['void']]],
+    'ListEntry' : [ 0x40, ['_LIST_ENTRY']],
+    'LastTotalAllocates' : [ 0x50, ['unsigned long']],
+    'LastAllocateMisses' : [ 0x54, ['unsigned long']],
+    'LastAllocateHits' : [ 0x54, ['unsigned long']],
+    'Future' : [ 0x58, ['array', 2, ['unsigned long']]],
+} ],
+  '_KNODE' : [ 0x180, {
+    'IdleNonParkedCpuSet' : [ 0x0, ['unsigned long long']],
+    'IdleSmtSet' : [ 0x8, ['unsigned long long']],
+    'IdleCpuSet' : [ 0x10, ['unsigned long long']],
+    'DeepIdleSet' : [ 0x40, ['unsigned long long']],
+    'IdleConstrainedSet' : [ 0x48, ['unsigned long long']],
+    'NonParkedSet' : [ 0x50, ['unsigned long long']],
+    'NonIsrTargetedSet' : [ 0x58, ['unsigned long long']],
+    'ParkLock' : [ 0x60, ['long']],
+    'ThreadSeed' : [ 0x64, ['unsigned short']],
+    'ProcessSeed' : [ 0x66, ['unsigned short']],
+    'SiblingMask' : [ 0x80, ['unsigned long']],
+    'Affinity' : [ 0x88, ['_GROUP_AFFINITY']],
+    'AffinityFill' : [ 0x88, ['array', 10, ['unsigned char']]],
+    'NodeNumber' : [ 0x92, ['unsigned short']],
+    'PrimaryNodeNumber' : [ 0x94, ['unsigned short']],
+    'Spare0' : [ 0x96, ['unsigned short']],
+    'SharedReadyQueueMask' : [ 0x98, ['unsigned long long']],
+    'StrideMask' : [ 0xa0, ['unsigned long long']],
+    'ProximityId' : [ 0xa8, ['unsigned long']],
+    'Lowest' : [ 0xac, ['unsigned long']],
+    'Highest' : [ 0xb0, ['unsigned long']],
+    'MaximumProcessors' : [ 0xb4, ['unsigned char']],
+    'Flags' : [ 0xb5, ['_flags']],
+    'Spare10' : [ 0xb6, ['unsigned char']],
+    'HeteroSets' : [ 0xb8, ['array', 5, ['_KHETERO_PROCESSOR_SET']]],
+    'PpmConfiguredQosSets' : [ 0x130, ['array', 4, ['unsigned long long']]],
+    'LLCLeaders' : [ 0x150, ['unsigned long long']],
+} ],
+  '_ENODE' : [ 0x1c0, {
+    'Ncb' : [ 0x0, ['_KNODE']],
+    'HotAddProcessorWorkItem' : [ 0x180, ['_WORK_QUEUE_ITEM']],
+} ],
+  '_HANDLE_TABLE' : [ 0x80, {
+    'NextHandleNeedingPool' : [ 0x0, ['unsigned long']],
+    'ExtraInfoPages' : [ 0x4, ['long']],
+    'TableCode' : [ 0x8, ['unsigned long long']],
+    'QuotaProcess' : [ 0x10, ['pointer64', ['_EPROCESS']]],
+    'HandleTableList' : [ 0x18, ['_LIST_ENTRY']],
+    'UniqueProcessId' : [ 0x28, ['unsigned long']],
+    'Flags' : [ 0x2c, ['unsigned long']],
+    'StrictFIFO' : [ 0x2c, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
+    'EnableHandleExceptions' : [ 0x2c, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned char')]],
+    'Rundown' : [ 0x2c, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned char')]],
+    'Duplicated' : [ 0x2c, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned char')]],
+    'RaiseUMExceptionOnInvalidHandleClose' : [ 0x2c, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned char')]],
+    'HandleContentionEvent' : [ 0x30, ['_EX_PUSH_LOCK']],
+    'HandleTableLock' : [ 0x38, ['_EX_PUSH_LOCK']],
+    'FreeLists' : [ 0x40, ['array', 1, ['_HANDLE_TABLE_FREE_LIST']]],
+    'ActualEntry' : [ 0x40, ['array', 32, ['unsigned char']]],
+    'DebugInfo' : [ 0x60, ['pointer64', ['_HANDLE_TRACE_DEBUG_INFO']]],
+} ],
+  '_HANDLE_TABLE_ENTRY_INFO' : [ 0x8, {
+    'AuditMask' : [ 0x0, ['unsigned long']],
+    'MaxRelativeAccessMask' : [ 0x4, ['unsigned long']],
+} ],
+  '_HANDLE_TABLE_ENTRY' : [ 0x10, {
+    'VolatileLowValue' : [ 0x0, ['long long']],
+    'LowValue' : [ 0x0, ['long long']],
+    'InfoTable' : [ 0x0, ['pointer64', ['_HANDLE_TABLE_ENTRY_INFO']]],
+    'HighValue' : [ 0x8, ['long long']],
+    'NextFreeHandleEntry' : [ 0x8, ['pointer64', ['_HANDLE_TABLE_ENTRY']]],
+    'LeafHandleValue' : [ 0x8, ['_EXHANDLE']],
+    'RefCountField' : [ 0x0, ['long long']],
+    'Unlocked' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long long')]],
+    'RefCnt' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 17, native_type='unsigned long long')]],
+    'Attributes' : [ 0x0, ['BitField', dict(start_bit = 17, end_bit = 20, native_type='unsigned long long')]],
+    'ObjectPointerBits' : [ 0x0, ['BitField', dict(start_bit = 20, end_bit = 64, native_type='unsigned long long')]],
+    'GrantedAccessBits' : [ 0x8, ['BitField', dict(start_bit = 0, end_bit = 25, native_type='unsigned long')]],
+    'NoRightsUpgrade' : [ 0x8, ['BitField', dict(start_bit = 25, end_bit = 26, native_type='unsigned long')]],
+    'Spare1' : [ 0x8, ['BitField', dict(start_bit = 26, end_bit = 32, native_type='unsigned long')]],
+    'Spare2' : [ 0xc, ['unsigned long']],
+} ],
+  '_EX_FAST_REF' : [ 0x8, {
+    'Object' : [ 0x0, ['pointer64', ['void']]],
+    'RefCnt' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 4, native_type='unsigned long long')]],
+    'Value' : [ 0x0, ['unsigned long long']],
+} ],
+  '__unnamed_13a3' : [ 0x2c, {
+    'InitialPrivilegeSet' : [ 0x0, ['_INITIAL_PRIVILEGE_SET']],
+    'PrivilegeSet' : [ 0x0, ['_PRIVILEGE_SET']],
+} ],
+  '_ACCESS_STATE' : [ 0xa0, {
+    'OperationID' : [ 0x0, ['_LUID']],
+    'SecurityEvaluated' : [ 0x8, ['unsigned char']],
+    'GenerateAudit' : [ 0x9, ['unsigned char']],
+    'GenerateOnClose' : [ 0xa, ['unsigned char']],
+    'PrivilegesAllocated' : [ 0xb, ['unsigned char']],
+    'Flags' : [ 0xc, ['unsigned long']],
+    'RemainingDesiredAccess' : [ 0x10, ['unsigned long']],
+    'PreviouslyGrantedAccess' : [ 0x14, ['unsigned long']],
+    'OriginalDesiredAccess' : [ 0x18, ['unsigned long']],
+    'SubjectSecurityContext' : [ 0x20, ['_SECURITY_SUBJECT_CONTEXT']],
+    'SecurityDescriptor' : [ 0x40, ['pointer64', ['void']]],
+    'AuxData' : [ 0x48, ['pointer64', ['void']]],
+    'Privileges' : [ 0x50, ['__unnamed_13a3']],
+    'AuditPrivileges' : [ 0x7c, ['unsigned char']],
+    'ObjectName' : [ 0x80, ['_UNICODE_STRING']],
+    'ObjectTypeName' : [ 0x90, ['_UNICODE_STRING']],
+} ],
+  '_AUX_ACCESS_DATA' : [ 0xe0, {
+    'PrivilegesUsed' : [ 0x0, ['pointer64', ['_PRIVILEGE_SET']]],
+    'GenericMapping' : [ 0x8, ['_GENERIC_MAPPING']],
+    'AccessesToAudit' : [ 0x18, ['unsigned long']],
+    'MaximumAuditMask' : [ 0x1c, ['unsigned long']],
+    'TransactionId' : [ 0x20, ['_GUID']],
+    'NewSecurityDescriptor' : [ 0x30, ['pointer64', ['void']]],
+    'ExistingSecurityDescriptor' : [ 0x38, ['pointer64', ['void']]],
+    'ParentSecurityDescriptor' : [ 0x40, ['pointer64', ['void']]],
+    'DeRefSecurityDescriptor' : [ 0x48, ['pointer64', ['void']]],
+    'SDLock' : [ 0x50, ['pointer64', ['void']]],
+    'AccessReasons' : [ 0x58, ['_ACCESS_REASONS']],
+    'GenerateStagingEvents' : [ 0xd8, ['unsigned char']],
+} ],
+  '_OBJECT_HANDLE_INFORMATION' : [ 0x8, {
+    'HandleAttributes' : [ 0x0, ['unsigned long']],
+    'GrantedAccess' : [ 0x4, ['unsigned long']],
+} ],
+  '_ETHREAD' : [ 0x820, {
+    'Tcb' : [ 0x0, ['_KTHREAD']],
+    'CreateTime' : [ 0x600, ['_LARGE_INTEGER']],
+    'ExitTime' : [ 0x608, ['_LARGE_INTEGER']],
+    'KeyedWaitChain' : [ 0x608, ['_LIST_ENTRY']],
+    'PostBlockList' : [ 0x618, ['_LIST_ENTRY']],
+    'ForwardLinkShadow' : [ 0x618, ['pointer64', ['void']]],
+    'StartAddress' : [ 0x620, ['pointer64', ['void']]],
+    'TerminationPort' : [ 0x628, ['pointer64', ['_TERMINATION_PORT']]],
+    'ReaperLink' : [ 0x628, ['pointer64', ['_ETHREAD']]],
+    'KeyedWaitValue' : [ 0x628, ['pointer64', ['void']]],
+    'ActiveTimerListLock' : [ 0x630, ['unsigned long long']],
+    'ActiveTimerListHead' : [ 0x638, ['_LIST_ENTRY']],
+    'Cid' : [ 0x648, ['_CLIENT_ID']],
+    'KeyedWaitSemaphore' : [ 0x658, ['_KSEMAPHORE']],
+    'AlpcWaitSemaphore' : [ 0x658, ['_KSEMAPHORE']],
+    'ClientSecurity' : [ 0x678, ['_PS_CLIENT_SECURITY_CONTEXT']],
+    'IrpList' : [ 0x680, ['_LIST_ENTRY']],
+    'TopLevelIrp' : [ 0x690, ['unsigned long long']],
+    'DeviceToVerify' : [ 0x698, ['pointer64', ['_DEVICE_OBJECT']]],
+    'Win32StartAddress' : [ 0x6a0, ['pointer64', ['void']]],
+    'ChargeOnlySession' : [ 0x6a8, ['pointer64', ['void']]],
+    'LegacyPowerObject' : [ 0x6b0, ['pointer64', ['void']]],
+    'ThreadListEntry' : [ 0x6b8, ['_LIST_ENTRY']],
+    'RundownProtect' : [ 0x6c8, ['_EX_RUNDOWN_REF']],
+    'ThreadLock' : [ 0x6d0, ['_EX_PUSH_LOCK']],
+    'ReadClusterSize' : [ 0x6d8, ['unsigned long']],
+    'MmLockOrdering' : [ 0x6dc, ['long']],
+    'CrossThreadFlags' : [ 0x6e0, ['unsigned long']],
+    'Terminated' : [ 0x6e0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
+    'ThreadInserted' : [ 0x6e0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
+    'HideFromDebugger' : [ 0x6e0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
+    'ActiveImpersonationInfo' : [ 0x6e0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
+    'HardErrorsAreDisabled' : [ 0x6e0, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
+    'BreakOnTermination' : [ 0x6e0, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
+    'SkipCreationMsg' : [ 0x6e0, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
+    'SkipTerminationMsg' : [ 0x6e0, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
+    'CopyTokenOnOpen' : [ 0x6e0, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long')]],
+    'ThreadIoPriority' : [ 0x6e0, ['BitField', dict(start_bit = 9, end_bit = 12, native_type='unsigned long')]],
+    'ThreadPagePriority' : [ 0x6e0, ['BitField', dict(start_bit = 12, end_bit = 15, native_type='unsigned long')]],
+    'RundownFail' : [ 0x6e0, ['BitField', dict(start_bit = 15, end_bit = 16, native_type='unsigned long')]],
+    'UmsForceQueueTermination' : [ 0x6e0, ['BitField', dict(start_bit = 16, end_bit = 17, native_type='unsigned long')]],
+    'IndirectCpuSets' : [ 0x6e0, ['BitField', dict(start_bit = 17, end_bit = 18, native_type='unsigned long')]],
+    'DisableDynamicCodeOptOut' : [ 0x6e0, ['BitField', dict(start_bit = 18, end_bit = 19, native_type='unsigned long')]],
+    'ExplicitCaseSensitivity' : [ 0x6e0, ['BitField', dict(start_bit = 19, end_bit = 20, native_type='unsigned long')]],
+    'PicoNotifyExit' : [ 0x6e0, ['BitField', dict(start_bit = 20, end_bit = 21, native_type='unsigned long')]],
+    'DbgWerUserReportActive' : [ 0x6e0, ['BitField', dict(start_bit = 21, end_bit = 22, native_type='unsigned long')]],
+    'ForcedSelfTrimActive' : [ 0x6e0, ['BitField', dict(start_bit = 22, end_bit = 23, native_type='unsigned long')]],
+    'SamplingCoverage' : [ 0x6e0, ['BitField', dict(start_bit = 23, end_bit = 24, native_type='unsigned long')]],
+    'ReservedCrossThreadFlags' : [ 0x6e0, ['BitField', dict(start_bit = 24, end_bit = 32, native_type='unsigned long')]],
+    'SameThreadPassiveFlags' : [ 0x6e4, ['unsigned long']],
+    'ActiveExWorker' : [ 0x6e4, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
+    'MemoryMaker' : [ 0x6e4, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
+    'StoreLockThread' : [ 0x6e4, ['BitField', dict(start_bit = 2, end_bit = 4, native_type='unsigned long')]],
+    'ClonedThread' : [ 0x6e4, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
+    'KeyedEventInUse' : [ 0x6e4, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
+    'SelfTerminate' : [ 0x6e4, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
+    'RespectIoPriority' : [ 0x6e4, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
+    'ActivePageLists' : [ 0x6e4, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long')]],
+    'SecureContext' : [ 0x6e4, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long')]],
+    'ZeroPageThread' : [ 0x6e4, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned long')]],
+    'WorkloadClass' : [ 0x6e4, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned long')]],
+    'ReservedSameThreadPassiveFlags' : [ 0x6e4, ['BitField', dict(start_bit = 12, end_bit = 32, native_type='unsigned long')]],
+    'SameThreadApcFlags' : [ 0x6e8, ['unsigned long']],
+    'OwnsProcessAddressSpaceExclusive' : [ 0x6e8, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
+    'OwnsProcessAddressSpaceShared' : [ 0x6e8, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned char')]],
+    'HardFaultBehavior' : [ 0x6e8, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned char')]],
+    'StartAddressInvalid' : [ 0x6e8, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned char')]],
+    'EtwCalloutActive' : [ 0x6e8, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned char')]],
+    'SuppressSymbolLoad' : [ 0x6e8, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned char')]],
+    'Prefetching' : [ 0x6e8, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned char')]],
+    'OwnsVadExclusive' : [ 0x6e8, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned char')]],
+    'SystemPagePriorityActive' : [ 0x6e9, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
+    'SystemPagePriority' : [ 0x6e9, ['BitField', dict(start_bit = 1, end_bit = 4, native_type='unsigned char')]],
+    'AllowUserWritesToExecutableMemory' : [ 0x6e9, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned char')]],
+    'AllowKernelWritesToExecutableMemory' : [ 0x6e9, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned char')]],
+    'OwnsVadShared' : [ 0x6e9, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned char')]],
+    'CacheManagerActive' : [ 0x6ec, ['unsigned char']],
+    'DisablePageFaultClustering' : [ 0x6ed, ['unsigned char']],
+    'ActiveFaultCount' : [ 0x6ee, ['unsigned char']],
+    'LockOrderState' : [ 0x6ef, ['unsigned char']],
+    'AlpcMessageId' : [ 0x6f0, ['unsigned long long']],
+    'AlpcMessage' : [ 0x6f8, ['pointer64', ['void']]],
+    'AlpcReceiveAttributeSet' : [ 0x6f8, ['unsigned long']],
+    'AlpcWaitListEntry' : [ 0x700, ['_LIST_ENTRY']],
+    'ExitStatus' : [ 0x710, ['long']],
+    'CacheManagerCount' : [ 0x714, ['unsigned long']],
+    'IoBoostCount' : [ 0x718, ['unsigned long']],
+    'IoQoSBoostCount' : [ 0x71c, ['unsigned long']],
+    'IoQoSThrottleCount' : [ 0x720, ['unsigned long']],
+    'KernelStackReference' : [ 0x724, ['unsigned long']],
+    'BoostList' : [ 0x728, ['_LIST_ENTRY']],
+    'DeboostList' : [ 0x738, ['_LIST_ENTRY']],
+    'BoostListLock' : [ 0x748, ['unsigned long long']],
+    'IrpListLock' : [ 0x750, ['unsigned long long']],
+    'ReservedForSynchTracking' : [ 0x758, ['pointer64', ['void']]],
+    'CmCallbackListHead' : [ 0x760, ['_SINGLE_LIST_ENTRY']],
+    'ActivityId' : [ 0x768, ['pointer64', ['_GUID']]],
+    'SeLearningModeListHead' : [ 0x770, ['_SINGLE_LIST_ENTRY']],
+    'VerifierContext' : [ 0x778, ['pointer64', ['void']]],
+    'AdjustedClientToken' : [ 0x780, ['pointer64', ['void']]],
+    'WorkOnBehalfThread' : [ 0x788, ['pointer64', ['void']]],
+    'PropertySet' : [ 0x790, ['_PS_PROPERTY_SET']],
+    'PicoContext' : [ 0x7a8, ['pointer64', ['void']]],
+    'UserFsBase' : [ 0x7b0, ['unsigned long long']],
+    'UserGsBase' : [ 0x7b8, ['unsigned long long']],
+    'EnergyValues' : [ 0x7c0, ['pointer64', ['_THREAD_ENERGY_VALUES']]],
+    'CmDbgInfo' : [ 0x7c8, ['pointer64', ['void']]],
+    'SelectedCpuSets' : [ 0x7d0, ['unsigned long long']],
+    'SelectedCpuSetsIndirect' : [ 0x7d0, ['pointer64', ['unsigned long long']]],
+    'Silo' : [ 0x7d8, ['pointer64', ['_EJOB']]],
+    'ThreadName' : [ 0x7e0, ['pointer64', ['_UNICODE_STRING']]],
+    'SetContextState' : [ 0x7e8, ['pointer64', ['_CONTEXT']]],
+    'LastExpectedRunTime' : [ 0x7f0, ['unsigned long']],
+    'HeapData' : [ 0x7f4, ['unsigned long']],
+    'OwnerEntryListHead' : [ 0x7f8, ['_LIST_ENTRY']],
+    'DisownedOwnerEntryListLock' : [ 0x808, ['unsigned long long']],
+    'DisownedOwnerEntryListHead' : [ 0x810, ['_LIST_ENTRY']],
+} ],
+  '__unnamed_13fe' : [ 0x4, {
+    'ControlFlowGuardEnabled' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
+    'ControlFlowGuardExportSuppressionEnabled' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
+    'ControlFlowGuardStrict' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
+    'DisallowStrippedImages' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
+    'ForceRelocateImages' : [ 0x0, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
+    'HighEntropyASLREnabled' : [ 0x0, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
+    'StackRandomizationDisabled' : [ 0x0, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
+    'ExtensionPointDisable' : [ 0x0, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
+    'DisableDynamicCode' : [ 0x0, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long')]],
+    'DisableDynamicCodeAllowOptOut' : [ 0x0, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long')]],
+    'DisableDynamicCodeAllowRemoteDowngrade' : [ 0x0, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned long')]],
+    'AuditDisableDynamicCode' : [ 0x0, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned long')]],
+    'DisallowWin32kSystemCalls' : [ 0x0, ['BitField', dict(start_bit = 12, end_bit = 13, native_type='unsigned long')]],
+    'AuditDisallowWin32kSystemCalls' : [ 0x0, ['BitField', dict(start_bit = 13, end_bit = 14, native_type='unsigned long')]],
+    'EnableFilteredWin32kAPIs' : [ 0x0, ['BitField', dict(start_bit = 14, end_bit = 15, native_type='unsigned long')]],
+    'AuditFilteredWin32kAPIs' : [ 0x0, ['BitField', dict(start_bit = 15, end_bit = 16, native_type='unsigned long')]],
+    'DisableNonSystemFonts' : [ 0x0, ['BitField', dict(start_bit = 16, end_bit = 17, native_type='unsigned long')]],
+    'AuditNonSystemFontLoading' : [ 0x0, ['BitField', dict(start_bit = 17, end_bit = 18, native_type='unsigned long')]],
+    'PreferSystem32Images' : [ 0x0, ['BitField', dict(start_bit = 18, end_bit = 19, native_type='unsigned long')]],
+    'ProhibitRemoteImageMap' : [ 0x0, ['BitField', dict(start_bit = 19, end_bit = 20, native_type='unsigned long')]],
+    'AuditProhibitRemoteImageMap' : [ 0x0, ['BitField', dict(start_bit = 20, end_bit = 21, native_type='unsigned long')]],
+    'ProhibitLowILImageMap' : [ 0x0, ['BitField', dict(start_bit = 21, end_bit = 22, native_type='unsigned long')]],
+    'AuditProhibitLowILImageMap' : [ 0x0, ['BitField', dict(start_bit = 22, end_bit = 23, native_type='unsigned long')]],
+    'SignatureMitigationOptIn' : [ 0x0, ['BitField', dict(start_bit = 23, end_bit = 24, native_type='unsigned long')]],
+    'AuditBlockNonMicrosoftBinaries' : [ 0x0, ['BitField', dict(start_bit = 24, end_bit = 25, native_type='unsigned long')]],
+    'AuditBlockNonMicrosoftBinariesAllowStore' : [ 0x0, ['BitField', dict(start_bit = 25, end_bit = 26, native_type='unsigned long')]],
+    'LoaderIntegrityContinuityEnabled' : [ 0x0, ['BitField', dict(start_bit = 26, end_bit = 27, native_type='unsigned long')]],
+    'AuditLoaderIntegrityContinuity' : [ 0x0, ['BitField', dict(start_bit = 27, end_bit = 28, native_type='unsigned long')]],
+    'EnableModuleTamperingProtection' : [ 0x0, ['BitField', dict(start_bit = 28, end_bit = 29, native_type='unsigned long')]],
+    'EnableModuleTamperingProtectionNoInherit' : [ 0x0, ['BitField', dict(start_bit = 29, end_bit = 30, native_type='unsigned long')]],
+    'RestrictIndirectBranchPrediction' : [ 0x0, ['BitField', dict(start_bit = 30, end_bit = 31, native_type='unsigned long')]],
+    'IsolateSecurityDomain' : [ 0x0, ['BitField', dict(start_bit = 31, end_bit = 32, native_type='unsigned long')]],
+} ],
+  '__unnamed_1400' : [ 0x4, {
+    'EnableExportAddressFilter' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
+    'AuditExportAddressFilter' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
+    'EnableExportAddressFilterPlus' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
+    'AuditExportAddressFilterPlus' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
+    'EnableRopStackPivot' : [ 0x0, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
+    'AuditRopStackPivot' : [ 0x0, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
+    'EnableRopCallerCheck' : [ 0x0, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
+    'AuditRopCallerCheck' : [ 0x0, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
+    'EnableRopSimExec' : [ 0x0, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long')]],
+    'AuditRopSimExec' : [ 0x0, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long')]],
+    'EnableImportAddressFilter' : [ 0x0, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned long')]],
+    'AuditImportAddressFilter' : [ 0x0, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned long')]],
+    'DisablePageCombine' : [ 0x0, ['BitField', dict(start_bit = 12, end_bit = 13, native_type='unsigned long')]],
+    'SpeculativeStoreBypassDisable' : [ 0x0, ['BitField', dict(start_bit = 13, end_bit = 14, native_type='unsigned long')]],
+    'CetUserShadowStacks' : [ 0x0, ['BitField', dict(start_bit = 14, end_bit = 15, native_type='unsigned long')]],
+} ],
+  '_EPROCESS' : [ 0x880, {
+    'Pcb' : [ 0x0, ['_KPROCESS']],
+    'ProcessLock' : [ 0x2e0, ['_EX_PUSH_LOCK']],
+    'UniqueProcessId' : [ 0x2e8, ['pointer64', ['void']]],
+    'ActiveProcessLinks' : [ 0x2f0, ['_LIST_ENTRY']],
+    'RundownProtect' : [ 0x300, ['_EX_RUNDOWN_REF']],
+    'Flags2' : [ 0x308, ['unsigned long']],
+    'JobNotReallyActive' : [ 0x308, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
+    'AccountingFolded' : [ 0x308, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
+    'NewProcessReported' : [ 0x308, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
+    'ExitProcessReported' : [ 0x308, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
+    'ReportCommitChanges' : [ 0x308, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
+    'LastReportMemory' : [ 0x308, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
+    'ForceWakeCharge' : [ 0x308, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
+    'CrossSessionCreate' : [ 0x308, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
+    'NeedsHandleRundown' : [ 0x308, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long')]],
+    'RefTraceEnabled' : [ 0x308, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long')]],
+    'PicoCreated' : [ 0x308, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned long')]],
+    'EmptyJobEvaluated' : [ 0x308, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned long')]],
+    'DefaultPagePriority' : [ 0x308, ['BitField', dict(start_bit = 12, end_bit = 15, native_type='unsigned long')]],
+    'PrimaryTokenFrozen' : [ 0x308, ['BitField', dict(start_bit = 15, end_bit = 16, native_type='unsigned long')]],
+    'ProcessVerifierTarget' : [ 0x308, ['BitField', dict(start_bit = 16, end_bit = 17, native_type='unsigned long')]],
+    'RestrictSetThreadContext' : [ 0x308, ['BitField', dict(start_bit = 17, end_bit = 18, native_type='unsigned long')]],
+    'AffinityPermanent' : [ 0x308, ['BitField', dict(start_bit = 18, end_bit = 19, native_type='unsigned long')]],
+    'AffinityUpdateEnable' : [ 0x308, ['BitField', dict(start_bit = 19, end_bit = 20, native_type='unsigned long')]],
+    'PropagateNode' : [ 0x308, ['BitField', dict(start_bit = 20, end_bit = 21, native_type='unsigned long')]],
+    'ExplicitAffinity' : [ 0x308, ['BitField', dict(start_bit = 21, end_bit = 22, native_type='unsigned long')]],
+    'ProcessExecutionState' : [ 0x308, ['BitField', dict(start_bit = 22, end_bit = 24, native_type='unsigned long')]],
+    'EnableReadVmLogging' : [ 0x308, ['BitField', dict(start_bit = 24, end_bit = 25, native_type='unsigned long')]],
+    'EnableWriteVmLogging' : [ 0x308, ['BitField', dict(start_bit = 25, end_bit = 26, native_type='unsigned long')]],
+    'FatalAccessTerminationRequested' : [ 0x308, ['BitField', dict(start_bit = 26, end_bit = 27, native_type='unsigned long')]],
+    'DisableSystemAllowedCpuSet' : [ 0x308, ['BitField', dict(start_bit = 27, end_bit = 28, native_type='unsigned long')]],
+    'ProcessStateChangeRequest' : [ 0x308, ['BitField', dict(start_bit = 28, end_bit = 30, native_type='unsigned long')]],
+    'ProcessStateChangeInProgress' : [ 0x308, ['BitField', dict(start_bit = 30, end_bit = 31, native_type='unsigned long')]],
+    'InPrivate' : [ 0x308, ['BitField', dict(start_bit = 31, end_bit = 32, native_type='unsigned long')]],
+    'Flags' : [ 0x30c, ['unsigned long']],
+    'CreateReported' : [ 0x30c, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
+    'NoDebugInherit' : [ 0x30c, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
+    'ProcessExiting' : [ 0x30c, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
+    'ProcessDelete' : [ 0x30c, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
+    'ManageExecutableMemoryWrites' : [ 0x30c, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
+    'VmDeleted' : [ 0x30c, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
+    'OutswapEnabled' : [ 0x30c, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
+    'Outswapped' : [ 0x30c, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
+    'FailFastOnCommitFail' : [ 0x30c, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long')]],
+    'Wow64VaSpace4Gb' : [ 0x30c, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long')]],
+    'AddressSpaceInitialized' : [ 0x30c, ['BitField', dict(start_bit = 10, end_bit = 12, native_type='unsigned long')]],
+    'SetTimerResolution' : [ 0x30c, ['BitField', dict(start_bit = 12, end_bit = 13, native_type='unsigned long')]],
+    'BreakOnTermination' : [ 0x30c, ['BitField', dict(start_bit = 13, end_bit = 14, native_type='unsigned long')]],
+    'DeprioritizeViews' : [ 0x30c, ['BitField', dict(start_bit = 14, end_bit = 15, native_type='unsigned long')]],
+    'WriteWatch' : [ 0x30c, ['BitField', dict(start_bit = 15, end_bit = 16, native_type='unsigned long')]],
+    'ProcessInSession' : [ 0x30c, ['BitField', dict(start_bit = 16, end_bit = 17, native_type='unsigned long')]],
+    'OverrideAddressSpace' : [ 0x30c, ['BitField', dict(start_bit = 17, end_bit = 18, native_type='unsigned long')]],
+    'HasAddressSpace' : [ 0x30c, ['BitField', dict(start_bit = 18, end_bit = 19, native_type='unsigned long')]],
+    'LaunchPrefetched' : [ 0x30c, ['BitField', dict(start_bit = 19, end_bit = 20, native_type='unsigned long')]],
+    'Background' : [ 0x30c, ['BitField', dict(start_bit = 20, end_bit = 21, native_type='unsigned long')]],
+    'VmTopDown' : [ 0x30c, ['BitField', dict(start_bit = 21, end_bit = 22, native_type='unsigned long')]],
+    'ImageNotifyDone' : [ 0x30c, ['BitField', dict(start_bit = 22, end_bit = 23, native_type='unsigned long')]],
+    'PdeUpdateNeeded' : [ 0x30c, ['BitField', dict(start_bit = 23, end_bit = 24, native_type='unsigned long')]],
+    'VdmAllowed' : [ 0x30c, ['BitField', dict(start_bit = 24, end_bit = 25, native_type='unsigned long')]],
+    'ProcessRundown' : [ 0x30c, ['BitField', dict(start_bit = 25, end_bit = 26, native_type='unsigned long')]],
+    'ProcessInserted' : [ 0x30c, ['BitField', dict(start_bit = 26, end_bit = 27, native_type='unsigned long')]],
+    'DefaultIoPriority' : [ 0x30c, ['BitField', dict(start_bit = 27, end_bit = 30, native_type='unsigned long')]],
+    'ProcessSelfDelete' : [ 0x30c, ['BitField', dict(start_bit = 30, end_bit = 31, native_type='unsigned long')]],
+    'SetTimerResolutionLink' : [ 0x30c, ['BitField', dict(start_bit = 31, end_bit = 32, native_type='unsigned long')]],
+    'CreateTime' : [ 0x310, ['_LARGE_INTEGER']],
+    'ProcessQuotaUsage' : [ 0x318, ['array', 2, ['unsigned long long']]],
+    'ProcessQuotaPeak' : [ 0x328, ['array', 2, ['unsigned long long']]],
+    'PeakVirtualSize' : [ 0x338, ['unsigned long long']],
+    'VirtualSize' : [ 0x340, ['unsigned long long']],
+    'SessionProcessLinks' : [ 0x348, ['_LIST_ENTRY']],
+    'ExceptionPortData' : [ 0x358, ['pointer64', ['void']]],
+    'ExceptionPortValue' : [ 0x358, ['unsigned long long']],
+    'ExceptionPortState' : [ 0x358, ['BitField', dict(start_bit = 0, end_bit = 3, native_type='unsigned long long')]],
+    'Token' : [ 0x360, ['_EX_FAST_REF']],
+    'MmReserved' : [ 0x368, ['unsigned long long']],
+    'AddressCreationLock' : [ 0x370, ['_EX_PUSH_LOCK']],
+    'PageTableCommitmentLock' : [ 0x378, ['_EX_PUSH_LOCK']],
+    'RotateInProgress' : [ 0x380, ['pointer64', ['_ETHREAD']]],
+    'ForkInProgress' : [ 0x388, ['pointer64', ['_ETHREAD']]],
+    'CommitChargeJob' : [ 0x390, ['pointer64', ['_EJOB']]],
+    'CloneRoot' : [ 0x398, ['_RTL_AVL_TREE']],
+    'NumberOfPrivatePages' : [ 0x3a0, ['unsigned long long']],
+    'NumberOfLockedPages' : [ 0x3a8, ['unsigned long long']],
+    'Win32Process' : [ 0x3b0, ['pointer64', ['void']]],
+    'Job' : [ 0x3b8, ['pointer64', ['_EJOB']]],
+    'SectionObject' : [ 0x3c0, ['pointer64', ['void']]],
+    'SectionBaseAddress' : [ 0x3c8, ['pointer64', ['void']]],
+    'Cookie' : [ 0x3d0, ['unsigned long']],
+    'WorkingSetWatch' : [ 0x3d8, ['pointer64', ['_PAGEFAULT_HISTORY']]],
+    'Win32WindowStation' : [ 0x3e0, ['pointer64', ['void']]],
+    'InheritedFromUniqueProcessId' : [ 0x3e8, ['pointer64', ['void']]],
+    'OwnerProcessId' : [ 0x3f0, ['unsigned long long']],
+    'Peb' : [ 0x3f8, ['pointer64', ['_PEB']]],
+    'Session' : [ 0x400, ['pointer64', ['_MM_SESSION_SPACE']]],
+    'Spare1' : [ 0x408, ['pointer64', ['void']]],
+    'QuotaBlock' : [ 0x410, ['pointer64', ['_EPROCESS_QUOTA_BLOCK']]],
+    'ObjectTable' : [ 0x418, ['pointer64', ['_HANDLE_TABLE']]],
+    'DebugPort' : [ 0x420, ['pointer64', ['void']]],
+    'WoW64Process' : [ 0x428, ['pointer64', ['_EWOW64PROCESS']]],
+    'DeviceMap' : [ 0x430, ['pointer64', ['void']]],
+    'EtwDataSource' : [ 0x438, ['pointer64', ['void']]],
+    'PageDirectoryPte' : [ 0x440, ['unsigned long long']],
+    'ImageFilePointer' : [ 0x448, ['pointer64', ['_FILE_OBJECT']]],
+    'ImageFileName' : [ 0x450, ['array', 15, ['unsigned char']]],
+    'PriorityClass' : [ 0x45f, ['unsigned char']],
+    'SecurityPort' : [ 0x460, ['pointer64', ['void']]],
+    'SeAuditProcessCreationInfo' : [ 0x468, ['_SE_AUDIT_PROCESS_CREATION_INFO']],
+    'JobLinks' : [ 0x470, ['_LIST_ENTRY']],
+    'HighestUserAddress' : [ 0x480, ['pointer64', ['void']]],
+    'ThreadListHead' : [ 0x488, ['_LIST_ENTRY']],
+    'ActiveThreads' : [ 0x498, ['unsigned long']],
+    'ImagePathHash' : [ 0x49c, ['unsigned long']],
+    'DefaultHardErrorProcessing' : [ 0x4a0, ['unsigned long']],
+    'LastThreadExitStatus' : [ 0x4a4, ['long']],
+    'PrefetchTrace' : [ 0x4a8, ['_EX_FAST_REF']],
+    'LockedPagesList' : [ 0x4b0, ['pointer64', ['void']]],
+    'ReadOperationCount' : [ 0x4b8, ['_LARGE_INTEGER']],
+    'WriteOperationCount' : [ 0x4c0, ['_LARGE_INTEGER']],
+    'OtherOperationCount' : [ 0x4c8, ['_LARGE_INTEGER']],
+    'ReadTransferCount' : [ 0x4d0, ['_LARGE_INTEGER']],
+    'WriteTransferCount' : [ 0x4d8, ['_LARGE_INTEGER']],
+    'OtherTransferCount' : [ 0x4e0, ['_LARGE_INTEGER']],
+    'CommitChargeLimit' : [ 0x4e8, ['unsigned long long']],
+    'CommitCharge' : [ 0x4f0, ['unsigned long long']],
+    'CommitChargePeak' : [ 0x4f8, ['unsigned long long']],
+    'Vm' : [ 0x500, ['_MMSUPPORT_FULL']],
+    'MmProcessLinks' : [ 0x640, ['_LIST_ENTRY']],
+    'ModifiedPageCount' : [ 0x650, ['unsigned long']],
+    'ExitStatus' : [ 0x654, ['long']],
+    'VadRoot' : [ 0x658, ['_RTL_AVL_TREE']],
+    'VadHint' : [ 0x660, ['pointer64', ['void']]],
+    'VadCount' : [ 0x668, ['unsigned long long']],
+    'VadPhysicalPages' : [ 0x670, ['unsigned long long']],
+    'VadPhysicalPagesLimit' : [ 0x678, ['unsigned long long']],
+    'AlpcContext' : [ 0x680, ['_ALPC_PROCESS_CONTEXT']],
+    'TimerResolutionLink' : [ 0x6a0, ['_LIST_ENTRY']],
+    'TimerResolutionStackRecord' : [ 0x6b0, ['pointer64', ['_PO_DIAG_STACK_RECORD']]],
+    'RequestedTimerResolution' : [ 0x6b8, ['unsigned long']],
+    'SmallestTimerResolution' : [ 0x6bc, ['unsigned long']],
+    'ExitTime' : [ 0x6c0, ['_LARGE_INTEGER']],
+    'InvertedFunctionTable' : [ 0x6c8, ['pointer64', ['_INVERTED_FUNCTION_TABLE']]],
+    'InvertedFunctionTableLock' : [ 0x6d0, ['_EX_PUSH_LOCK']],
+    'ActiveThreadsHighWatermark' : [ 0x6d8, ['unsigned long']],
+    'LargePrivateVadCount' : [ 0x6dc, ['unsigned long']],
+    'ThreadListLock' : [ 0x6e0, ['_EX_PUSH_LOCK']],
+    'WnfContext' : [ 0x6e8, ['pointer64', ['void']]],
+    'ServerSilo' : [ 0x6f0, ['pointer64', ['_EJOB']]],
+    'SignatureLevel' : [ 0x6f8, ['unsigned char']],
+    'SectionSignatureLevel' : [ 0x6f9, ['unsigned char']],
+    'Protection' : [ 0x6fa, ['_PS_PROTECTION']],
+    'HangCount' : [ 0x6fb, ['BitField', dict(start_bit = 0, end_bit = 3, native_type='unsigned char')]],
+    'GhostCount' : [ 0x6fb, ['BitField', dict(start_bit = 3, end_bit = 6, native_type='unsigned char')]],
+    'PrefilterException' : [ 0x6fb, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned char')]],
+    'Flags3' : [ 0x6fc, ['unsigned long']],
+    'Minimal' : [ 0x6fc, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
+    'ReplacingPageRoot' : [ 0x6fc, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
+    'Crashed' : [ 0x6fc, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
+    'JobVadsAreTracked' : [ 0x6fc, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
+    'VadTrackingDisabled' : [ 0x6fc, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
+    'AuxiliaryProcess' : [ 0x6fc, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
+    'SubsystemProcess' : [ 0x6fc, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
+    'IndirectCpuSets' : [ 0x6fc, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
+    'RelinquishedCommit' : [ 0x6fc, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long')]],
+    'HighGraphicsPriority' : [ 0x6fc, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long')]],
+    'CommitFailLogged' : [ 0x6fc, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned long')]],
+    'ReserveFailLogged' : [ 0x6fc, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned long')]],
+    'SystemProcess' : [ 0x6fc, ['BitField', dict(start_bit = 12, end_bit = 13, native_type='unsigned long')]],
+    'HideImageBaseAddresses' : [ 0x6fc, ['BitField', dict(start_bit = 13, end_bit = 14, native_type='unsigned long')]],
+    'AddressPolicyFrozen' : [ 0x6fc, ['BitField', dict(start_bit = 14, end_bit = 15, native_type='unsigned long')]],
+    'ProcessFirstResume' : [ 0x6fc, ['BitField', dict(start_bit = 15, end_bit = 16, native_type='unsigned long')]],
+    'ForegroundExternal' : [ 0x6fc, ['BitField', dict(start_bit = 16, end_bit = 17, native_type='unsigned long')]],
+    'ForegroundSystem' : [ 0x6fc, ['BitField', dict(start_bit = 17, end_bit = 18, native_type='unsigned long')]],
+    'HighMemoryPriority' : [ 0x6fc, ['BitField', dict(start_bit = 18, end_bit = 19, native_type='unsigned long')]],
+    'EnableProcessSuspendResumeLogging' : [ 0x6fc, ['BitField', dict(start_bit = 19, end_bit = 20, native_type='unsigned long')]],
+    'EnableThreadSuspendResumeLogging' : [ 0x6fc, ['BitField', dict(start_bit = 20, end_bit = 21, native_type='unsigned long')]],
+    'SecurityDomainChanged' : [ 0x6fc, ['BitField', dict(start_bit = 21, end_bit = 22, native_type='unsigned long')]],
+    'SecurityFreezeComplete' : [ 0x6fc, ['BitField', dict(start_bit = 22, end_bit = 23, native_type='unsigned long')]],
+    'VmProcessorHost' : [ 0x6fc, ['BitField', dict(start_bit = 23, end_bit = 24, native_type='unsigned long')]],
+    'DeviceAsid' : [ 0x700, ['long']],
+    'SvmData' : [ 0x708, ['pointer64', ['void']]],
+    'SvmProcessLock' : [ 0x710, ['_EX_PUSH_LOCK']],
+    'SvmLock' : [ 0x718, ['unsigned long long']],
+    'SvmProcessDeviceListHead' : [ 0x720, ['_LIST_ENTRY']],
+    'LastFreezeInterruptTime' : [ 0x730, ['unsigned long long']],
+    'DiskCounters' : [ 0x738, ['pointer64', ['_PROCESS_DISK_COUNTERS']]],
+    'PicoContext' : [ 0x740, ['pointer64', ['void']]],
+    'EnclaveTable' : [ 0x748, ['pointer64', ['void']]],
+    'EnclaveNumber' : [ 0x750, ['unsigned long long']],
+    'EnclaveLock' : [ 0x758, ['_EX_PUSH_LOCK']],
+    'HighPriorityFaultsAllowed' : [ 0x760, ['unsigned long']],
+    'EnergyContext' : [ 0x768, ['pointer64', ['_PO_PROCESS_ENERGY_CONTEXT']]],
+    'VmContext' : [ 0x770, ['pointer64', ['void']]],
+    'SequenceNumber' : [ 0x778, ['unsigned long long']],
+    'CreateInterruptTime' : [ 0x780, ['unsigned long long']],
+    'CreateUnbiasedInterruptTime' : [ 0x788, ['unsigned long long']],
+    'TotalUnbiasedFrozenTime' : [ 0x790, ['unsigned long long']],
+    'LastAppStateUpdateTime' : [ 0x798, ['unsigned long long']],
+    'LastAppStateUptime' : [ 0x7a0, ['BitField', dict(start_bit = 0, end_bit = 61, native_type='unsigned long long')]],
+    'LastAppState' : [ 0x7a0, ['BitField', dict(start_bit = 61, end_bit = 64, native_type='unsigned long long')]],
+    'SharedCommitCharge' : [ 0x7a8, ['unsigned long long']],
+    'SharedCommitLock' : [ 0x7b0, ['_EX_PUSH_LOCK']],
+    'SharedCommitLinks' : [ 0x7b8, ['_LIST_ENTRY']],
+    'AllowedCpuSets' : [ 0x7c8, ['unsigned long long']],
+    'DefaultCpuSets' : [ 0x7d0, ['unsigned long long']],
+    'AllowedCpuSetsIndirect' : [ 0x7c8, ['pointer64', ['unsigned long long']]],
+    'DefaultCpuSetsIndirect' : [ 0x7d0, ['pointer64', ['unsigned long long']]],
+    'DiskIoAttribution' : [ 0x7d8, ['pointer64', ['void']]],
+    'DxgProcess' : [ 0x7e0, ['pointer64', ['void']]],
+    'Win32KFilterSet' : [ 0x7e8, ['unsigned long']],
+    'ProcessTimerDelay' : [ 0x7f0, ['_PS_INTERLOCKED_TIMER_DELAY_VALUES']],
+    'KTimerSets' : [ 0x7f8, ['unsigned long']],
+    'KTimer2Sets' : [ 0x7fc, ['unsigned long']],
+    'ThreadTimerSets' : [ 0x800, ['unsigned long']],
+    'VirtualTimerListLock' : [ 0x808, ['unsigned long long']],
+    'VirtualTimerListHead' : [ 0x810, ['_LIST_ENTRY']],
+    'WakeChannel' : [ 0x820, ['_WNF_STATE_NAME']],
+    'WakeInfo' : [ 0x820, ['_PS_PROCESS_WAKE_INFORMATION']],
+    'MitigationFlags' : [ 0x850, ['unsigned long']],
+    'MitigationFlagsValues' : [ 0x850, ['__unnamed_13fe']],
+    'MitigationFlags2' : [ 0x854, ['unsigned long']],
+    'MitigationFlags2Values' : [ 0x854, ['__unnamed_1400']],
+    'PartitionObject' : [ 0x858, ['pointer64', ['void']]],
+    'SecurityDomain' : [ 0x860, ['unsigned long long']],
+    'ParentSecurityDomain' : [ 0x868, ['unsigned long long']],
+    'CoverageSamplerContext' : [ 0x870, ['pointer64', ['void']]],
+    'MmHotPatchContext' : [ 0x878, ['pointer64', ['void']]],
+} ],
+  '_EWOW64PROCESS' : [ 0x10, {
+    'Peb' : [ 0x0, ['pointer64', ['void']]],
+    'Machine' : [ 0x8, ['unsigned short']],
+    'NtdllType' : [ 0xc, ['Enumeration', dict(target = 'long', choices = {0: u'PsNativeSystemDll', 1: u'PsWowX86SystemDll', 2: u'PsWowArm32SystemDll', 3: u'PsWowAmd64SystemDll', 4: u'PsWowChpeX86SystemDll', 5: u'PsVsmEnclaveRuntimeDll', 6: u'PsSystemDllTotalTypes'})]],
+} ],
+  '__unnamed_141d' : [ 0x8, {
+    'MasterIrp' : [ 0x0, ['pointer64', ['_IRP']]],
+    'IrpCount' : [ 0x0, ['long']],
+    'SystemBuffer' : [ 0x0, ['pointer64', ['void']]],
+} ],
+  '__unnamed_1423' : [ 0x10, {
+    'UserApcRoutine' : [ 0x0, ['pointer64', ['void']]],
+    'IssuingProcess' : [ 0x0, ['pointer64', ['void']]],
+    'UserApcContext' : [ 0x8, ['pointer64', ['void']]],
+} ],
+  '__unnamed_1425' : [ 0x10, {
+    'AsynchronousParameters' : [ 0x0, ['__unnamed_1423']],
+    'AllocationSize' : [ 0x0, ['_LARGE_INTEGER']],
+} ],
+  '__unnamed_142e' : [ 0x58, {
+    'DeviceQueueEntry' : [ 0x0, ['_KDEVICE_QUEUE_ENTRY']],
+    'DriverContext' : [ 0x0, ['array', 4, ['pointer64', ['void']]]],
+    'Thread' : [ 0x20, ['pointer64', ['_ETHREAD']]],
+    'AuxiliaryBuffer' : [ 0x28, ['pointer64', ['unsigned char']]],
+    'ListEntry' : [ 0x30, ['_LIST_ENTRY']],
+    'CurrentStackLocation' : [ 0x40, ['pointer64', ['_IO_STACK_LOCATION']]],
+    'PacketType' : [ 0x40, ['unsigned long']],
+    'OriginalFileObject' : [ 0x48, ['pointer64', ['_FILE_OBJECT']]],
+    'IrpExtension' : [ 0x50, ['pointer64', ['void']]],
+} ],
+  '__unnamed_1430' : [ 0x58, {
+    'Overlay' : [ 0x0, ['__unnamed_142e']],
+    'Apc' : [ 0x0, ['_KAPC']],
+    'CompletionKey' : [ 0x0, ['pointer64', ['void']]],
+} ],
+  '_IRP' : [ 0xd0, {
+    'Type' : [ 0x0, ['short']],
+    'Size' : [ 0x2, ['unsigned short']],
+    'AllocationProcessorNumber' : [ 0x4, ['unsigned short']],
+    'Reserved' : [ 0x6, ['unsigned short']],
+    'MdlAddress' : [ 0x8, ['pointer64', ['_MDL']]],
+    'Flags' : [ 0x10, ['unsigned long']],
+    'AssociatedIrp' : [ 0x18, ['__unnamed_141d']],
+    'ThreadListEntry' : [ 0x20, ['_LIST_ENTRY']],
+    'IoStatus' : [ 0x30, ['_IO_STATUS_BLOCK']],
+    'RequestorMode' : [ 0x40, ['unsigned char']],
+    'PendingReturned' : [ 0x41, ['unsigned char']],
+    'StackCount' : [ 0x42, ['unsigned char']],
+    'CurrentLocation' : [ 0x43, ['unsigned char']],
+    'Cancel' : [ 0x44, ['unsigned char']],
+    'CancelIrql' : [ 0x45, ['unsigned char']],
+    'ApcEnvironment' : [ 0x46, ['unsigned char']],
+    'AllocationFlags' : [ 0x47, ['unsigned char']],
+    'UserIosb' : [ 0x48, ['pointer64', ['_IO_STATUS_BLOCK']]],
+    'UserEvent' : [ 0x50, ['pointer64', ['_KEVENT']]],
+    'Overlay' : [ 0x58, ['__unnamed_1425']],
+    'CancelRoutine' : [ 0x68, ['pointer64', ['void']]],
+    'UserBuffer' : [ 0x70, ['pointer64', ['void']]],
+    'Tail' : [ 0x78, ['__unnamed_1430']],
+} ],
+  '__unnamed_1437' : [ 0x20, {
+    'SecurityContext' : [ 0x0, ['pointer64', ['_IO_SECURITY_CONTEXT']]],
+    'Options' : [ 0x8, ['unsigned long']],
+    'FileAttributes' : [ 0x10, ['unsigned short']],
+    'ShareAccess' : [ 0x12, ['unsigned short']],
+    'EaLength' : [ 0x18, ['unsigned long']],
+} ],
+  '__unnamed_143b' : [ 0x20, {
+    'SecurityContext' : [ 0x0, ['pointer64', ['_IO_SECURITY_CONTEXT']]],
+    'Options' : [ 0x8, ['unsigned long']],
+    'Reserved' : [ 0x10, ['unsigned short']],
+    'ShareAccess' : [ 0x12, ['unsigned short']],
+    'Parameters' : [ 0x18, ['pointer64', ['_NAMED_PIPE_CREATE_PARAMETERS']]],
+} ],
+  '__unnamed_143f' : [ 0x20, {
+    'SecurityContext' : [ 0x0, ['pointer64', ['_IO_SECURITY_CONTEXT']]],
+    'Options' : [ 0x8, ['unsigned long']],
+    'Reserved' : [ 0x10, ['unsigned short']],
+    'ShareAccess' : [ 0x12, ['unsigned short']],
+    'Parameters' : [ 0x18, ['pointer64', ['_MAILSLOT_CREATE_PARAMETERS']]],
+} ],
+  '__unnamed_1441' : [ 0x18, {
+    'Length' : [ 0x0, ['unsigned long']],
+    'Key' : [ 0x8, ['unsigned long']],
+    'Flags' : [ 0xc, ['unsigned long']],
+    'ByteOffset' : [ 0x10, ['_LARGE_INTEGER']],
+} ],
+  '__unnamed_1445' : [ 0x20, {
+    'Length' : [ 0x0, ['unsigned long']],
+    'FileName' : [ 0x8, ['pointer64', ['_UNICODE_STRING']]],
+    'FileInformationClass' : [ 0x10, ['Enumeration', dict(target = 'long', choices = {1: u'FileDirectoryInformation', 2: u'FileFullDirectoryInformation', 3: u'FileBothDirectoryInformation', 4: u'FileBasicInformation', 5: u'FileStandardInformation', 6: u'FileInternalInformation', 7: u'FileEaInformation', 8: u'FileAccessInformation', 9: u'FileNameInformation', 10: u'FileRenameInformation', 11: u'FileLinkInformation', 12: u'FileNamesInformation', 13: u'FileDispositionInformation', 14: u'FilePositionInformation', 15: u'FileFullEaInformation', 16: u'FileModeInformation', 17: u'FileAlignmentInformation', 18: u'FileAllInformation', 19: u'FileAllocationInformation', 20: u'FileEndOfFileInformation', 21: u'FileAlternateNameInformation', 22: u'FileStreamInformation', 23: u'FilePipeInformation', 24: u'FilePipeLocalInformation', 25: u'FilePipeRemoteInformation', 26: u'FileMailslotQueryInformation', 27: u'FileMailslotSetInformation', 28: u'FileCompressionInformation', 29: u'FileObjectIdInformation', 30: u'FileCompletionInformation', 31: u'FileMoveClusterInformation', 32: u'FileQuotaInformation', 33: u'FileReparsePointInformation', 34: u'FileNetworkOpenInformation', 35: u'FileAttributeTagInformation', 36: u'FileTrackingInformation', 37: u'FileIdBothDirectoryInformation', 38: u'FileIdFullDirectoryInformation', 39: u'FileValidDataLengthInformation', 40: u'FileShortNameInformation', 41: u'FileIoCompletionNotificationInformation', 42: u'FileIoStatusBlockRangeInformation', 43: u'FileIoPriorityHintInformation', 44: u'FileSfioReserveInformation', 45: u'FileSfioVolumeInformation', 46: u'FileHardLinkInformation', 47: u'FileProcessIdsUsingFileInformation', 48: u'FileNormalizedNameInformation', 49: u'FileNetworkPhysicalNameInformation', 50: u'FileIdGlobalTxDirectoryInformation', 51: u'FileIsRemoteDeviceInformation', 52: u'FileUnusedInformation', 53: u'FileNumaNodeInformation', 54: u'FileStandardLinkInformation', 55: u'FileRemoteProtocolInformation', 56: u'FileRenameInformationBypassAccessCheck', 57: u'FileLinkInformationBypassAccessCheck', 58: u'FileVolumeNameInformation', 59: u'FileIdInformation', 60: u'FileIdExtdDirectoryInformation', 61: u'FileReplaceCompletionInformation', 62: u'FileHardLinkFullIdInformation', 63: u'FileIdExtdBothDirectoryInformation', 64: u'FileDispositionInformationEx', 65: u'FileRenameInformationEx', 66: u'FileRenameInformationExBypassAccessCheck', 67: u'FileDesiredStorageClassInformation', 68: u'FileStatInformation', 69: u'FileMemoryPartitionInformation', 70: u'FileStatLxInformation', 71: u'FileCaseSensitiveInformation', 72: u'FileLinkInformationEx', 73: u'FileLinkInformationExBypassAccessCheck', 74: u'FileStorageReserveIdInformation', 75: u'FileCaseSensitiveInformationForceAccessCheck', 76: u'FileMaximumInformation'})]],
+    'FileIndex' : [ 0x18, ['unsigned long']],
+} ],
+  '__unnamed_1447' : [ 0x10, {
+    'Length' : [ 0x0, ['unsigned long']],
+    'CompletionFilter' : [ 0x8, ['unsigned long']],
+} ],
+  '__unnamed_144b' : [ 0x18, {
+    'Length' : [ 0x0, ['unsigned long']],
+    'CompletionFilter' : [ 0x8, ['unsigned long']],
+    'DirectoryNotifyInformationClass' : [ 0x10, ['Enumeration', dict(target = 'long', choices = {1: u'DirectoryNotifyInformation', 2: u'DirectoryNotifyExtendedInformation'})]],
+} ],
+  '__unnamed_144d' : [ 0x10, {
+    'Length' : [ 0x0, ['unsigned long']],
+    'FileInformationClass' : [ 0x8, ['Enumeration', dict(target = 'long', choices = {1: u'FileDirectoryInformation', 2: u'FileFullDirectoryInformation', 3: u'FileBothDirectoryInformation', 4: u'FileBasicInformation', 5: u'FileStandardInformation', 6: u'FileInternalInformation', 7: u'FileEaInformation', 8: u'FileAccessInformation', 9: u'FileNameInformation', 10: u'FileRenameInformation', 11: u'FileLinkInformation', 12: u'FileNamesInformation', 13: u'FileDispositionInformation', 14: u'FilePositionInformation', 15: u'FileFullEaInformation', 16: u'FileModeInformation', 17: u'FileAlignmentInformation', 18: u'FileAllInformation', 19: u'FileAllocationInformation', 20: u'FileEndOfFileInformation', 21: u'FileAlternateNameInformation', 22: u'FileStreamInformation', 23: u'FilePipeInformation', 24: u'FilePipeLocalInformation', 25: u'FilePipeRemoteInformation', 26: u'FileMailslotQueryInformation', 27: u'FileMailslotSetInformation', 28: u'FileCompressionInformation', 29: u'FileObjectIdInformation', 30: u'FileCompletionInformation', 31: u'FileMoveClusterInformation', 32: u'FileQuotaInformation', 33: u'FileReparsePointInformation', 34: u'FileNetworkOpenInformation', 35: u'FileAttributeTagInformation', 36: u'FileTrackingInformation', 37: u'FileIdBothDirectoryInformation', 38: u'FileIdFullDirectoryInformation', 39: u'FileValidDataLengthInformation', 40: u'FileShortNameInformation', 41: u'FileIoCompletionNotificationInformation', 42: u'FileIoStatusBlockRangeInformation', 43: u'FileIoPriorityHintInformation', 44: u'FileSfioReserveInformation', 45: u'FileSfioVolumeInformation', 46: u'FileHardLinkInformation', 47: u'FileProcessIdsUsingFileInformation', 48: u'FileNormalizedNameInformation', 49: u'FileNetworkPhysicalNameInformation', 50: u'FileIdGlobalTxDirectoryInformation', 51: u'FileIsRemoteDeviceInformation', 52: u'FileUnusedInformation', 53: u'FileNumaNodeInformation', 54: u'FileStandardLinkInformation', 55: u'FileRemoteProtocolInformation', 56: u'FileRenameInformationBypassAccessCheck', 57: u'FileLinkInformationBypassAccessCheck', 58: u'FileVolumeNameInformation', 59: u'FileIdInformation', 60: u'FileIdExtdDirectoryInformation', 61: u'FileReplaceCompletionInformation', 62: u'FileHardLinkFullIdInformation', 63: u'FileIdExtdBothDirectoryInformation', 64: u'FileDispositionInformationEx', 65: u'FileRenameInformationEx', 66: u'FileRenameInformationExBypassAccessCheck', 67: u'FileDesiredStorageClassInformation', 68: u'FileStatInformation', 69: u'FileMemoryPartitionInformation', 70: u'FileStatLxInformation', 71: u'FileCaseSensitiveInformation', 72: u'FileLinkInformationEx', 73: u'FileLinkInformationExBypassAccessCheck', 74: u'FileStorageReserveIdInformation', 75: u'FileCaseSensitiveInformationForceAccessCheck', 76: u'FileMaximumInformation'})]],
+} ],
+  '__unnamed_144f' : [ 0x20, {
+    'Length' : [ 0x0, ['unsigned long']],
+    'FileInformationClass' : [ 0x8, ['Enumeration', dict(target = 'long', choices = {1: u'FileDirectoryInformation', 2: u'FileFullDirectoryInformation', 3: u'FileBothDirectoryInformation', 4: u'FileBasicInformation', 5: u'FileStandardInformation', 6: u'FileInternalInformation', 7: u'FileEaInformation', 8: u'FileAccessInformation', 9: u'FileNameInformation', 10: u'FileRenameInformation', 11: u'FileLinkInformation', 12: u'FileNamesInformation', 13: u'FileDispositionInformation', 14: u'FilePositionInformation', 15: u'FileFullEaInformation', 16: u'FileModeInformation', 17: u'FileAlignmentInformation', 18: u'FileAllInformation', 19: u'FileAllocationInformation', 20: u'FileEndOfFileInformation', 21: u'FileAlternateNameInformation', 22: u'FileStreamInformation', 23: u'FilePipeInformation', 24: u'FilePipeLocalInformation', 25: u'FilePipeRemoteInformation', 26: u'FileMailslotQueryInformation', 27: u'FileMailslotSetInformation', 28: u'FileCompressionInformation', 29: u'FileObjectIdInformation', 30: u'FileCompletionInformation', 31: u'FileMoveClusterInformation', 32: u'FileQuotaInformation', 33: u'FileReparsePointInformation', 34: u'FileNetworkOpenInformation', 35: u'FileAttributeTagInformation', 36: u'FileTrackingInformation', 37: u'FileIdBothDirectoryInformation', 38: u'FileIdFullDirectoryInformation', 39: u'FileValidDataLengthInformation', 40: u'FileShortNameInformation', 41: u'FileIoCompletionNotificationInformation', 42: u'FileIoStatusBlockRangeInformation', 43: u'FileIoPriorityHintInformation', 44: u'FileSfioReserveInformation', 45: u'FileSfioVolumeInformation', 46: u'FileHardLinkInformation', 47: u'FileProcessIdsUsingFileInformation', 48: u'FileNormalizedNameInformation', 49: u'FileNetworkPhysicalNameInformation', 50: u'FileIdGlobalTxDirectoryInformation', 51: u'FileIsRemoteDeviceInformation', 52: u'FileUnusedInformation', 53: u'FileNumaNodeInformation', 54: u'FileStandardLinkInformation', 55: u'FileRemoteProtocolInformation', 56: u'FileRenameInformationBypassAccessCheck', 57: u'FileLinkInformationBypassAccessCheck', 58: u'FileVolumeNameInformation', 59: u'FileIdInformation', 60: u'FileIdExtdDirectoryInformation', 61: u'FileReplaceCompletionInformation', 62: u'FileHardLinkFullIdInformation', 63: u'FileIdExtdBothDirectoryInformation', 64: u'FileDispositionInformationEx', 65: u'FileRenameInformationEx', 66: u'FileRenameInformationExBypassAccessCheck', 67: u'FileDesiredStorageClassInformation', 68: u'FileStatInformation', 69: u'FileMemoryPartitionInformation', 70: u'FileStatLxInformation', 71: u'FileCaseSensitiveInformation', 72: u'FileLinkInformationEx', 73: u'FileLinkInformationExBypassAccessCheck', 74: u'FileStorageReserveIdInformation', 75: u'FileCaseSensitiveInformationForceAccessCheck', 76: u'FileMaximumInformation'})]],
+    'FileObject' : [ 0x10, ['pointer64', ['_FILE_OBJECT']]],
+    'ReplaceIfExists' : [ 0x18, ['unsigned char']],
+    'AdvanceOnly' : [ 0x19, ['unsigned char']],
+    'ClusterCount' : [ 0x18, ['unsigned long']],
+    'DeleteHandle' : [ 0x18, ['pointer64', ['void']]],
+} ],
+  '__unnamed_1451' : [ 0x20, {
+    'Length' : [ 0x0, ['unsigned long']],
+    'EaList' : [ 0x8, ['pointer64', ['void']]],
+    'EaListLength' : [ 0x10, ['unsigned long']],
+    'EaIndex' : [ 0x18, ['unsigned long']],
+} ],
+  '__unnamed_1453' : [ 0x4, {
+    'Length' : [ 0x0, ['unsigned long']],
+} ],
+  '__unnamed_1457' : [ 0x10, {
+    'Length' : [ 0x0, ['unsigned long']],
+    'FsInformationClass' : [ 0x8, ['Enumeration', dict(target = 'long', choices = {1: u'FileFsVolumeInformation', 2: u'FileFsLabelInformation', 3: u'FileFsSizeInformation', 4: u'FileFsDeviceInformation', 5: u'FileFsAttributeInformation', 6: u'FileFsControlInformation', 7: u'FileFsFullSizeInformation', 8: u'FileFsObjectIdInformation', 9: u'FileFsDriverPathInformation', 10: u'FileFsVolumeFlagsInformation', 11: u'FileFsSectorSizeInformation', 12: u'FileFsDataCopyInformation', 13: u'FileFsMetadataSizeInformation', 14: u'FileFsFullSizeInformationEx', 15: u'FileFsMaximumInformation'})]],
+} ],
+  '__unnamed_1459' : [ 0x20, {
+    'OutputBufferLength' : [ 0x0, ['unsigned long']],
+    'InputBufferLength' : [ 0x8, ['unsigned long']],
+    'FsControlCode' : [ 0x10, ['unsigned long']],
+    'Type3InputBuffer' : [ 0x18, ['pointer64', ['void']]],
+} ],
+  '__unnamed_145b' : [ 0x18, {
+    'Length' : [ 0x0, ['pointer64', ['_LARGE_INTEGER']]],
+    'Key' : [ 0x8, ['unsigned long']],
+    'ByteOffset' : [ 0x10, ['_LARGE_INTEGER']],
+} ],
+  '__unnamed_145d' : [ 0x20, {
+    'OutputBufferLength' : [ 0x0, ['unsigned long']],
+    'InputBufferLength' : [ 0x8, ['unsigned long']],
+    'IoControlCode' : [ 0x10, ['unsigned long']],
+    'Type3InputBuffer' : [ 0x18, ['pointer64', ['void']]],
+} ],
+  '__unnamed_145f' : [ 0x10, {
+    'SecurityInformation' : [ 0x0, ['unsigned long']],
+    'Length' : [ 0x8, ['unsigned long']],
+} ],
+  '__unnamed_1461' : [ 0x10, {
+    'SecurityInformation' : [ 0x0, ['unsigned long']],
+    'SecurityDescriptor' : [ 0x8, ['pointer64', ['void']]],
+} ],
+  '__unnamed_1465' : [ 0x10, {
+    'Vpb' : [ 0x0, ['pointer64', ['_VPB']]],
+    'DeviceObject' : [ 0x8, ['pointer64', ['_DEVICE_OBJECT']]],
+} ],
+  '__unnamed_1469' : [ 0x8, {
+    'Srb' : [ 0x0, ['pointer64', ['_SCSI_REQUEST_BLOCK']]],
+} ],
+  '__unnamed_146d' : [ 0x20, {
+    'Length' : [ 0x0, ['unsigned long']],
+    'StartSid' : [ 0x8, ['pointer64', ['void']]],
+    'SidList' : [ 0x10, ['pointer64', ['_FILE_GET_QUOTA_INFORMATION']]],
+    'SidListLength' : [ 0x18, ['unsigned long']],
+} ],
+  '__unnamed_1471' : [ 0x4, {
+    'Type' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: u'BusRelations', 1: u'EjectionRelations', 2: u'PowerRelations', 3: u'RemovalRelations', 4: u'TargetDeviceRelation', 5: u'SingleBusRelations', 6: u'TransportRelations'})]],
+} ],
+  '__unnamed_1475' : [ 0x20, {
+    'InterfaceType' : [ 0x0, ['pointer64', ['_GUID']]],
+    'Size' : [ 0x8, ['unsigned short']],
+    'Version' : [ 0xa, ['unsigned short']],
+    'Interface' : [ 0x10, ['pointer64', ['_INTERFACE']]],
+    'InterfaceSpecificData' : [ 0x18, ['pointer64', ['void']]],
+} ],
+  '__unnamed_1479' : [ 0x8, {
+    'Capabilities' : [ 0x0, ['pointer64', ['_DEVICE_CAPABILITIES']]],
+} ],
+  '__unnamed_147d' : [ 0x8, {
+    'IoResourceRequirementList' : [ 0x0, ['pointer64', ['_IO_RESOURCE_REQUIREMENTS_LIST']]],
+} ],
+  '__unnamed_147f' : [ 0x20, {
+    'WhichSpace' : [ 0x0, ['unsigned long']],
+    'Buffer' : [ 0x8, ['pointer64', ['void']]],
+    'Offset' : [ 0x10, ['unsigned long']],
+    'Length' : [ 0x18, ['unsigned long']],
+} ],
+  '__unnamed_1481' : [ 0x1, {
+    'Lock' : [ 0x0, ['unsigned char']],
+} ],
+  '__unnamed_1485' : [ 0x4, {
+    'IdType' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: u'BusQueryDeviceID', 1: u'BusQueryHardwareIDs', 2: u'BusQueryCompatibleIDs', 3: u'BusQueryInstanceID', 4: u'BusQueryDeviceSerialNumber', 5: u'BusQueryContainerID'})]],
+} ],
+  '__unnamed_1489' : [ 0x10, {
+    'DeviceTextType' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: u'DeviceTextDescription', 1: u'DeviceTextLocationInformation'})]],
+    'LocaleId' : [ 0x8, ['unsigned long']],
+} ],
+  '__unnamed_148d' : [ 0x10, {
+    'InPath' : [ 0x0, ['unsigned char']],
+    'Reserved' : [ 0x1, ['array', 3, ['unsigned char']]],
+    'Type' : [ 0x8, ['Enumeration', dict(target = 'long', choices = {0: u'DeviceUsageTypeUndefined', 1: u'DeviceUsageTypePaging', 2: u'DeviceUsageTypeHibernation', 3: u'DeviceUsageTypeDumpFile', 4: u'DeviceUsageTypeBoot', 5: u'DeviceUsageTypePostDisplay', 6: u'DeviceUsageTypeGuestAssigned'})]],
+} ],
+  '__unnamed_1491' : [ 0x4, {
+    'PowerState' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: u'PowerSystemUnspecified', 1: u'PowerSystemWorking', 2: u'PowerSystemSleeping1', 3: u'PowerSystemSleeping2', 4: u'PowerSystemSleeping3', 5: u'PowerSystemHibernate', 6: u'PowerSystemShutdown', 7: u'PowerSystemMaximum'})]],
+} ],
+  '__unnamed_1495' : [ 0x8, {
+    'PowerSequence' : [ 0x0, ['pointer64', ['_POWER_SEQUENCE']]],
+} ],
+  '__unnamed_149d' : [ 0x20, {
+    'SystemContext' : [ 0x0, ['unsigned long']],
+    'SystemPowerStateContext' : [ 0x0, ['_SYSTEM_POWER_STATE_CONTEXT']],
+    'Type' : [ 0x8, ['Enumeration', dict(target = 'long', choices = {0: u'SystemPowerState', 1: u'DevicePowerState'})]],
+    'State' : [ 0x10, ['_POWER_STATE']],
+    'ShutdownType' : [ 0x18, ['Enumeration', dict(target = 'long', choices = {0: u'PowerActionNone', 1: u'PowerActionReserved', 2: u'PowerActionSleep', 3: u'PowerActionHibernate', 4: u'PowerActionShutdown', 5: u'PowerActionShutdownReset', 6: u'PowerActionShutdownOff', 7: u'PowerActionWarmEject', 8: u'PowerActionDisplayOff'})]],
+} ],
+  '__unnamed_14a1' : [ 0x10, {
+    'AllocatedResources' : [ 0x0, ['pointer64', ['_CM_RESOURCE_LIST']]],
+    'AllocatedResourcesTranslated' : [ 0x8, ['pointer64', ['_CM_RESOURCE_LIST']]],
+} ],
+  '__unnamed_14a3' : [ 0x20, {
+    'ProviderId' : [ 0x0, ['unsigned long long']],
+    'DataPath' : [ 0x8, ['pointer64', ['void']]],
+    'BufferSize' : [ 0x10, ['unsigned long']],
+    'Buffer' : [ 0x18, ['pointer64', ['void']]],
+} ],
+  '__unnamed_14a5' : [ 0x20, {
+    'Argument1' : [ 0x0, ['pointer64', ['void']]],
+    'Argument2' : [ 0x8, ['pointer64', ['void']]],
+    'Argument3' : [ 0x10, ['pointer64', ['void']]],
+    'Argument4' : [ 0x18, ['pointer64', ['void']]],
+} ],
+  '__unnamed_14a7' : [ 0x20, {
+    'Create' : [ 0x0, ['__unnamed_1437']],
+    'CreatePipe' : [ 0x0, ['__unnamed_143b']],
+    'CreateMailslot' : [ 0x0, ['__unnamed_143f']],
+    'Read' : [ 0x0, ['__unnamed_1441']],
+    'Write' : [ 0x0, ['__unnamed_1441']],
+    'QueryDirectory' : [ 0x0, ['__unnamed_1445']],
+    'NotifyDirectory' : [ 0x0, ['__unnamed_1447']],
+    'NotifyDirectoryEx' : [ 0x0, ['__unnamed_144b']],
+    'QueryFile' : [ 0x0, ['__unnamed_144d']],
+    'SetFile' : [ 0x0, ['__unnamed_144f']],
+    'QueryEa' : [ 0x0, ['__unnamed_1451']],
+    'SetEa' : [ 0x0, ['__unnamed_1453']],
+    'QueryVolume' : [ 0x0, ['__unnamed_1457']],
+    'SetVolume' : [ 0x0, ['__unnamed_1457']],
+    'FileSystemControl' : [ 0x0, ['__unnamed_1459']],
+    'LockControl' : [ 0x0, ['__unnamed_145b']],
+    'DeviceIoControl' : [ 0x0, ['__unnamed_145d']],
+    'QuerySecurity' : [ 0x0, ['__unnamed_145f']],
+    'SetSecurity' : [ 0x0, ['__unnamed_1461']],
+    'MountVolume' : [ 0x0, ['__unnamed_1465']],
+    'VerifyVolume' : [ 0x0, ['__unnamed_1465']],
+    'Scsi' : [ 0x0, ['__unnamed_1469']],
+    'QueryQuota' : [ 0x0, ['__unnamed_146d']],
+    'SetQuota' : [ 0x0, ['__unnamed_1453']],
+    'QueryDeviceRelations' : [ 0x0, ['__unnamed_1471']],
+    'QueryInterface' : [ 0x0, ['__unnamed_1475']],
+    'DeviceCapabilities' : [ 0x0, ['__unnamed_1479']],
+    'FilterResourceRequirements' : [ 0x0, ['__unnamed_147d']],
+    'ReadWriteConfig' : [ 0x0, ['__unnamed_147f']],
+    'SetLock' : [ 0x0, ['__unnamed_1481']],
+    'QueryId' : [ 0x0, ['__unnamed_1485']],
+    'QueryDeviceText' : [ 0x0, ['__unnamed_1489']],
+    'UsageNotification' : [ 0x0, ['__unnamed_148d']],
+    'WaitWake' : [ 0x0, ['__unnamed_1491']],
+    'PowerSequence' : [ 0x0, ['__unnamed_1495']],
+    'Power' : [ 0x0, ['__unnamed_149d']],
+    'StartDevice' : [ 0x0, ['__unnamed_14a1']],
+    'WMI' : [ 0x0, ['__unnamed_14a3']],
+    'Others' : [ 0x0, ['__unnamed_14a5']],
+} ],
+  '_IO_STACK_LOCATION' : [ 0x48, {
+    'MajorFunction' : [ 0x0, ['unsigned char']],
+    'MinorFunction' : [ 0x1, ['unsigned char']],
+    'Flags' : [ 0x2, ['unsigned char']],
+    'Control' : [ 0x3, ['unsigned char']],
+    'Parameters' : [ 0x8, ['__unnamed_14a7']],
+    'DeviceObject' : [ 0x28, ['pointer64', ['_DEVICE_OBJECT']]],
+    'FileObject' : [ 0x30, ['pointer64', ['_FILE_OBJECT']]],
+    'CompletionRoutine' : [ 0x38, ['pointer64', ['void']]],
+    'Context' : [ 0x40, ['pointer64', ['void']]],
+} ],
+  '__unnamed_14bd' : [ 0x48, {
+    'ListEntry' : [ 0x0, ['_LIST_ENTRY']],
+    'Wcb' : [ 0x0, ['_WAIT_CONTEXT_BLOCK']],
+} ],
+  '_DEVICE_OBJECT' : [ 0x150, {
+    'Type' : [ 0x0, ['short']],
+    'Size' : [ 0x2, ['unsigned short']],
+    'ReferenceCount' : [ 0x4, ['long']],
+    'DriverObject' : [ 0x8, ['pointer64', ['_DRIVER_OBJECT']]],
+    'NextDevice' : [ 0x10, ['pointer64', ['_DEVICE_OBJECT']]],
+    'AttachedDevice' : [ 0x18, ['pointer64', ['_DEVICE_OBJECT']]],
+    'CurrentIrp' : [ 0x20, ['pointer64', ['_IRP']]],
+    'Timer' : [ 0x28, ['pointer64', ['_IO_TIMER']]],
+    'Flags' : [ 0x30, ['unsigned long']],
+    'Characteristics' : [ 0x34, ['unsigned long']],
+    'Vpb' : [ 0x38, ['pointer64', ['_VPB']]],
+    'DeviceExtension' : [ 0x40, ['pointer64', ['void']]],
+    'DeviceType' : [ 0x48, ['unsigned long']],
+    'StackSize' : [ 0x4c, ['unsigned char']],
+    'Queue' : [ 0x50, ['__unnamed_14bd']],
+    'AlignmentRequirement' : [ 0x98, ['unsigned long']],
+    'DeviceQueue' : [ 0xa0, ['_KDEVICE_QUEUE']],
+    'Dpc' : [ 0xc8, ['_KDPC']],
+    'ActiveThreadCount' : [ 0x108, ['unsigned long']],
+    'SecurityDescriptor' : [ 0x110, ['pointer64', ['void']]],
+    'DeviceLock' : [ 0x118, ['_KEVENT']],
+    'SectorSize' : [ 0x130, ['unsigned short']],
+    'Spare1' : [ 0x132, ['unsigned short']],
+    'DeviceObjectExtension' : [ 0x138, ['pointer64', ['_DEVOBJ_EXTENSION']]],
+    'Reserved' : [ 0x140, ['pointer64', ['void']]],
+} ],
+  '_KDPC' : [ 0x40, {
+    'TargetInfoAsUlong' : [ 0x0, ['unsigned long']],
+    'Type' : [ 0x0, ['unsigned char']],
+    'Importance' : [ 0x1, ['unsigned char']],
+    'Number' : [ 0x2, ['unsigned short']],
+    'DpcListEntry' : [ 0x8, ['_SINGLE_LIST_ENTRY']],
+    'ProcessorHistory' : [ 0x10, ['unsigned long long']],
+    'DeferredRoutine' : [ 0x18, ['pointer64', ['void']]],
+    'DeferredContext' : [ 0x20, ['pointer64', ['void']]],
+    'SystemArgument1' : [ 0x28, ['pointer64', ['void']]],
+    'SystemArgument2' : [ 0x30, ['pointer64', ['void']]],
+    'DpcData' : [ 0x38, ['pointer64', ['void']]],
+} ],
+  '_IO_DRIVER_CREATE_CONTEXT' : [ 0x28, {
+    'Size' : [ 0x0, ['short']],
+    'ExtraCreateParameter' : [ 0x8, ['pointer64', ['_ECP_LIST']]],
+    'DeviceObjectHint' : [ 0x10, ['pointer64', ['void']]],
+    'TxnParameters' : [ 0x18, ['pointer64', ['_TXN_PARAMETER_BLOCK']]],
+    'SiloContext' : [ 0x20, ['pointer64', ['_EJOB']]],
+} ],
+  '_EJOB' : [ 0x620, {
+    'Event' : [ 0x0, ['_KEVENT']],
+    'JobLinks' : [ 0x18, ['_LIST_ENTRY']],
+    'ProcessListHead' : [ 0x28, ['_LIST_ENTRY']],
+    'JobLock' : [ 0x38, ['_ERESOURCE']],
+    'TotalUserTime' : [ 0xa0, ['_LARGE_INTEGER']],
+    'TotalKernelTime' : [ 0xa8, ['_LARGE_INTEGER']],
+    'TotalCycleTime' : [ 0xb0, ['_LARGE_INTEGER']],
+    'ThisPeriodTotalUserTime' : [ 0xb8, ['_LARGE_INTEGER']],
+    'ThisPeriodTotalKernelTime' : [ 0xc0, ['_LARGE_INTEGER']],
+    'TotalContextSwitches' : [ 0xc8, ['unsigned long long']],
+    'TotalPageFaultCount' : [ 0xd0, ['unsigned long']],
+    'TotalProcesses' : [ 0xd4, ['unsigned long']],
+    'ActiveProcesses' : [ 0xd8, ['unsigned long']],
+    'TotalTerminatedProcesses' : [ 0xdc, ['unsigned long']],
+    'PerProcessUserTimeLimit' : [ 0xe0, ['_LARGE_INTEGER']],
+    'PerJobUserTimeLimit' : [ 0xe8, ['_LARGE_INTEGER']],
+    'MinimumWorkingSetSize' : [ 0xf0, ['unsigned long long']],
+    'MaximumWorkingSetSize' : [ 0xf8, ['unsigned long long']],
+    'LimitFlags' : [ 0x100, ['unsigned long']],
+    'ActiveProcessLimit' : [ 0x104, ['unsigned long']],
+    'Affinity' : [ 0x108, ['_KAFFINITY_EX']],
+    'AccessState' : [ 0x1b0, ['pointer64', ['_JOB_ACCESS_STATE']]],
+    'AccessStateQuotaReference' : [ 0x1b8, ['pointer64', ['void']]],
+    'UIRestrictionsClass' : [ 0x1c0, ['unsigned long']],
+    'EndOfJobTimeAction' : [ 0x1c4, ['unsigned long']],
+    'CompletionPort' : [ 0x1c8, ['pointer64', ['void']]],
+    'CompletionKey' : [ 0x1d0, ['pointer64', ['void']]],
+    'CompletionCount' : [ 0x1d8, ['unsigned long long']],
+    'SessionId' : [ 0x1e0, ['unsigned long']],
+    'SchedulingClass' : [ 0x1e4, ['unsigned long']],
+    'ReadOperationCount' : [ 0x1e8, ['unsigned long long']],
+    'WriteOperationCount' : [ 0x1f0, ['unsigned long long']],
+    'OtherOperationCount' : [ 0x1f8, ['unsigned long long']],
+    'ReadTransferCount' : [ 0x200, ['unsigned long long']],
+    'WriteTransferCount' : [ 0x208, ['unsigned long long']],
+    'OtherTransferCount' : [ 0x210, ['unsigned long long']],
+    'DiskIoInfo' : [ 0x218, ['_PROCESS_DISK_COUNTERS']],
+    'ProcessMemoryLimit' : [ 0x240, ['unsigned long long']],
+    'JobMemoryLimit' : [ 0x248, ['unsigned long long']],
+    'JobTotalMemoryLimit' : [ 0x250, ['unsigned long long']],
+    'PeakProcessMemoryUsed' : [ 0x258, ['unsigned long long']],
+    'PeakJobMemoryUsed' : [ 0x260, ['unsigned long long']],
+    'EffectiveAffinity' : [ 0x268, ['_KAFFINITY_EX']],
+    'EffectivePerProcessUserTimeLimit' : [ 0x310, ['_LARGE_INTEGER']],
+    'EffectiveMinimumWorkingSetSize' : [ 0x318, ['unsigned long long']],
+    'EffectiveMaximumWorkingSetSize' : [ 0x320, ['unsigned long long']],
+    'EffectiveProcessMemoryLimit' : [ 0x328, ['unsigned long long']],
+    'EffectiveProcessMemoryLimitJob' : [ 0x330, ['pointer64', ['_EJOB']]],
+    'EffectivePerProcessUserTimeLimitJob' : [ 0x338, ['pointer64', ['_EJOB']]],
+    'EffectiveNetIoRateLimitJob' : [ 0x340, ['pointer64', ['_EJOB']]],
+    'EffectiveHeapAttributionJob' : [ 0x348, ['pointer64', ['_EJOB']]],
+    'EffectiveLimitFlags' : [ 0x350, ['unsigned long']],
+    'EffectiveSchedulingClass' : [ 0x354, ['unsigned long']],
+    'EffectiveFreezeCount' : [ 0x358, ['unsigned long']],
+    'EffectiveBackgroundCount' : [ 0x35c, ['unsigned long']],
+    'EffectiveSwapCount' : [ 0x360, ['unsigned long']],
+    'EffectiveNotificationLimitCount' : [ 0x364, ['unsigned long']],
+    'EffectivePriorityClass' : [ 0x368, ['unsigned char']],
+    'PriorityClass' : [ 0x369, ['unsigned char']],
+    'NestingDepth' : [ 0x36a, ['unsigned char']],
+    'Reserved1' : [ 0x36b, ['array', 1, ['unsigned char']]],
+    'CompletionFilter' : [ 0x36c, ['unsigned long']],
+    'WakeChannel' : [ 0x370, ['_WNF_STATE_NAME']],
+    'WakeInfo' : [ 0x370, ['_PS_JOB_WAKE_INFORMATION']],
+    'WakeFilter' : [ 0x3b8, ['_JOBOBJECT_WAKE_FILTER']],
+    'LowEdgeLatchFilter' : [ 0x3c0, ['unsigned long']],
+    'NotificationLink' : [ 0x3c8, ['pointer64', ['_EJOB']]],
+    'CurrentJobMemoryUsed' : [ 0x3d0, ['unsigned long long']],
+    'NotificationInfo' : [ 0x3d8, ['pointer64', ['_JOB_NOTIFICATION_INFORMATION']]],
+    'NotificationInfoQuotaReference' : [ 0x3e0, ['pointer64', ['void']]],
+    'NotificationPacket' : [ 0x3e8, ['pointer64', ['_IO_MINI_COMPLETION_PACKET_USER']]],
+    'CpuRateControl' : [ 0x3f0, ['pointer64', ['_JOB_CPU_RATE_CONTROL']]],
+    'EffectiveSchedulingGroup' : [ 0x3f8, ['pointer64', ['void']]],
+    'ReadyTime' : [ 0x400, ['unsigned long long']],
+    'MemoryLimitsLock' : [ 0x408, ['_EX_PUSH_LOCK']],
+    'SiblingJobLinks' : [ 0x410, ['_LIST_ENTRY']],
+    'ChildJobListHead' : [ 0x420, ['_LIST_ENTRY']],
+    'ParentJob' : [ 0x430, ['pointer64', ['_EJOB']]],
+    'RootJob' : [ 0x438, ['pointer64', ['_EJOB']]],
+    'IteratorListHead' : [ 0x440, ['_LIST_ENTRY']],
+    'AncestorCount' : [ 0x450, ['unsigned long long']],
+    'Ancestors' : [ 0x458, ['pointer64', ['pointer64', ['_EJOB']]]],
+    'SessionObject' : [ 0x458, ['pointer64', ['void']]],
+    'Accounting' : [ 0x460, ['_EPROCESS_VALUES']],
+    'ShadowActiveProcessCount' : [ 0x4b8, ['unsigned long']],
+    'ActiveAuxiliaryProcessCount' : [ 0x4bc, ['unsigned long']],
+    'SequenceNumber' : [ 0x4c0, ['unsigned long']],
+    'JobId' : [ 0x4c4, ['unsigned long']],
+    'ContainerId' : [ 0x4c8, ['_GUID']],
+    'ContainerTelemetryId' : [ 0x4d8, ['_GUID']],
+    'ServerSiloGlobals' : [ 0x4e8, ['pointer64', ['_ESERVERSILO_GLOBALS']]],
+    'PropertySet' : [ 0x4f0, ['_PS_PROPERTY_SET']],
+    'Storage' : [ 0x508, ['pointer64', ['_PSP_STORAGE']]],
+    'NetRateControl' : [ 0x510, ['pointer64', ['_JOB_NET_RATE_CONTROL']]],
+    'JobFlags' : [ 0x518, ['unsigned long']],
+    'CloseDone' : [ 0x518, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
+    'MultiGroup' : [ 0x518, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
+    'OutstandingNotification' : [ 0x518, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
+    'NotificationInProgress' : [ 0x518, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
+    'UILimits' : [ 0x518, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
+    'CpuRateControlActive' : [ 0x518, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
+    'OwnCpuRateControl' : [ 0x518, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
+    'Terminating' : [ 0x518, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
+    'WorkingSetLock' : [ 0x518, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long')]],
+    'JobFrozen' : [ 0x518, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long')]],
+    'Background' : [ 0x518, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned long')]],
+    'WakeNotificationAllocated' : [ 0x518, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned long')]],
+    'WakeNotificationEnabled' : [ 0x518, ['BitField', dict(start_bit = 12, end_bit = 13, native_type='unsigned long')]],
+    'WakeNotificationPending' : [ 0x518, ['BitField', dict(start_bit = 13, end_bit = 14, native_type='unsigned long')]],
+    'LimitNotificationRequired' : [ 0x518, ['BitField', dict(start_bit = 14, end_bit = 15, native_type='unsigned long')]],
+    'ZeroCountNotificationRequired' : [ 0x518, ['BitField', dict(start_bit = 15, end_bit = 16, native_type='unsigned long')]],
+    'CycleTimeNotificationRequired' : [ 0x518, ['BitField', dict(start_bit = 16, end_bit = 17, native_type='unsigned long')]],
+    'CycleTimeNotificationPending' : [ 0x518, ['BitField', dict(start_bit = 17, end_bit = 18, native_type='unsigned long')]],
+    'TimersVirtualized' : [ 0x518, ['BitField', dict(start_bit = 18, end_bit = 19, native_type='unsigned long')]],
+    'JobSwapped' : [ 0x518, ['BitField', dict(start_bit = 19, end_bit = 20, native_type='unsigned long')]],
+    'ViolationDetected' : [ 0x518, ['BitField', dict(start_bit = 20, end_bit = 21, native_type='unsigned long')]],
+    'EmptyJobNotified' : [ 0x518, ['BitField', dict(start_bit = 21, end_bit = 22, native_type='unsigned long')]],
+    'NoSystemCharge' : [ 0x518, ['BitField', dict(start_bit = 22, end_bit = 23, native_type='unsigned long')]],
+    'DropNoWakeCharges' : [ 0x518, ['BitField', dict(start_bit = 23, end_bit = 24, native_type='unsigned long')]],
+    'NoWakeChargePolicyDecided' : [ 0x518, ['BitField', dict(start_bit = 24, end_bit = 25, native_type='unsigned long')]],
+    'NetRateControlActive' : [ 0x518, ['BitField', dict(start_bit = 25, end_bit = 26, native_type='unsigned long')]],
+    'OwnNetRateControl' : [ 0x518, ['BitField', dict(start_bit = 26, end_bit = 27, native_type='unsigned long')]],
+    'IoRateControlActive' : [ 0x518, ['BitField', dict(start_bit = 27, end_bit = 28, native_type='unsigned long')]],
+    'OwnIoRateControl' : [ 0x518, ['BitField', dict(start_bit = 28, end_bit = 29, native_type='unsigned long')]],
+    'DisallowNewProcesses' : [ 0x518, ['BitField', dict(start_bit = 29, end_bit = 30, native_type='unsigned long')]],
+    'Silo' : [ 0x518, ['BitField', dict(start_bit = 30, end_bit = 31, native_type='unsigned long')]],
+    'ContainerTelemetryIdSet' : [ 0x518, ['BitField', dict(start_bit = 31, end_bit = 32, native_type='unsigned long')]],
+    'JobFlags2' : [ 0x51c, ['unsigned long']],
+    'ParentLocked' : [ 0x51c, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
+    'EnableUsermodeSiloThreadImpersonation' : [ 0x51c, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
+    'DisallowUsermodeSiloThreadImpersonation' : [ 0x51c, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
+    'EnergyValues' : [ 0x520, ['pointer64', ['_PROCESS_EXTENDED_ENERGY_VALUES']]],
+    'SharedCommitCharge' : [ 0x528, ['unsigned long long']],
+    'DiskIoAttributionUserRefCount' : [ 0x530, ['unsigned long']],
+    'DiskIoAttributionRefCount' : [ 0x534, ['unsigned long']],
+    'DiskIoAttributionContext' : [ 0x538, ['pointer64', ['void']]],
+    'DiskIoAttributionOwnerJob' : [ 0x538, ['pointer64', ['_EJOB']]],
+    'IoRateControlHeader' : [ 0x540, ['_JOB_RATE_CONTROL_HEADER']],
+    'GlobalIoControl' : [ 0x568, ['_PS_IO_CONTROL_ENTRY']],
+    'IoControlStateLock' : [ 0x5a0, ['long']],
+    'VolumeIoControlTree' : [ 0x5a8, ['_RTL_RB_TREE']],
+    'IoRateOverQuotaHistory' : [ 0x5b8, ['unsigned long long']],
+    'IoRateCurrentGeneration' : [ 0x5c0, ['unsigned long']],
+    'IoRateLastQueryGeneration' : [ 0x5c4, ['unsigned long']],
+    'IoRateGenerationLength' : [ 0x5c8, ['unsigned long']],
+    'IoRateOverQuotaNotifySequenceId' : [ 0x5cc, ['unsigned long']],
+    'LastThrottledIoTime' : [ 0x5d0, ['unsigned long long']],
+    'IoControlLock' : [ 0x5d8, ['_EX_PUSH_LOCK']],
+    'SiloHardReferenceCount' : [ 0x5e0, ['unsigned long long']],
+    'RundownWorkItem' : [ 0x5e8, ['_WORK_QUEUE_ITEM']],
+    'PartitionObject' : [ 0x608, ['pointer64', ['void']]],
+    'PartitionOwnerJob' : [ 0x610, ['pointer64', ['_EJOB']]],
+    'EnergyTrackingState' : [ 0x618, ['_JOBOBJECT_ENERGY_TRACKING_STATE']],
+} ],
+  '_IO_PRIORITY_INFO' : [ 0x10, {
+    'Size' : [ 0x0, ['unsigned long']],
+    'ThreadPriority' : [ 0x4, ['unsigned long']],
+    'PagePriority' : [ 0x8, ['unsigned long']],
+    'IoPriority' : [ 0xc, ['Enumeration', dict(target = 'long', choices = {0: u'IoPriorityVeryLow', 1: u'IoPriorityLow', 2: u'IoPriorityNormal', 3: u'IoPriorityHigh', 4: u'IoPriorityCritical', 5: u'MaxIoPriorityTypes'})]],
+} ],
+  '_MDL' : [ 0x30, {
+    'Next' : [ 0x0, ['pointer64', ['_MDL']]],
+    'Size' : [ 0x8, ['short']],
+    'MdlFlags' : [ 0xa, ['short']],
+    'AllocationProcessorNumber' : [ 0xc, ['unsigned short']],
+    'Reserved' : [ 0xe, ['unsigned short']],
+    'Process' : [ 0x10, ['pointer64', ['_EPROCESS']]],
+    'MappedSystemVa' : [ 0x18, ['pointer64', ['void']]],
+    'StartVa' : [ 0x20, ['pointer64', ['void']]],
+    'ByteCount' : [ 0x28, ['unsigned long']],
+    'ByteOffset' : [ 0x2c, ['unsigned long']],
+} ],
+  '_EVENT_DATA_DESCRIPTOR' : [ 0x10, {
+    'Ptr' : [ 0x0, ['unsigned long long']],
+    'Size' : [ 0x8, ['unsigned long']],
+    'Reserved' : [ 0xc, ['unsigned long']],
+    'Type' : [ 0xc, ['unsigned char']],
+    'Reserved1' : [ 0xd, ['unsigned char']],
+    'Reserved2' : [ 0xe, ['unsigned short']],
+} ],
+  '_EVENT_DESCRIPTOR' : [ 0x10, {
+    'Id' : [ 0x0, ['unsigned short']],
+    'Version' : [ 0x2, ['unsigned char']],
+    'Channel' : [ 0x3, ['unsigned char']],
+    'Level' : [ 0x4, ['unsigned char']],
+    'Opcode' : [ 0x5, ['unsigned char']],
+    'Task' : [ 0x6, ['unsigned short']],
+    'Keyword' : [ 0x8, ['unsigned long long']],
+} ],
+  '_EVENT_RECORD' : [ 0x70, {
+    'EventHeader' : [ 0x0, ['_EVENT_HEADER']],
+    'BufferContext' : [ 0x50, ['_ETW_BUFFER_CONTEXT']],
+    'ExtendedDataCount' : [ 0x54, ['unsigned short']],
+    'UserDataLength' : [ 0x56, ['unsigned short']],
+    'ExtendedData' : [ 0x58, ['pointer64', ['_EVENT_HEADER_EXTENDED_DATA_ITEM']]],
+    'UserData' : [ 0x60, ['pointer64', ['void']]],
+    'UserContext' : [ 0x68, ['pointer64', ['void']]],
+} ],
+  '_PERFINFO_GROUPMASK' : [ 0x20, {
+    'Masks' : [ 0x0, ['array', 8, ['unsigned long']]],
+} ],
+  '_FILE_OBJECT' : [ 0xd8, {
+    'Type' : [ 0x0, ['short']],
+    'Size' : [ 0x2, ['short']],
+    'DeviceObject' : [ 0x8, ['pointer64', ['_DEVICE_OBJECT']]],
+    'Vpb' : [ 0x10, ['pointer64', ['_VPB']]],
+    'FsContext' : [ 0x18, ['pointer64', ['void']]],
+    'FsContext2' : [ 0x20, ['pointer64', ['void']]],
+    'SectionObjectPointer' : [ 0x28, ['pointer64', ['_SECTION_OBJECT_POINTERS']]],
+    'PrivateCacheMap' : [ 0x30, ['pointer64', ['void']]],
+    'FinalStatus' : [ 0x38, ['long']],
+    'RelatedFileObject' : [ 0x40, ['pointer64', ['_FILE_OBJECT']]],
+    'LockOperation' : [ 0x48, ['unsigned char']],
+    'DeletePending' : [ 0x49, ['unsigned char']],
+    'ReadAccess' : [ 0x4a, ['unsigned char']],
+    'WriteAccess' : [ 0x4b, ['unsigned char']],
+    'DeleteAccess' : [ 0x4c, ['unsigned char']],
+    'SharedRead' : [ 0x4d, ['unsigned char']],
+    'SharedWrite' : [ 0x4e, ['unsigned char']],
+    'SharedDelete' : [ 0x4f, ['unsigned char']],
+    'Flags' : [ 0x50, ['unsigned long']],
+    'FileName' : [ 0x58, ['_UNICODE_STRING']],
+    'CurrentByteOffset' : [ 0x68, ['_LARGE_INTEGER']],
+    'Waiters' : [ 0x70, ['unsigned long']],
+    'Busy' : [ 0x74, ['unsigned long']],
+    'LastLock' : [ 0x78, ['pointer64', ['void']]],
+    'Lock' : [ 0x80, ['_KEVENT']],
+    'Event' : [ 0x98, ['_KEVENT']],
+    'CompletionContext' : [ 0xb0, ['pointer64', ['_IO_COMPLETION_CONTEXT']]],
+    'IrpListLock' : [ 0xb8, ['unsigned long long']],
+    'IrpList' : [ 0xc0, ['_LIST_ENTRY']],
+    'FileObjectExtension' : [ 0xd0, ['pointer64', ['void']]],
+} ],
+  '_EX_RUNDOWN_REF' : [ 0x8, {
+    'Count' : [ 0x0, ['unsigned long long']],
+    'Ptr' : [ 0x0, ['pointer64', ['void']]],
+} ],
+  '_MM_PAGE_ACCESS_INFO_HEADER' : [ 0x48, {
+    'Link' : [ 0x0, ['_SINGLE_LIST_ENTRY']],
+    'Type' : [ 0x8, ['Enumeration', dict(target = 'long', choices = {0: u'MmPteAccessType', 1: u'MmCcReadAheadType', 2: u'MmPfnRepurposeType', 3: u'MmMaximumPageAccessType'})]],
+    'EmptySequenceNumber' : [ 0xc, ['unsigned long']],
+    'CurrentFileIndex' : [ 0xc, ['unsigned long']],
+    'CreateTime' : [ 0x10, ['unsigned long long']],
+    'EmptyTime' : [ 0x18, ['unsigned long long']],
+    'TempEntry' : [ 0x18, ['pointer64', ['_MM_PAGE_ACCESS_INFO']]],
+    'PageEntry' : [ 0x20, ['pointer64', ['_MM_PAGE_ACCESS_INFO']]],
+    'FileEntry' : [ 0x28, ['pointer64', ['unsigned long long']]],
+    'FirstFileEntry' : [ 0x30, ['pointer64', ['unsigned long long']]],
+    'Process' : [ 0x38, ['pointer64', ['_EPROCESS']]],
+    'SessionId' : [ 0x40, ['unsigned long']],
+    'PageFrameEntry' : [ 0x20, ['pointer64', ['unsigned long long']]],
+    'LastPageFrameEntry' : [ 0x28, ['pointer64', ['unsigned long long']]],
+} ],
+  '_MCUPDATE_INFO' : [ 0x30, {
+    'List' : [ 0x0, ['_LIST_ENTRY']],
+    'Status' : [ 0x10, ['unsigned long']],
+    'Id' : [ 0x18, ['unsigned long long']],
+    'VendorScratch' : [ 0x20, ['array', 2, ['unsigned long long']]],
+} ],
+  '_PROCESS_EXTENDED_ENERGY_VALUES' : [ 0x1b0, {
+    'Base' : [ 0x0, ['_PROCESS_ENERGY_VALUES']],
+    'Extension' : [ 0x110, ['_PROCESS_ENERGY_VALUES_EXTENSION']],
+} ],
+  '_WHEA_EVENT_LOG_ENTRY' : [ 0x20, {
+    'Header' : [ 0x0, ['_WHEA_EVENT_LOG_ENTRY_HEADER']],
+} ],
+  '_WHEA_EVENT_LOG_ENTRY_FLAGS' : [ 0x4, {
+    'LogTelemetry' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
+    'LogInternalEtw' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
+    'LogBlackbox' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
+    'LogSel' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
+    'RawSel' : [ 0x0, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
+    'Reserved' : [ 0x0, ['BitField', dict(start_bit = 5, end_bit = 32, native_type='unsigned long')]],
+    'AsULONG' : [ 0x0, ['unsigned long']],
+} ],
+  '_WHEA_ERROR_PACKET_V2' : [ 0x50, {
+    'Signature' : [ 0x0, ['unsigned long']],
+    'Version' : [ 0x4, ['unsigned long']],
+    'Length' : [ 0x8, ['unsigned long']],
+    'Flags' : [ 0xc, ['_WHEA_ERROR_PACKET_FLAGS']],
+    'ErrorType' : [ 0x10, ['Enumeration', dict(target = 'long', choices = {0: u'WheaErrTypeProcessor', 1: u'WheaErrTypeMemory', 2: u'WheaErrTypePCIExpress', 3: u'WheaErrTypeNMI', 4: u'WheaErrTypePCIXBus', 5: u'WheaErrTypePCIXDevice', 6: u'WheaErrTypeGeneric', 7: u'WheaErrTypePmem'})]],
+    'ErrorSeverity' : [ 0x14, ['Enumeration', dict(target = 'long', choices = {0: u'WheaErrSevRecoverable', 1: u'WheaErrSevFatal', 2: u'WheaErrSevCorrected', 3: u'WheaErrSevInformational'})]],
+    'ErrorSourceId' : [ 0x18, ['unsigned long']],
+    'ErrorSourceType' : [ 0x1c, ['Enumeration', dict(target = 'long', choices = {0: u'WheaErrSrcTypeMCE', 1: u'WheaErrSrcTypeCMC', 2: u'WheaErrSrcTypeCPE', 3: u'WheaErrSrcTypeNMI', 4: u'WheaErrSrcTypePCIe', 5: u'WheaErrSrcTypeGeneric', 6: u'WheaErrSrcTypeINIT', 7: u'WheaErrSrcTypeBOOT', 8: u'WheaErrSrcTypeSCIGeneric', 9: u'WheaErrSrcTypeIPFMCA', 10: u'WheaErrSrcTypeIPFCMC', 11: u'WheaErrSrcTypeIPFCPE', 12: u'WheaErrSrcTypeGenericV2', 13: u'WheaErrSrcTypeSCIGenericV2', 14: u'WheaErrSrcTypeBMC', 15: u'WheaErrSrcTypePMEM', 16: u'WheaErrSrcTypeDeviceDriver', 17: u'WheaErrSrcTypeMax'})]],
+    'NotifyType' : [ 0x20, ['_GUID']],
+    'Context' : [ 0x30, ['unsigned long long']],
+    'DataFormat' : [ 0x38, ['Enumeration', dict(target = 'long', choices = {0: u'WheaDataFormatIPFSalRecord', 1: u'WheaDataFormatXPFMCA', 2: u'WheaDataFormatMemory', 3: u'WheaDataFormatPCIExpress', 4: u'WheaDataFormatNMIPort', 5: u'WheaDataFormatPCIXBus', 6: u'WheaDataFormatPCIXDevice', 7: u'WheaDataFormatGeneric', 8: u'WheaDataFormatMax'})]],
+    'Reserved1' : [ 0x3c, ['unsigned long']],
+    'DataOffset' : [ 0x40, ['unsigned long']],
+    'DataLength' : [ 0x44, ['unsigned long']],
+    'PshedDataOffset' : [ 0x48, ['unsigned long']],
+    'PshedDataLength' : [ 0x4c, ['unsigned long']],
+} ],
+  '_WHEA_ERROR_RECORD' : [ 0xc8, {
+    'Header' : [ 0x0, ['_WHEA_ERROR_RECORD_HEADER']],
+    'SectionDescriptor' : [ 0x80, ['array', 1, ['_WHEA_ERROR_RECORD_SECTION_DESCRIPTOR']]],
+} ],
+  '_WHEA_ERROR_RECORD_SECTION_DESCRIPTOR' : [ 0x48, {
+    'SectionOffset' : [ 0x0, ['unsigned long']],
+    'SectionLength' : [ 0x4, ['unsigned long']],
+    'Revision' : [ 0x8, ['_WHEA_REVISION']],
+    'ValidBits' : [ 0xa, ['_WHEA_ERROR_RECORD_SECTION_DESCRIPTOR_VALIDBITS']],
+    'Reserved' : [ 0xb, ['unsigned char']],
+    'Flags' : [ 0xc, ['_WHEA_ERROR_RECORD_SECTION_DESCRIPTOR_FLAGS']],
+    'SectionType' : [ 0x10, ['_GUID']],
+    'FRUId' : [ 0x20, ['_GUID']],
+    'SectionSeverity' : [ 0x30, ['Enumeration', dict(target = 'long', choices = {0: u'WheaErrSevRecoverable', 1: u'WheaErrSevFatal', 2: u'WheaErrSevCorrected', 3: u'WheaErrSevInformational'})]],
+    'FRUText' : [ 0x34, ['array', 20, ['unsigned char']]],
+} ],
+  '_FSRTL_ADVANCED_FCB_HEADER' : [ 0x68, {
+    'NodeTypeCode' : [ 0x0, ['short']],
+    'NodeByteSize' : [ 0x2, ['short']],
+    'Flags' : [ 0x4, ['unsigned char']],
+    'IsFastIoPossible' : [ 0x5, ['unsigned char']],
+    'Flags2' : [ 0x6, ['unsigned char']],
+    'Reserved' : [ 0x7, ['BitField', dict(start_bit = 0, end_bit = 4, native_type='unsigned char')]],
+    'Version' : [ 0x7, ['BitField', dict(start_bit = 4, end_bit = 8, native_type='unsigned char')]],
+    'Resource' : [ 0x8, ['pointer64', ['_ERESOURCE']]],
+    'PagingIoResource' : [ 0x10, ['pointer64', ['_ERESOURCE']]],
+    'AllocationSize' : [ 0x18, ['_LARGE_INTEGER']],
+    'FileSize' : [ 0x20, ['_LARGE_INTEGER']],
+    'ValidDataLength' : [ 0x28, ['_LARGE_INTEGER']],
+    'FastMutex' : [ 0x30, ['pointer64', ['_FAST_MUTEX']]],
+    'FilterContexts' : [ 0x38, ['_LIST_ENTRY']],
+    'PushLock' : [ 0x48, ['_EX_PUSH_LOCK']],
+    'FileContextSupportPointer' : [ 0x50, ['pointer64', ['pointer64', ['void']]]],
+    'Oplock' : [ 0x58, ['pointer64', ['void']]],
+    'ReservedForRemote' : [ 0x58, ['pointer64', ['void']]],
+    'ReservedContext' : [ 0x60, ['pointer64', ['void']]],
+} ],
+  '_iobuf' : [ 0x30, {
+    '_ptr' : [ 0x0, ['pointer64', ['unsigned char']]],
+    '_cnt' : [ 0x8, ['long']],
+    '_base' : [ 0x10, ['pointer64', ['unsigned char']]],
+    '_flag' : [ 0x18, ['long']],
+    '_file' : [ 0x1c, ['long']],
+    '_charbuf' : [ 0x20, ['long']],
+    '_bufsiz' : [ 0x24, ['long']],
+    '_tmpfname' : [ 0x28, ['pointer64', ['unsigned char']]],
+} ],
+  '_RTL_HASH_TABLE' : [ 0x10, {
+    'EntryCount' : [ 0x0, ['unsigned long']],
+    'MaskBitCount' : [ 0x4, ['BitField', dict(start_bit = 0, end_bit = 5, native_type='unsigned long')]],
+    'BucketCount' : [ 0x4, ['BitField', dict(start_bit = 5, end_bit = 32, native_type='unsigned long')]],
+    'Buckets' : [ 0x8, ['pointer64', ['_SINGLE_LIST_ENTRY']]],
+} ],
+  '_RTL_HASH_ENTRY' : [ 0x10, {
+    'BucketLink' : [ 0x0, ['_SINGLE_LIST_ENTRY']],
+    'Key' : [ 0x8, ['unsigned long long']],
+} ],
+  '_RTL_HASH_TABLE_ITERATOR' : [ 0x18, {
+    'Hash' : [ 0x0, ['pointer64', ['_RTL_HASH_TABLE']]],
+    'HashEntry' : [ 0x8, ['pointer64', ['_RTL_HASH_ENTRY']]],
+    'Bucket' : [ 0x10, ['pointer64', ['_SINGLE_LIST_ENTRY']]],
+} ],
+  '_RTL_CHASH_TABLE' : [ 0x18, {
+    'Table' : [ 0x0, ['pointer64', ['_RTL_CHASH_ENTRY']]],
+    'EntrySizeShift' : [ 0x8, ['unsigned long']],
+    'EntryMax' : [ 0xc, ['unsigned long']],
+    'EntryCount' : [ 0x10, ['unsigned long']],
+} ],
+  '_RTL_CHASH_ENTRY' : [ 0x8, {
+    'Key' : [ 0x0, ['unsigned long long']],
+} ],
+  '_TlgProvider_t' : [ 0x38, {
+    'LevelPlus1' : [ 0x0, ['unsigned long']],
+    'ProviderMetadataPtr' : [ 0x8, ['pointer64', ['unsigned short']]],
+    'KeywordAny' : [ 0x10, ['unsigned long long']],
+    'KeywordAll' : [ 0x18, ['unsigned long long']],
+    'RegHandle' : [ 0x20, ['unsigned long long']],
+    'EnableCallback' : [ 0x28, ['pointer64', ['void']]],
+    'CallbackContext' : [ 0x30, ['pointer64', ['void']]],
+} ],
+  '_EVENT_FILTER_DESCRIPTOR' : [ 0x10, {
+    'Ptr' : [ 0x0, ['unsigned long long']],
+    'Size' : [ 0x8, ['unsigned long']],
+    'Type' : [ 0xc, ['unsigned long']],
+} ],
+  '_TlgProviderMetadata_t' : [ 0x13, {
+    'Type' : [ 0x0, ['unsigned char']],
+    'ProviderId' : [ 0x1, ['_GUID']],
+    'RemainingSize' : [ 0x11, ['unsigned short']],
+} ],
+  '_SID' : [ 0xc, {
+    'Revision' : [ 0x0, ['unsigned char']],
+    'SubAuthorityCount' : [ 0x1, ['unsigned char']],
+    'IdentifierAuthority' : [ 0x2, ['_SID_IDENTIFIER_AUTHORITY']],
+    'SubAuthority' : [ 0x8, ['array', 1, ['unsigned long']]],
+} ],
+  'wil_details_FeaturePropertyCache' : [ 0x4, {
+    'cache' : [ 0x0, ['wil_details_FeatureProperties']],
+    'variant' : [ 0x0, ['wil_details_VariantProperties']],
+    'var' : [ 0x0, ['long']],
+} ],
+  'wil_details_SetPropertyFlagContext' : [ 0x10, {
+    'result' : [ 0x0, ['pointer64', ['wil_details_RecordUsageResult']]],
+    'flags' : [ 0x8, ['unsigned long']],
+    'ignoreReporting' : [ 0xc, ['long']],
+} ],
+  'wil_details_RecordUsageResult' : [ 0x18, {
+    'queueBackground' : [ 0x0, ['long']],
+    'countImmediate' : [ 0x4, ['unsigned long']],
+    'kindImmediate' : [ 0x8, ['Enumeration', dict(target = 'long', choices = {0: u'wil_details_ServiceReportingKind_UniqueUsage', 1: u'wil_details_ServiceReportingKind_UniqueOpportunity', 2: u'wil_details_ServiceReportingKind_DeviceUsage', 3: u'wil_details_ServiceReportingKind_DeviceOpportunity', 4: u'wil_details_ServiceReportingKind_PotentialUniqueUsage', 5: u'wil_details_ServiceReportingKind_PotentialUniqueOpportunity', 6: u'wil_details_ServiceReportingKind_PotentialDeviceUsage', 7: u'wil_details_ServiceReportingKind_PotentialDeviceOpportunity', 8: u'wil_details_ServiceReportingKind_EnabledTotalDuration', 9: u'wil_details_ServiceReportingKind_EnabledPausedDuration', 10: u'wil_details_ServiceReportingKind_DisabledTotalDuration', 11: u'wil_details_ServiceReportingKind_DisabledPausedDuration', 256: u'wil_details_ServiceReportingKind_VariantDevicePotentialBase', 320: u'wil_details_ServiceReportingKind_VariantDeviceUsageBase', 384: u'wil_details_ServiceReportingKind_VariantUniquePotentialBase', 448: u'wil_details_ServiceReportingKind_VariantUniqueUsageBase', 150: u'wil_details_ServiceReportingKind_CustomDisabledBase', 100: u'wil_details_ServiceReportingKind_CustomEnabledBase', 254: u'wil_details_ServiceReportingKind_Store', 255: u'wil_details_ServiceReportingKind_None'})]],
+    'payloadId' : [ 0xc, ['unsigned long']],
+    'ignoredUse' : [ 0x10, ['long']],
+    'isVariantConfiguration' : [ 0x14, ['long']],
+} ],
+  'wil_details_SetPropertyCacheUsageContext' : [ 0x18, {
+    'result' : [ 0x0, ['pointer64', ['wil_details_RecordUsageResult']]],
+    'kind' : [ 0x8, ['Enumeration', dict(target = 'long', choices = {0: u'wil_details_ServiceReportingKind_UniqueUsage', 1: u'wil_details_ServiceReportingKind_UniqueOpportunity', 2: u'wil_details_ServiceReportingKind_DeviceUsage', 3: u'wil_details_ServiceReportingKind_DeviceOpportunity', 4: u'wil_details_ServiceReportingKind_PotentialUniqueUsage', 5: u'wil_details_ServiceReportingKind_PotentialUniqueOpportunity', 6: u'wil_details_ServiceReportingKind_PotentialDeviceUsage', 7: u'wil_details_ServiceReportingKind_PotentialDeviceOpportunity', 8: u'wil_details_ServiceReportingKind_EnabledTotalDuration', 9: u'wil_details_ServiceReportingKind_EnabledPausedDuration', 10: u'wil_details_ServiceReportingKind_DisabledTotalDuration', 11: u'wil_details_ServiceReportingKind_DisabledPausedDuration', 256: u'wil_details_ServiceReportingKind_VariantDevicePotentialBase', 320: u'wil_details_ServiceReportingKind_VariantDeviceUsageBase', 384: u'wil_details_ServiceReportingKind_VariantUniquePotentialBase', 448: u'wil_details_ServiceReportingKind_VariantUniqueUsageBase', 150: u'wil_details_ServiceReportingKind_CustomDisabledBase', 100: u'wil_details_ServiceReportingKind_CustomEnabledBase', 254: u'wil_details_ServiceReportingKind_Store', 255: u'wil_details_ServiceReportingKind_None'})]],
+    'addend' : [ 0x10, ['unsigned long long']],
+} ],
+  'FEATURE_ERROR' : [ 0x68, {
+    'hr' : [ 0x0, ['unsigned long']],
+    'lineNumber' : [ 0x4, ['unsigned short']],
+    'file' : [ 0x8, ['pointer64', ['unsigned char']]],
+    'process' : [ 0x10, ['pointer64', ['unsigned char']]],
+    'modulePath' : [ 0x18, ['pointer64', ['unsigned char']]],
+    'callerReturnAddressOffset' : [ 0x20, ['unsigned long']],
+    'callerModule' : [ 0x28, ['pointer64', ['unsigned char']]],
+    'message' : [ 0x30, ['pointer64', ['unsigned char']]],
+    'originLineNumber' : [ 0x38, ['unsigned short']],
+    'originFile' : [ 0x40, ['pointer64', ['unsigned char']]],
+    'originModule' : [ 0x48, ['pointer64', ['unsigned char']]],
+    'originCallerReturnAddressOffset' : [ 0x50, ['unsigned long']],
+    'originCallerModule' : [ 0x58, ['pointer64', ['unsigned char']]],
+    'originName' : [ 0x60, ['pointer64', ['unsigned char']]],
+} ],
+  'FEATURE_LOGGED_TRAITS' : [ 0x6, {
+    'version' : [ 0x0, ['unsigned short']],
+    'baseVersion' : [ 0x2, ['unsigned short']],
+    'stage' : [ 0x4, ['unsigned char']],
+} ],
+  'wil_details_FeatureVariantPropertyCache' : [ 0x8, {
+    'propertyCache' : [ 0x0, ['wil_details_FeaturePropertyCache']],
+    'payloadId' : [ 0x4, ['unsigned long']],
+} ],
+  'wil_details_StagingConfigFeature' : [ 0xc, {
+    'featureId' : [ 0x0, ['unsigned long']],
+    'changedInSession' : [ 0x4, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
+    'isVariantConfig' : [ 0x4, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
+    'unused1' : [ 0x4, ['BitField', dict(start_bit = 2, end_bit = 8, native_type='unsigned long')]],
+    'serviceState' : [ 0x4, ['BitField', dict(start_bit = 8, end_bit = 10, native_type='unsigned long')]],
+    'userState' : [ 0x4, ['BitField', dict(start_bit = 10, end_bit = 12, native_type='unsigned long')]],
+    'testState' : [ 0x4, ['BitField', dict(start_bit = 12, end_bit = 14, native_type='unsigned long')]],
+    'unused2' : [ 0x4, ['BitField', dict(start_bit = 14, end_bit = 16, native_type='unsigned long')]],
+    'unused3' : [ 0x4, ['BitField', dict(start_bit = 16, end_bit = 24, native_type='unsigned long')]],
+    'variant' : [ 0x4, ['BitField', dict(start_bit = 24, end_bit = 30, native_type='unsigned long')]],
+    'payloadKind' : [ 0x4, ['BitField', dict(start_bit = 30, end_bit = 32, native_type='unsigned long')]],
+    'payload' : [ 0x8, ['unsigned long']],
+} ],
+  'wil_details_StagingConfig' : [ 0x58, {
+    'store' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: u'wil_FeatureStore_Machine', 1: u'wil_FeatureStore_User', 2: u'wil_FeatureStore_All'})]],
+    'forUpdate' : [ 0x4, ['long']],
+    'readChangeStamp' : [ 0x8, ['unsigned long']],
+    'readVersion' : [ 0xc, ['unsigned char']],
+    'modified' : [ 0x10, ['long']],
+    'header' : [ 0x18, ['pointer64', ['wil_details_StagingConfigHeader']]],
+    'features' : [ 0x20, ['pointer64', ['wil_details_StagingConfigFeature']]],
+    'triggers' : [ 0x28, ['pointer64', ['wil_details_StagingConfigUsageTrigger']]],
+    'changedInSession' : [ 0x30, ['long']],
+    'buffer' : [ 0x38, ['pointer64', ['void']]],
+    'bufferSize' : [ 0x40, ['unsigned long long']],
+    'bufferAlloc' : [ 0x48, ['unsigned long long']],
+    'bufferOwned' : [ 0x50, ['long']],
+} ],
+  'wil_details_StagingConfigHeader' : [ 0x10, {
+    'version' : [ 0x0, ['unsigned char']],
+    'versionMinor' : [ 0x1, ['unsigned char']],
+    'headerSizeBytes' : [ 0x2, ['unsigned short']],
+    'featureCount' : [ 0x4, ['unsigned short']],
+    'featureUsageTriggerCount' : [ 0x6, ['unsigned short']],
+    'sessionProperties' : [ 0x8, ['wil_details_StagingConfigHeaderProperties']],
+    'properties' : [ 0xc, ['wil_details_StagingConfigHeaderProperties']],
+} ],
+  'wil_details_StagingConfigUsageTrigger' : [ 0x10, {
+    'featureId' : [ 0x0, ['unsigned long']],
+    'trigger' : [ 0x4, ['wil_details_StagingConfigWnfStateName']],
+    'serviceReportingKind' : [ 0xc, ['BitField', dict(start_bit = 0, end_bit = 16, native_type='unsigned long')]],
+    'isVariantConfig' : [ 0xc, ['BitField', dict(start_bit = 16, end_bit = 17, native_type='unsigned long')]],
+    'unused' : [ 0xc, ['BitField', dict(start_bit = 17, end_bit = 32, native_type='unsigned long')]],
+} ],
+  'wil_details_StagingConfigHeaderProperties' : [ 0x4, {
+    'ignoreServiceState' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
+    'ignoreUserState' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
+    'ignoreTestState' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
+    'ignoreVariants' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
+    'unused' : [ 0x0, ['BitField', dict(start_bit = 4, end_bit = 32, native_type='unsigned long')]],
+} ],
+  'wil_FeatureState' : [ 0x18, {
+    'enabledState' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: u'wil_FeatureEnabledState_Default', 1: u'wil_FeatureEnabledState_Disabled', 2: u'wil_FeatureEnabledState_Enabled'})]],
+    'variant' : [ 0x4, ['unsigned char']],
+    'payloadKind' : [ 0x8, ['Enumeration', dict(target = 'long', choices = {0: u'wil_FeatureVariantPayloadKind_None', 1: u'wil_FeatureVariantPayloadKind_Resident', 2: u'wil_FeatureVariantPayloadKind_External'})]],
+    'payload' : [ 0xc, ['unsigned long']],
+    'hasNotification' : [ 0x10, ['long']],
+    'isVariantConfiguration' : [ 0x14, ['long']],
+} ],
+  'wil_details_FeatureTestState' : [ 0x20, {
+    'kind' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: u'wil_details_FeatureTestStateKind_EnabledState', 1: u'wil_details_FeatureTestStateKind_Variant'})]],
+    'featureId' : [ 0x4, ['unsigned long']],
+    'state' : [ 0x8, ['Enumeration', dict(target = 'long', choices = {0: u'wil_FeatureEnabledState_Default', 1: u'wil_FeatureEnabledState_Disabled', 2: u'wil_FeatureEnabledState_Enabled'})]],
+    'variant' : [ 0xc, ['unsigned char']],
+    'payload' : [ 0x10, ['unsigned long']],
+    'next' : [ 0x18, ['pointer64', ['wil_details_FeatureTestState']]],
+} ],
+  '__WIL__WNF_STATE_NAME' : [ 0x8, {
+    'Data' : [ 0x0, ['array', 2, ['unsigned long']]],
+} ],
+  '_WNF_TYPE_ID' : [ 0x10, {
+    'TypeId' : [ 0x0, ['_GUID']],
+} ],
+  '_WNF_STATE_NAME' : [ 0x8, {
+    'Data' : [ 0x0, ['array', 2, ['unsigned long']]],
+} ],
+  '_wil_details_UsageSubscriptionData' : [ 0x8, {
+    'featureId' : [ 0x0, ['unsigned long']],
+    'serviceReportingKind' : [ 0x4, ['unsigned short']],
+} ],
+  '__unnamed_183a' : [ 0x8, {
+    'Long' : [ 0x0, ['unsigned long long']],
+    'VolatileLong' : [ 0x0, ['unsigned long long']],
+    'Hard' : [ 0x0, ['_MMPTE_HARDWARE']],
+    'Proto' : [ 0x0, ['_MMPTE_PROTOTYPE']],
+    'Soft' : [ 0x0, ['_MMPTE_SOFTWARE']],
+    'TimeStamp' : [ 0x0, ['_MMPTE_TIMESTAMP']],
+    'Trans' : [ 0x0, ['_MMPTE_TRANSITION']],
+    'Subsect' : [ 0x0, ['_MMPTE_SUBSECTION']],
+    'List' : [ 0x0, ['_MMPTE_LIST']],
+} ],
+  '_MMPTE' : [ 0x8, {
+    'u' : [ 0x0, ['__unnamed_183a']],
+} ],
+  '_EX_PUSH_LOCK_AUTO_EXPAND' : [ 0x10, {
+    'LocalLock' : [ 0x0, ['_EX_PUSH_LOCK']],
+    'State' : [ 0x8, ['_EX_PUSH_LOCK_AUTO_EXPAND_STATE']],
+    'Stats' : [ 0xc, ['unsigned long']],
+} ],
+  '_ERESOURCE' : [ 0x68, {
+    'SystemResourcesList' : [ 0x0, ['_LIST_ENTRY']],
+    'OwnerTable' : [ 0x10, ['pointer64', ['_OWNER_ENTRY']]],
+    'ActiveCount' : [ 0x18, ['short']],
+    'Flag' : [ 0x1a, ['unsigned short']],
+    'ReservedLowFlags' : [ 0x1a, ['unsigned char']],
+    'WaiterPriority' : [ 0x1b, ['unsigned char']],
+    'SharedWaiters' : [ 0x20, ['pointer64', ['void']]],
+    'ExclusiveWaiters' : [ 0x28, ['pointer64', ['void']]],
+    'OwnerEntry' : [ 0x30, ['_OWNER_ENTRY']],
+    'ActiveEntries' : [ 0x40, ['unsigned long']],
+    'ContentionCount' : [ 0x44, ['unsigned long']],
+    'NumberOfSharedWaiters' : [ 0x48, ['unsigned long']],
+    'NumberOfExclusiveWaiters' : [ 0x4c, ['unsigned long']],
+    'Reserved2' : [ 0x50, ['pointer64', ['void']]],
+    'Address' : [ 0x58, ['pointer64', ['void']]],
+    'CreatorBackTraceIndex' : [ 0x58, ['unsigned long long']],
+    'SpinLock' : [ 0x60, ['unsigned long long']],
+} ],
+  '_MI_CACHED_PTE' : [ 0x8, {
+    'GlobalTimeStamp' : [ 0x0, ['unsigned long']],
+    'PteIndex' : [ 0x4, ['unsigned long']],
+    'Long' : [ 0x0, ['long long']],
+} ],
+  '_KLOCK_QUEUE_HANDLE' : [ 0x18, {
+    'LockQueue' : [ 0x0, ['_KSPIN_LOCK_QUEUE']],
+    'OldIrql' : [ 0x10, ['unsigned char']],
+} ],
+  '_MMPFNLIST' : [ 0x28, {
+    'Total' : [ 0x0, ['unsigned long long']],
+    'ListName' : [ 0x8, ['Enumeration', dict(target = 'long', choices = {0: u'ZeroedPageList', 1: u'FreePageList', 2: u'StandbyPageList', 3: u'ModifiedPageList', 4: u'ModifiedNoWritePageList', 5: u'BadPageList', 6: u'ActiveAndValid', 7: u'TransitionPage'})]],
+    'Flink' : [ 0x10, ['unsigned long long']],
+    'Blink' : [ 0x18, ['unsigned long long']],
+    'Lock' : [ 0x20, ['unsigned long long']],
+} ],
+  '_MMCLONE_DESCRIPTOR' : [ 0x70, {
+    'CloneNode' : [ 0x0, ['_RTL_BALANCED_NODE']],
+    'Next' : [ 0x0, ['pointer64', ['_MMCLONE_DESCRIPTOR']]],
+    'StartingCloneBlock' : [ 0x18, ['pointer64', ['_MMCLONE_BLOCK']]],
+    'EndingCloneBlock' : [ 0x20, ['pointer64', ['_MMCLONE_BLOCK']]],
+    'NumberOfPtes' : [ 0x28, ['unsigned long long']],
+    'NumberOfReferences' : [ 0x30, ['unsigned long long']],
+    'CloneHeader' : [ 0x38, ['pointer64', ['_MMCLONE_HEADER']]],
+    'NonPagedPoolQuotaCharge' : [ 0x40, ['unsigned long long']],
+    'DeleteList' : [ 0x50, ['_SLIST_ENTRY']],
+    'NestingLevel' : [ 0x60, ['unsigned long long']],
+} ],
+  '__unnamed_1879' : [ 0x8, {
+    'NextSlistPfn' : [ 0x0, ['_SINGLE_LIST_ENTRY']],
+    'Next' : [ 0x0, ['pointer64', ['void']]],
+    'Flink' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 36, native_type='unsigned long long')]],
+    'NodeFlinkHigh' : [ 0x0, ['BitField', dict(start_bit = 36, end_bit = 64, native_type='unsigned long long')]],
+    'Active' : [ 0x0, ['_MI_ACTIVE_PFN']],
+} ],
+  '__unnamed_187e' : [ 0x2, {
+    'ReferenceCount' : [ 0x0, ['unsigned short']],
+} ],
+  '__unnamed_1880' : [ 0x4, {
+    'EntireField' : [ 0x0, ['unsigned long']],
+} ],
+  '__unnamed_1882' : [ 0x4, {
+    'ReferenceCount' : [ 0x0, ['unsigned short']],
+    'e1' : [ 0x2, ['_MMPFNENTRY1']],
+    'e3' : [ 0x3, ['_MMPFNENTRY3']],
+    'e2' : [ 0x0, ['__unnamed_187e']],
+    'e4' : [ 0x0, ['__unnamed_1880']],
+} ],
+  '__unnamed_188e' : [ 0x8, {
+    'PteFrame' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 36, native_type='unsigned long long')]],
+    'Channel' : [ 0x0, ['BitField', dict(start_bit = 36, end_bit = 38, native_type='unsigned long long')]],
+    'Unused1' : [ 0x0, ['BitField', dict(start_bit = 38, end_bit = 39, native_type='unsigned long long')]],
+    'Unused2' : [ 0x0, ['BitField', dict(start_bit = 39, end_bit = 40, native_type='unsigned long long')]],
+    'Partition' : [ 0x0, ['BitField', dict(start_bit = 40, end_bit = 50, native_type='unsigned long long')]],
+    'Spare' : [ 0x0, ['BitField', dict(start_bit = 50, end_bit = 52, native_type='unsigned long long')]],
+    'FileOnly' : [ 0x0, ['BitField', dict(start_bit = 52, end_bit = 53, native_type='unsigned long long')]],
+    'PfnExists' : [ 0x0, ['BitField', dict(start_bit = 53, end_bit = 54, native_type='unsigned long long')]],
+    'PageIdentity' : [ 0x0, ['BitField', dict(start_bit = 54, end_bit = 57, native_type='unsigned long long')]],
+    'PrototypePte' : [ 0x0, ['BitField', dict(start_bit = 57, end_bit = 58, native_type='unsigned long long')]],
+    'PageColor' : [ 0x0, ['BitField', dict(start_bit = 58, end_bit = 64, native_type='unsigned long long')]],
+    'EntireField' : [ 0x0, ['unsigned long long']],
+} ],
+  '_MMPFN' : [ 0x30, {
+    'ListEntry' : [ 0x0, ['_LIST_ENTRY']],
+    'TreeNode' : [ 0x0, ['_RTL_BALANCED_NODE']],
+    'u1' : [ 0x0, ['__unnamed_1879']],
+    'PteAddress' : [ 0x8, ['pointer64', ['_MMPTE']]],
+    'PteLong' : [ 0x8, ['unsigned long long']],
+    'OriginalPte' : [ 0x10, ['_MMPTE']],
+    'u2' : [ 0x18, ['_MIPFNBLINK']],
+    'u3' : [ 0x20, ['__unnamed_1882']],
+    'NodeBlinkLow' : [ 0x24, ['unsigned short']],
+    'Unused' : [ 0x26, ['BitField', dict(start_bit = 0, end_bit = 4, native_type='unsigned char')]],
+    'Unused2' : [ 0x26, ['BitField', dict(start_bit = 4, end_bit = 8, native_type='unsigned char')]],
+    'ViewCount' : [ 0x27, ['unsigned char']],
+    'NodeFlinkLow' : [ 0x27, ['unsigned char']],
+    'u4' : [ 0x28, ['__unnamed_188e']],
+} ],
+  '__unnamed_1899' : [ 0x8, {
+    'ImageCommitment' : [ 0x0, ['unsigned long long']],
+    'CreatingProcessId' : [ 0x0, ['unsigned long']],
+} ],
+  '__unnamed_189d' : [ 0x8, {
+    'ImageInformation' : [ 0x0, ['pointer64', ['_MI_SECTION_IMAGE_INFORMATION']]],
+    'FirstMappedVa' : [ 0x0, ['pointer64', ['void']]],
+} ],
+  '_SEGMENT' : [ 0x48, {
+    'ControlArea' : [ 0x0, ['pointer64', ['_CONTROL_AREA']]],
+    'TotalNumberOfPtes' : [ 0x8, ['unsigned long']],
+    'SegmentFlags' : [ 0xc, ['_SEGMENT_FLAGS']],
+    'NumberOfCommittedPages' : [ 0x10, ['unsigned long long']],
+    'SizeOfSegment' : [ 0x18, ['unsigned long long']],
+    'ExtendInfo' : [ 0x20, ['pointer64', ['_MMEXTEND_INFO']]],
+    'BasedAddress' : [ 0x20, ['pointer64', ['void']]],
+    'SegmentLock' : [ 0x28, ['_EX_PUSH_LOCK']],
+    'u1' : [ 0x30, ['__unnamed_1899']],
+    'u2' : [ 0x38, ['__unnamed_189d']],
+    'PrototypePte' : [ 0x40, ['pointer64', ['_MMPTE']]],
+} ],
+  '__unnamed_18a2' : [ 0x4, {
+    'LongFlags' : [ 0x0, ['unsigned long']],
+    'Flags' : [ 0x0, ['_MMSECTION_FLAGS']],
+} ],
+  '__unnamed_18a5' : [ 0x4, {
+    'LongFlags' : [ 0x0, ['unsigned long']],
+    'Flags' : [ 0x0, ['_MMSECTION_FLAGS2']],
+} ],
+  '__unnamed_18ad' : [ 0x10, {
+    'NumberOfSystemCacheViews' : [ 0x0, ['unsigned long']],
+    'ImageRelocationStartBit' : [ 0x0, ['unsigned long']],
+    'WritableUserReferences' : [ 0x4, ['long']],
+    'ImageRelocationSizeIn64k' : [ 0x4, ['BitField', dict(start_bit = 0, end_bit = 16, native_type='unsigned long')]],
+    'SystemImage' : [ 0x4, ['BitField', dict(start_bit = 16, end_bit = 17, native_type='unsigned long')]],
+    'CantMove' : [ 0x4, ['BitField', dict(start_bit = 17, end_bit = 18, native_type='unsigned long')]],
+    'StrongCode' : [ 0x4, ['BitField', dict(start_bit = 18, end_bit = 20, native_type='unsigned long')]],
+    'BitMap' : [ 0x4, ['BitField', dict(start_bit = 20, end_bit = 22, native_type='unsigned long')]],
+    'ImageActive' : [ 0x4, ['BitField', dict(start_bit = 22, end_bit = 23, native_type='unsigned long')]],
+    'ImageBaseOkToReuse' : [ 0x4, ['BitField', dict(start_bit = 23, end_bit = 24, native_type='unsigned long')]],
+    'FlushInProgressCount' : [ 0x8, ['unsigned long']],
+    'NumberOfSubsections' : [ 0x8, ['unsigned long']],
+    'SeImageStub' : [ 0x8, ['pointer64', ['_MI_IMAGE_SECURITY_REFERENCE']]],
+} ],
+  '__unnamed_18af' : [ 0x10, {
+    'e2' : [ 0x0, ['__unnamed_18ad']],
+} ],
+  '__unnamed_18b1' : [ 0x8, {
+    'IoAttributionContext' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 61, native_type='unsigned long long')]],
+    'Spare' : [ 0x0, ['BitField', dict(start_bit = 61, end_bit = 64, native_type='unsigned long long')]],
+    'ImageCrossPartitionCharge' : [ 0x0, ['unsigned long long']],
+    'CommittedPageCount' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 36, native_type='unsigned long long')]],
+} ],
+  '_CONTROL_AREA' : [ 0x80, {
+    'Segment' : [ 0x0, ['pointer64', ['_SEGMENT']]],
+    'ListHead' : [ 0x8, ['_LIST_ENTRY']],
+    'AweContext' : [ 0x8, ['pointer64', ['void']]],
+    'NumberOfSectionReferences' : [ 0x18, ['unsigned long long']],
+    'NumberOfPfnReferences' : [ 0x20, ['unsigned long long']],
+    'NumberOfMappedViews' : [ 0x28, ['unsigned long long']],
+    'NumberOfUserReferences' : [ 0x30, ['unsigned long long']],
+    'u' : [ 0x38, ['__unnamed_18a2']],
+    'u1' : [ 0x3c, ['__unnamed_18a5']],
+    'FilePointer' : [ 0x40, ['_EX_FAST_REF']],
+    'ControlAreaLock' : [ 0x48, ['long']],
+    'ModifiedWriteCount' : [ 0x4c, ['unsigned long']],
+    'WaitList' : [ 0x50, ['pointer64', ['_MI_CONTROL_AREA_WAIT_BLOCK']]],
+    'u2' : [ 0x58, ['__unnamed_18af']],
+    'FileObjectLock' : [ 0x68, ['_EX_PUSH_LOCK']],
+    'LockedPages' : [ 0x70, ['unsigned long long']],
+    'u3' : [ 0x78, ['__unnamed_18b1']],
+} ],
+  '_MI_SYSTEM_PTE_TYPE' : [ 0x60, {
+    'Bitmap' : [ 0x0, ['_RTL_BITMAP_EX']],
+    'BasePte' : [ 0x10, ['pointer64', ['_MMPTE']]],
+    'Flags' : [ 0x18, ['unsigned long']],
+    'VaType' : [ 0x1c, ['Enumeration', dict(target = 'long', choices = {0: u'MiVaUnused', 1: u'MiVaSessionSpace', 2: u'MiVaProcessSpace', 3: u'MiVaBootLoaded', 4: u'MiVaPfnDatabase', 5: u'MiVaNonPagedPool', 6: u'MiVaPagedPool', 7: u'MiVaSpecialPoolPaged', 8: u'MiVaSystemCache', 9: u'MiVaSystemPtes', 10: u'MiVaHal', 11: u'MiVaSessionGlobalSpace', 12: u'MiVaDriverImages', 13: u'MiVaSystemPtesLarge', 14: u'MiVaKernelStacks', 15: u'MiVaMaximumType'})]],
+    'FailureCount' : [ 0x20, ['pointer64', ['unsigned long']]],
+    'PteFailures' : [ 0x28, ['unsigned long']],
+    'SpinLock' : [ 0x30, ['unsigned long long']],
+    'GlobalPushLock' : [ 0x30, ['pointer64', ['_EX_PUSH_LOCK']]],
+    'TotalSystemPtes' : [ 0x38, ['unsigned long long']],
+    'Hint' : [ 0x40, ['unsigned long long']],
+    'LowestBitEverAllocated' : [ 0x48, ['unsigned long long']],
+    'CachedPtes' : [ 0x50, ['pointer64', ['_MI_CACHED_PTES']]],
+    'TotalFreeSystemPtes' : [ 0x58, ['unsigned long long']],
+} ],
+  '__unnamed_18cc' : [ 0x4, {
+    'LongFlags' : [ 0x0, ['unsigned long']],
+    'VadFlags' : [ 0x0, ['_MMVAD_FLAGS']],
+    'PrivateVadFlags' : [ 0x0, ['_MM_PRIVATE_VAD_FLAGS']],
+    'GraphicsVadFlags' : [ 0x0, ['_MM_GRAPHICS_VAD_FLAGS']],
+    'SharedVadFlags' : [ 0x0, ['_MM_SHARED_VAD_FLAGS']],
+    'VolatileVadLong' : [ 0x0, ['unsigned long']],
+} ],
+  '__unnamed_18cf' : [ 0x4, {
+    'LongFlags1' : [ 0x0, ['unsigned long']],
+    'VadFlags1' : [ 0x0, ['_MMVAD_FLAGS1']],
+} ],
+  '_MMVAD_SHORT' : [ 0x40, {
+    'NextVad' : [ 0x0, ['pointer64', ['_MMVAD_SHORT']]],
+    'ExtraCreateInfo' : [ 0x8, ['pointer64', ['void']]],
+    'VadNode' : [ 0x0, ['_RTL_BALANCED_NODE']],
+    'StartingVpn' : [ 0x18, ['unsigned long']],
+    'EndingVpn' : [ 0x1c, ['unsigned long']],
+    'StartingVpnHigh' : [ 0x20, ['unsigned char']],
+    'EndingVpnHigh' : [ 0x21, ['unsigned char']],
+    'CommitChargeHigh' : [ 0x22, ['unsigned char']],
+    'SpareNT64VadUChar' : [ 0x23, ['unsigned char']],
+    'ReferenceCount' : [ 0x24, ['long']],
+    'PushLock' : [ 0x28, ['_EX_PUSH_LOCK']],
+    'u' : [ 0x30, ['__unnamed_18cc']],
+    'u1' : [ 0x34, ['__unnamed_18cf']],
+    'EventList' : [ 0x38, ['pointer64', ['_MI_VAD_EVENT_BLOCK']]],
+} ],
+  '_MM_STORE_KEY' : [ 0x8, {
+    'KeyLow' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 60, native_type='unsigned long long')]],
+    'KeyHigh' : [ 0x0, ['BitField', dict(start_bit = 60, end_bit = 64, native_type='unsigned long long')]],
+    'EntireKey' : [ 0x0, ['unsigned long long']],
+} ],
+  '_MI_PARTITION' : [ 0x30c0, {
+    'Core' : [ 0x0, ['_MI_PARTITION_CORE']],
+    'Modwriter' : [ 0x1b0, ['_MI_PARTITION_MODWRITES']],
+    'Store' : [ 0x470, ['_MI_PARTITION_STORES']],
+    'Segments' : [ 0x500, ['_MI_PARTITION_SEGMENTS']],
+    'PageLists' : [ 0x840, ['_MI_PARTITION_PAGE_LISTS']],
+    'Commit' : [ 0x1c00, ['_MI_PARTITION_COMMIT']],
+    'Zeroing' : [ 0x1c80, ['_MI_PARTITION_ZEROING']],
+    'PageCombine' : [ 0x1ce8, ['_MI_PAGE_COMBINING_SUPPORT']],
+    'WorkingSetControl' : [ 0x1e78, ['pointer64', ['void']]],
+    'WorkingSetExpansionHead' : [ 0x1e80, ['_MMWORKING_SET_EXPANSION_HEAD']],
+    'SessionDetachTimeStamp' : [ 0x1e90, ['unsigned long']],
+    'Vp' : [ 0x1ec0, ['_MI_VISIBLE_PARTITION']],
+} ],
+  '_EPARTITION' : [ 0x80, {
+    'MmPartition' : [ 0x0, ['pointer64', ['void']]],
+    'CcPartition' : [ 0x8, ['pointer64', ['void']]],
+    'ExPartition' : [ 0x10, ['pointer64', ['void']]],
+    'HardReferenceCount' : [ 0x18, ['long long']],
+    'OpenHandleCount' : [ 0x20, ['long long']],
+    'ActivePartitionLinks' : [ 0x28, ['_LIST_ENTRY']],
+    'ParentPartition' : [ 0x38, ['pointer64', ['_EPARTITION']]],
+    'TeardownWorkItem' : [ 0x40, ['_WORK_QUEUE_ITEM']],
+    'TeardownLock' : [ 0x60, ['_EX_PUSH_LOCK']],
+    'SystemProcess' : [ 0x68, ['pointer64', ['_EPROCESS']]],
+    'SystemProcessHandle' : [ 0x70, ['pointer64', ['void']]],
+    'PartitionFlags' : [ 0x78, ['unsigned long']],
+    'PairedWithJob' : [ 0x78, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
+} ],
+  '_HHIVE' : [ 0x600, {
+    'Signature' : [ 0x0, ['unsigned long']],
+    'GetCellRoutine' : [ 0x8, ['pointer64', ['void']]],
+    'ReleaseCellRoutine' : [ 0x10, ['pointer64', ['void']]],
+    'Allocate' : [ 0x18, ['pointer64', ['void']]],
+    'Free' : [ 0x20, ['pointer64', ['void']]],
+    'FileWrite' : [ 0x28, ['pointer64', ['void']]],
+    'FileRead' : [ 0x30, ['pointer64', ['void']]],
+    'HiveLoadFailure' : [ 0x38, ['pointer64', ['void']]],
+    'BaseBlock' : [ 0x40, ['pointer64', ['_HBASE_BLOCK']]],
+    'FlusherLock' : [ 0x48, ['_CMSI_RW_LOCK']],
+    'WriterLock' : [ 0x50, ['_CMSI_RW_LOCK']],
+    'DirtyVector' : [ 0x58, ['_RTL_BITMAP']],
+    'DirtyCount' : [ 0x68, ['unsigned long']],
+    'DirtyAlloc' : [ 0x6c, ['unsigned long']],
+    'UnreconciledVector' : [ 0x70, ['_RTL_BITMAP']],
+    'UnreconciledCount' : [ 0x80, ['unsigned long']],
+    'BaseBlockAlloc' : [ 0x84, ['unsigned long']],
+    'Cluster' : [ 0x88, ['unsigned long']],
+    'Flat' : [ 0x8c, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
+    'ReadOnly' : [ 0x8c, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned char')]],
+    'Reserved' : [ 0x8c, ['BitField', dict(start_bit = 2, end_bit = 8, native_type='unsigned char')]],
+    'DirtyFlag' : [ 0x8d, ['unsigned char']],
+    'HvBinHeadersUse' : [ 0x90, ['unsigned long']],
+    'HvFreeCellsUse' : [ 0x94, ['unsigned long']],
+    'HvUsedCellsUse' : [ 0x98, ['unsigned long']],
+    'CmUsedCellsUse' : [ 0x9c, ['unsigned long']],
+    'HiveFlags' : [ 0xa0, ['unsigned long']],
+    'CurrentLog' : [ 0xa4, ['unsigned long']],
+    'CurrentLogSequence' : [ 0xa8, ['unsigned long']],
+    'CurrentLogMinimumSequence' : [ 0xac, ['unsigned long']],
+    'CurrentLogOffset' : [ 0xb0, ['unsigned long']],
+    'MinimumLogSequence' : [ 0xb4, ['unsigned long']],
+    'LogFileSizeCap' : [ 0xb8, ['unsigned long']],
+    'LogDataPresent' : [ 0xbc, ['array', 2, ['unsigned char']]],
+    'PrimaryFileValid' : [ 0xbe, ['unsigned char']],
+    'BaseBlockDirty' : [ 0xbf, ['unsigned char']],
+    'LastLogSwapTime' : [ 0xc0, ['_LARGE_INTEGER']],
+    'FirstLogFile' : [ 0xc8, ['BitField', dict(start_bit = 0, end_bit = 3, native_type='unsigned short')]],
+    'SecondLogFile' : [ 0xc8, ['BitField', dict(start_bit = 3, end_bit = 6, native_type='unsigned short')]],
+    'HeaderRecovered' : [ 0xc8, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned short')]],
+    'LegacyRecoveryIndicated' : [ 0xc8, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned short')]],
+    'RecoveryInformationReserved' : [ 0xc8, ['BitField', dict(start_bit = 8, end_bit = 16, native_type='unsigned short')]],
+    'RecoveryInformation' : [ 0xc8, ['unsigned short']],
+    'LogEntriesRecovered' : [ 0xca, ['array', 2, ['unsigned char']]],
+    'RefreshCount' : [ 0xcc, ['unsigned long']],
+    'StorageTypeCount' : [ 0xd0, ['unsigned long']],
+    'Version' : [ 0xd4, ['unsigned long']],
+    'ViewMap' : [ 0xd8, ['_HVP_VIEW_MAP']],
+    'Storage' : [ 0x110, ['array', 2, ['_DUAL']]],
+} ],
+  '_HV_GET_CELL_CONTEXT' : [ 0x8, {
+    'Cell' : [ 0x0, ['unsigned long']],
+    'BinContext' : [ 0x4, ['_HV_GET_BIN_CONTEXT']],
+} ],
+  '_CM_KEY_CONTROL_BLOCK' : [ 0x138, {
+    'RefCount' : [ 0x0, ['unsigned long long']],
+    'ExtFlags' : [ 0x8, ['BitField', dict(start_bit = 0, end_bit = 16, native_type='unsigned long')]],
+    'Freed' : [ 0x8, ['BitField', dict(start_bit = 16, end_bit = 17, native_type='unsigned long')]],
+    'Discarded' : [ 0x8, ['BitField', dict(start_bit = 17, end_bit = 18, native_type='unsigned long')]],
+    'HiveUnloaded' : [ 0x8, ['BitField', dict(start_bit = 18, end_bit = 19, native_type='unsigned long')]],
+    'Decommissioned' : [ 0x8, ['BitField', dict(start_bit = 19, end_bit = 20, native_type='unsigned long')]],
+    'SpareExtFlag' : [ 0x8, ['BitField', dict(start_bit = 20, end_bit = 21, native_type='unsigned long')]],
+    'TotalLevels' : [ 0x8, ['BitField', dict(start_bit = 21, end_bit = 31, native_type='unsigned long')]],
+    'KeyHash' : [ 0x10, ['_CM_KEY_HASH']],
+    'ConvKey' : [ 0x10, ['_CM_PATH_HASH']],
+    'NextHash' : [ 0x18, ['pointer64', ['_CM_KEY_HASH']]],
+    'KeyHive' : [ 0x20, ['pointer64', ['_HHIVE']]],
+    'KeyCell' : [ 0x28, ['unsigned long']],
+    'KcbPushlock' : [ 0x30, ['_EX_PUSH_LOCK']],
+    'Owner' : [ 0x38, ['pointer64', ['_KTHREAD']]],
+    'SharedCount' : [ 0x38, ['long']],
+    'DelayedDeref' : [ 0x40, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
+    'DelayedClose' : [ 0x40, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned char')]],
+    'Parking' : [ 0x40, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned char')]],
+    'LayerSemantics' : [ 0x41, ['unsigned char']],
+    'LayerHeight' : [ 0x42, ['short']],
+    'Spare1' : [ 0x44, ['unsigned long']],
+    'ParentKcb' : [ 0x48, ['pointer64', ['_CM_KEY_CONTROL_BLOCK']]],
+    'NameBlock' : [ 0x50, ['pointer64', ['_CM_NAME_CONTROL_BLOCK']]],
+    'CachedSecurity' : [ 0x58, ['pointer64', ['_CM_KEY_SECURITY_CACHE']]],
+    'ValueList' : [ 0x60, ['_CHILD_LIST']],
+    'LinkTarget' : [ 0x68, ['pointer64', ['_CM_KEY_CONTROL_BLOCK']]],
+    'IndexHint' : [ 0x70, ['pointer64', ['_CM_INDEX_HINT_BLOCK']]],
+    'HashKey' : [ 0x70, ['unsigned long']],
+    'SubKeyCount' : [ 0x70, ['unsigned long']],
+    'KeyBodyListHead' : [ 0x78, ['_LIST_ENTRY']],
+    'ClonedListEntry' : [ 0x78, ['_LIST_ENTRY']],
+    'KeyBodyArray' : [ 0x88, ['array', 4, ['pointer64', ['_CM_KEY_BODY']]]],
+    'KcbLastWriteTime' : [ 0xa8, ['_LARGE_INTEGER']],
+    'KcbMaxNameLen' : [ 0xb0, ['unsigned short']],
+    'KcbMaxValueNameLen' : [ 0xb2, ['unsigned short']],
+    'KcbMaxValueDataLen' : [ 0xb4, ['unsigned long']],
+    'KcbUserFlags' : [ 0xb8, ['BitField', dict(start_bit = 0, end_bit = 4, native_type='unsigned long')]],
+    'KcbVirtControlFlags' : [ 0xb8, ['BitField', dict(start_bit = 4, end_bit = 8, native_type='unsigned long')]],
+    'KcbDebug' : [ 0xb8, ['BitField', dict(start_bit = 8, end_bit = 16, native_type='unsigned long')]],
+    'Flags' : [ 0xb8, ['BitField', dict(start_bit = 16, end_bit = 32, native_type='unsigned long')]],
+    'Spare3' : [ 0xbc, ['unsigned long']],
+    'LayerInfo' : [ 0xc0, ['pointer64', ['_CM_KCB_LAYER_INFO']]],
+    'RealKeyName' : [ 0xc8, ['pointer64', ['unsigned char']]],
+    'KCBUoWListHead' : [ 0xd0, ['_LIST_ENTRY']],
+    'DelayQueueEntry' : [ 0xe0, ['_LIST_ENTRY']],
+    'Stolen' : [ 0xe0, ['pointer64', ['unsigned char']]],
+    'TransKCBOwner' : [ 0xf0, ['pointer64', ['_CM_TRANS']]],
+    'KCBLock' : [ 0xf8, ['_CM_INTENT_LOCK']],
+    'KeyLock' : [ 0x108, ['_CM_INTENT_LOCK']],
+    'TransValueCache' : [ 0x118, ['_CHILD_LIST']],
+    'TransValueListOwner' : [ 0x120, ['pointer64', ['_CM_TRANS']]],
+    'FullKCBName' : [ 0x128, ['pointer64', ['_UNICODE_STRING']]],
+    'FullKCBNameStale' : [ 0x128, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long long')]],
+    'Reserved' : [ 0x128, ['BitField', dict(start_bit = 1, end_bit = 64, native_type='unsigned long long')]],
+    'SequenceNumber' : [ 0x130, ['unsigned long long']],
+} ],
+  'tagSWITCH_CONTEXT' : [ 0x358, {
+    'Attribute' : [ 0x0, ['tagSWITCH_CONTEXT_ATTRIBUTE']],
+    'Data' : [ 0x18, ['tagSWITCH_CONTEXT_DATA']],
+} ],
+  '_CM_KEY_BODY' : [ 0x60, {
+    'Type' : [ 0x0, ['unsigned long']],
+    'KeyControlBlock' : [ 0x8, ['pointer64', ['_CM_KEY_CONTROL_BLOCK']]],
+    'NotifyBlock' : [ 0x10, ['pointer64', ['_CM_NOTIFY_BLOCK']]],
+    'ProcessID' : [ 0x18, ['pointer64', ['void']]],
+    'KeyBodyList' : [ 0x20, ['_LIST_ENTRY']],
+    'Flags' : [ 0x30, ['BitField', dict(start_bit = 0, end_bit = 16, native_type='unsigned long')]],
+    'HandleTags' : [ 0x30, ['BitField', dict(start_bit = 16, end_bit = 32, native_type='unsigned long')]],
+    'Trans' : [ 0x38, ['_CM_TRANS_PTR']],
+    'KtmUow' : [ 0x40, ['pointer64', ['_GUID']]],
+    'ContextListHead' : [ 0x48, ['_LIST_ENTRY']],
+    'EnumerationResumeContext' : [ 0x58, ['pointer64', ['void']]],
+} ],
+  '_CM_KEY_NODE' : [ 0x50, {
+    'Signature' : [ 0x0, ['unsigned short']],
+    'Flags' : [ 0x2, ['unsigned short']],
+    'LastWriteTime' : [ 0x4, ['_LARGE_INTEGER']],
+    'AccessBits' : [ 0xc, ['unsigned char']],
+    'LayerSemantics' : [ 0xd, ['BitField', dict(start_bit = 0, end_bit = 2, native_type='unsigned char')]],
+    'Spare1' : [ 0xd, ['BitField', dict(start_bit = 2, end_bit = 7, native_type='unsigned char')]],
+    'InheritClass' : [ 0xd, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned char')]],
+    'Spare2' : [ 0xe, ['unsigned short']],
+    'Parent' : [ 0x10, ['unsigned long']],
+    'SubKeyCounts' : [ 0x14, ['array', 2, ['unsigned long']]],
+    'SubKeyLists' : [ 0x1c, ['array', 2, ['unsigned long']]],
+    'ValueList' : [ 0x24, ['_CHILD_LIST']],
+    'ChildHiveReference' : [ 0x1c, ['_CM_KEY_REFERENCE']],
+    'Security' : [ 0x2c, ['unsigned long']],
+    'Class' : [ 0x30, ['unsigned long']],
+    'MaxNameLen' : [ 0x34, ['BitField', dict(start_bit = 0, end_bit = 16, native_type='unsigned long')]],
+    'UserFlags' : [ 0x34, ['BitField', dict(start_bit = 16, end_bit = 20, native_type='unsigned long')]],
+    'VirtControlFlags' : [ 0x34, ['BitField', dict(start_bit = 20, end_bit = 24, native_type='unsigned long')]],
+    'Debug' : [ 0x34, ['BitField', dict(start_bit = 24, end_bit = 32, native_type='unsigned long')]],
+    'MaxClassLen' : [ 0x38, ['unsigned long']],
+    'MaxValueNameLen' : [ 0x3c, ['unsigned long']],
+    'MaxValueDataLen' : [ 0x40, ['unsigned long']],
+    'WorkVar' : [ 0x44, ['unsigned long']],
+    'NameLength' : [ 0x48, ['unsigned short']],
+    'ClassLength' : [ 0x4a, ['unsigned short']],
+    'Name' : [ 0x4c, ['array', 1, ['wchar']]],
+} ],
+  '_CM_NAME_CONTROL_BLOCK' : [ 0x20, {
+    'Compressed' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
+    'RefCount' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 32, native_type='unsigned long')]],
+    'NameHash' : [ 0x8, ['_CM_NAME_HASH']],
+    'ConvKey' : [ 0x8, ['_CM_COMPONENT_HASH']],
+    'NextHash' : [ 0x10, ['pointer64', ['_CM_KEY_HASH']]],
+    'NameLength' : [ 0x18, ['unsigned short']],
+    'Name' : [ 0x1a, ['array', 1, ['wchar']]],
+} ],
+  '_CM_KEY_VALUE' : [ 0x18, {
+    'Signature' : [ 0x0, ['unsigned short']],
+    'NameLength' : [ 0x2, ['unsigned short']],
+    'DataLength' : [ 0x4, ['unsigned long']],
+    'Data' : [ 0x8, ['unsigned long']],
+    'Type' : [ 0xc, ['unsigned long']],
+    'Flags' : [ 0x10, ['unsigned short']],
+    'Spare' : [ 0x12, ['unsigned short']],
+    'Name' : [ 0x14, ['array', 1, ['wchar']]],
+} ],
+  '_SECURITY_SUBJECT_CONTEXT' : [ 0x20, {
+    'ClientToken' : [ 0x0, ['pointer64', ['void']]],
+    'ImpersonationLevel' : [ 0x8, ['Enumeration', dict(target = 'long', choices = {0: u'SecurityAnonymous', 1: u'SecurityIdentification', 2: u'SecurityImpersonation', 3: u'SecurityDelegation'})]],
+    'PrimaryToken' : [ 0x10, ['pointer64', ['void']]],
+    'ProcessAuditId' : [ 0x18, ['pointer64', ['void']]],
+} ],
+  '_CMHIVE' : [ 0x12e8, {
+    'Hive' : [ 0x0, ['_HHIVE']],
+    'FileHandles' : [ 0x600, ['array', 6, ['pointer64', ['void']]]],
+    'NotifyList' : [ 0x630, ['_LIST_ENTRY']],
+    'HiveList' : [ 0x640, ['_LIST_ENTRY']],
+    'PreloadedHiveList' : [ 0x650, ['_LIST_ENTRY']],
+    'HiveRundown' : [ 0x660, ['_EX_RUNDOWN_REF']],
+    'KcbCacheTable' : [ 0x668, ['pointer64', ['_CM_KEY_HASH_TABLE_ENTRY']]],
+    'KcbCacheTableSize' : [ 0x670, ['unsigned long']],
+    'DeletedKcbTable' : [ 0x678, ['pointer64', ['_CM_KEY_HASH_TABLE_ENTRY']]],
+    'DeletedKcbTableSize' : [ 0x680, ['unsigned long']],
+    'Identity' : [ 0x684, ['unsigned long']],
+    'HiveLock' : [ 0x688, ['_CMSI_RW_LOCK']],
+    'FlushDirtyVector' : [ 0x690, ['_RTL_BITMAP']],
+    'FlushDirtyVectorSize' : [ 0x6a0, ['unsigned long']],
+    'FlushLogEntryOffsetArray' : [ 0x6a8, ['pointer64', ['CMP_OFFSET_ARRAY']]],
+    'FlushLogEntryOffsetArrayCount' : [ 0x6b0, ['unsigned long']],
+    'FlushLogEntrySize' : [ 0x6b4, ['unsigned long']],
+    'FlushHiveTruncated' : [ 0x6b8, ['unsigned long']],
+    'FlushBaseBlockDirty' : [ 0x6bc, ['unsigned char']],
+    'CapturedUnreconciledVector' : [ 0x6c0, ['_RTL_BITMAP']],
+    'CapturedUnreconciledVectorSize' : [ 0x6d0, ['unsigned long']],
+    'UnreconciledOffsetArray' : [ 0x6d8, ['pointer64', ['CMP_OFFSET_ARRAY']]],
+    'UnreconciledOffsetArrayCount' : [ 0x6e0, ['unsigned long']],
+    'UnreconciledBaseBlock' : [ 0x6e8, ['pointer64', ['_HBASE_BLOCK']]],
+    'SecurityLock' : [ 0x6f0, ['_EX_PUSH_LOCK']],
+    'LastShrinkHiveSize' : [ 0x6f8, ['unsigned long']],
+    'ActualFileSize' : [ 0x700, ['_LARGE_INTEGER']],
+    'LogFileSizes' : [ 0x708, ['array', 2, ['_LARGE_INTEGER']]],
+    'FileFullPath' : [ 0x718, ['_UNICODE_STRING']],
+    'FileUserName' : [ 0x728, ['_UNICODE_STRING']],
+    'HiveRootPath' : [ 0x738, ['_UNICODE_STRING']],
+    'SecurityCount' : [ 0x748, ['unsigned long']],
+    'SecurityCacheSize' : [ 0x74c, ['unsigned long']],
+    'SecurityHitHint' : [ 0x750, ['long']],
+    'SecurityCache' : [ 0x758, ['pointer64', ['_CM_KEY_SECURITY_CACHE_ENTRY']]],
+    'SecurityHash' : [ 0x760, ['array', 64, ['_LIST_ENTRY']]],
+    'UnloadEventCount' : [ 0xb60, ['unsigned long']],
+    'UnloadEventArray' : [ 0xb68, ['pointer64', ['pointer64', ['_KEVENT']]]],
+    'RootKcb' : [ 0xb70, ['pointer64', ['_CM_KEY_CONTROL_BLOCK']]],
+    'Frozen' : [ 0xb78, ['unsigned char']],
+    'UnloadWorkItem' : [ 0xb80, ['pointer64', ['_CM_WORKITEM']]],
+    'UnloadWorkItemHolder' : [ 0xb88, ['_CM_WORKITEM']],
+    'DirtyVectorLog' : [ 0xbb0, ['_CM_DIRTY_VECTOR_LOG']],
+    'Flags' : [ 0x1038, ['unsigned long']],
+    'TrustClassEntry' : [ 0x1040, ['_LIST_ENTRY']],
+    'DirtyTime' : [ 0x1050, ['unsigned long long']],
+    'UnreconciledTime' : [ 0x1058, ['unsigned long long']],
+    'CmRm' : [ 0x1060, ['pointer64', ['_CM_RM']]],
+    'CmRmInitFailPoint' : [ 0x1068, ['unsigned long']],
+    'CmRmInitFailStatus' : [ 0x106c, ['long']],
+    'CreatorOwner' : [ 0x1070, ['pointer64', ['_KTHREAD']]],
+    'RundownThread' : [ 0x1078, ['pointer64', ['_KTHREAD']]],
+    'LastWriteTime' : [ 0x1080, ['_LARGE_INTEGER']],
+    'FlushQueue' : [ 0x1088, ['_HIVE_WRITE_WAIT_QUEUE']],
+    'ReconcileQueue' : [ 0x1098, ['_HIVE_WRITE_WAIT_QUEUE']],
+    'FlushFlags' : [ 0x10a8, ['unsigned long']],
+    'PrimaryFilePurged' : [ 0x10a8, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
+    'DiskFileBad' : [ 0x10a8, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
+    'PrimaryFileSizeBeforeLastFlush' : [ 0x10ac, ['unsigned long']],
+    'ReferenceCount' : [ 0x10b0, ['long']],
+    'UnloadHistoryIndex' : [ 0x10b4, ['long']],
+    'UnloadHistory' : [ 0x10b8, ['array', 128, ['unsigned long']]],
+    'BootStart' : [ 0x12b8, ['unsigned long']],
+    'UnaccessedStart' : [ 0x12bc, ['unsigned long']],
+    'UnaccessedEnd' : [ 0x12c0, ['unsigned long']],
+    'LoadedKeyCount' : [ 0x12c4, ['unsigned long']],
+    'HandleClosePending' : [ 0x12c8, ['unsigned long']],
+    'HandleClosePendingEvent' : [ 0x12d0, ['_EX_PUSH_LOCK']],
+    'FinalFlushSucceeded' : [ 0x12d8, ['unsigned char']],
+    'VolumeContext' : [ 0x12e0, ['pointer64', ['_CMP_VOLUME_CONTEXT']]],
+} ],
+  '__unnamed_198f' : [ 0xc, {
+    'Failure' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: u'_None', 1: u'_CmCreateHive', 3: u'_HvpBuildMap', 4: u'_HvpBuildMapForLoaderHive', 5: u'_HvpInitMap', 6: u'_HvLoadHive', 7: u'_HvpMapHiveImage', 8: u'_HvpRecoverData', 9: u'_CmpValidateHiveSecurityDescriptors', 10: u'_HvpEnlistBinInMap', 11: u'_CmCheckRegistry', 12: u'_CmRegistryIO', 13: u'_CmCheckRegistry2', 14: u'_CmpCheckKey', 15: u'_CmpCheckValueList', 16: u'_HvCheckHive', 17: u'_HvCheckBin', 18: u'_HvpGetLogEntryDirtyVector', 19: u'_HvpReadLogEntryHeader', 20: u'_HvpReadLogEntry', 21: u'_CmpMountPreloadedHives', 22: u'_CmpLoadHiveThread', 23: u'_CmpCheckLeaf', 24: u'_HvHiveStartFileBacked', 25: u'_HvStartHiveMemoryBacked', 26: u'_HvpEnlistFreeCells', 27: u'_HvpPerformLogFileRecovery'})]],
+    'Status' : [ 0x4, ['long']],
+    'Point' : [ 0x8, ['unsigned long']],
+} ],
+  '__unnamed_1992' : [ 0x18, {
+    'Action' : [ 0x0, ['unsigned long']],
+    'Handle' : [ 0x8, ['pointer64', ['void']]],
+    'Status' : [ 0x10, ['long']],
+} ],
+  '__unnamed_1994' : [ 0x8, {
+    'CheckStack' : [ 0x0, ['pointer64', ['void']]],
+} ],
+  '__unnamed_1996' : [ 0x20, {
+    'Cell' : [ 0x0, ['unsigned long']],
+    'CellPoint' : [ 0x8, ['pointer64', ['_CELL_DATA']]],
+    'RootPoint' : [ 0x10, ['pointer64', ['void']]],
+    'Index' : [ 0x18, ['unsigned long']],
+} ],
+  '__unnamed_1998' : [ 0x18, {
+    'List' : [ 0x0, ['pointer64', ['_CELL_DATA']]],
+    'Index' : [ 0x8, ['unsigned long']],
+    'Cell' : [ 0xc, ['unsigned long']],
+    'CellPoint' : [ 0x10, ['pointer64', ['_CELL_DATA']]],
+} ],
+  '__unnamed_199c' : [ 0x10, {
+    'Space' : [ 0x0, ['unsigned long']],
+    'MapPoint' : [ 0x4, ['unsigned long']],
+    'BinPoint' : [ 0x8, ['pointer64', ['_HBIN']]],
+} ],
+  '__unnamed_19a0' : [ 0x10, {
+    'Bin' : [ 0x0, ['pointer64', ['_HBIN']]],
+    'CellPoint' : [ 0x8, ['pointer64', ['_HCELL']]],
+} ],
+  '__unnamed_19a2' : [ 0x4, {
+    'FileOffset' : [ 0x0, ['unsigned long']],
+} ],
+  '_HIVE_LOAD_FAILURE' : [ 0x160, {
+    'Hive' : [ 0x0, ['pointer64', ['_HHIVE']]],
+    'Index' : [ 0x8, ['unsigned short']],
+    'RecoverableIndex' : [ 0xa, ['unsigned short']],
+    'Locations' : [ 0xc, ['array', 8, ['__unnamed_198f']]],
+    'RecoverableLocations' : [ 0x6c, ['array', 8, ['__unnamed_198f']]],
+    'RegistryIO' : [ 0xd0, ['__unnamed_1992']],
+    'CheckRegistry2' : [ 0xe8, ['__unnamed_1994']],
+    'CheckKey' : [ 0xf0, ['__unnamed_1996']],
+    'CheckValueList' : [ 0x110, ['__unnamed_1998']],
+    'CheckHive' : [ 0x128, ['__unnamed_199c']],
+    'CheckHive1' : [ 0x138, ['__unnamed_199c']],
+    'CheckBin' : [ 0x148, ['__unnamed_19a0']],
+    'RecoverData' : [ 0x158, ['__unnamed_19a2']],
+} ],
+  '_CM_KCB_UOW' : [ 0x78, {
+    'TransactionListEntry' : [ 0x0, ['_LIST_ENTRY']],
+    'KCBLock' : [ 0x10, ['pointer64', ['_CM_INTENT_LOCK']]],
+    'KeyLock' : [ 0x18, ['pointer64', ['_CM_INTENT_LOCK']]],
+    'KCBListEntry' : [ 0x20, ['_LIST_ENTRY']],
+    'KeyControlBlock' : [ 0x30, ['pointer64', ['_CM_KEY_CONTROL_BLOCK']]],
+    'Transaction' : [ 0x38, ['pointer64', ['_CM_TRANS']]],
+    'UoWState' : [ 0x40, ['unsigned long']],
+    'ActionType' : [ 0x44, ['Enumeration', dict(target = 'long', choices = {0: u'UoWAddThisKey', 1: u'UoWAddChildKey', 2: u'UoWDeleteThisKey', 3: u'UoWDeleteChildKey', 4: u'UoWSetValueNew', 5: u'UoWSetValueExisting', 6: u'UoWDeleteValue', 7: u'UoWSetKeyUserFlags', 8: u'UoWSetLastWriteTime', 9: u'UoWSetSecurityDescriptor', 10: u'UoWRenameSubKey', 11: u'UoWRenameOldSubKey', 12: u'UoWRenameNewSubKey', 13: u'UoWIsolation', 14: u'UoWInvalid'})]],
+    'StorageType' : [ 0x48, ['Enumeration', dict(target = 'long', choices = {0: u'Stable', 1: u'Volatile', 2: u'InvalidStorage'})]],
+    'ParentUoW' : [ 0x50, ['pointer64', ['_CM_KCB_UOW']]],
+    'ChildKCB' : [ 0x58, ['pointer64', ['_CM_KEY_CONTROL_BLOCK']]],
+    'VolatileKeyCell' : [ 0x58, ['unsigned long']],
+    'OldValueCell' : [ 0x58, ['unsigned long']],
+    'NewValueCell' : [ 0x5c, ['unsigned long']],
+    'UserFlags' : [ 0x58, ['unsigned long']],
+    'LastWriteTime' : [ 0x58, ['_LARGE_INTEGER']],
+    'TxCachedSecurity' : [ 0x58, ['pointer64', ['_CM_KEY_SECURITY_CACHE']]],
+    'TxSecurityCell' : [ 0x60, ['unsigned long']],
+    'OldChildKCB' : [ 0x58, ['pointer64', ['_CM_KEY_CONTROL_BLOCK']]],
+    'NewChildKCB' : [ 0x60, ['pointer64', ['_CM_KEY_CONTROL_BLOCK']]],
+    'OtherChildKCB' : [ 0x58, ['pointer64', ['_CM_KEY_CONTROL_BLOCK']]],
+    'ThisVolatileKeyCell' : [ 0x60, ['unsigned long']],
+    'PrepareDataPointer' : [ 0x68, ['pointer64', ['void']]],
+    'SecurityData' : [ 0x68, ['pointer64', ['_CM_UOW_SET_SD_DATA']]],
+    'ModifyKeysData' : [ 0x68, ['pointer64', ['_CM_UOW_KEY_STATE_MODIFICATION']]],
+    'SetValueData' : [ 0x68, ['pointer64', ['_CM_UOW_SET_VALUE_LIST_DATA']]],
+    'ValueData' : [ 0x70, ['pointer64', ['_CM_UOW_SET_VALUE_KEY_DATA']]],
+    'DiscardReplaceContext' : [ 0x70, ['pointer64', ['_CMP_DISCARD_AND_REPLACE_KCB_CONTEXT']]],
+} ],
+  '_CM_TRANS' : [ 0xb8, {
+    'TransactionListEntry' : [ 0x0, ['_LIST_ENTRY']],
+    'KCBUoWListHead' : [ 0x10, ['_LIST_ENTRY']],
+    'LazyCommitListEntry' : [ 0x20, ['_LIST_ENTRY']],
+    'Prepared' : [ 0x30, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
+    'Aborted' : [ 0x30, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
+    'Committed' : [ 0x30, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
+    'Initializing' : [ 0x30, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
+    'Invalid' : [ 0x30, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
+    'UseReservation' : [ 0x30, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
+    'TmCallbacksActive' : [ 0x30, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
+    'LightWeight' : [ 0x30, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
+    'Freed1' : [ 0x30, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long')]],
+    'Freed2' : [ 0x30, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long')]],
+    'Spare1' : [ 0x30, ['BitField', dict(start_bit = 10, end_bit = 12, native_type='unsigned long')]],
+    'Freed' : [ 0x30, ['BitField', dict(start_bit = 12, end_bit = 13, native_type='unsigned long')]],
+    'Spare' : [ 0x30, ['BitField', dict(start_bit = 13, end_bit = 32, native_type='unsigned long')]],
+    'TransState' : [ 0x30, ['unsigned long']],
+    'Trans' : [ 0x38, ['_CM_TRANS_PTR']],
+    'CmRm' : [ 0x40, ['pointer64', ['_CM_RM']]],
+    'KtmEnlistmentObject' : [ 0x48, ['pointer64', ['_KENLISTMENT']]],
+    'KtmEnlistmentHandle' : [ 0x50, ['pointer64', ['void']]],
+    'KtmUow' : [ 0x58, ['_GUID']],
+    'StartLsn' : [ 0x68, ['unsigned long long']],
+    'HiveCount' : [ 0x70, ['unsigned long']],
+    'HiveArray' : [ 0x78, ['array', 8, ['pointer64', ['_CMHIVE']]]],
+} ],
+  '_PCW_COUNTER_DESCRIPTOR' : [ 0x8, {
+    'Id' : [ 0x0, ['unsigned short']],
+    'StructIndex' : [ 0x2, ['unsigned short']],
+    'Offset' : [ 0x4, ['unsigned short']],
+    'Size' : [ 0x6, ['unsigned short']],
+} ],
+  '_PCW_REGISTRATION_INFORMATION' : [ 0x30, {
+    'Version' : [ 0x0, ['unsigned long']],
+    'Name' : [ 0x8, ['pointer64', ['_UNICODE_STRING']]],
+    'CounterCount' : [ 0x10, ['unsigned long']],
+    'Counters' : [ 0x18, ['pointer64', ['_PCW_COUNTER_DESCRIPTOR']]],
+    'Callback' : [ 0x20, ['pointer64', ['void']]],
+    'CallbackContext' : [ 0x28, ['pointer64', ['void']]],
+} ],
+  '_PCW_PROCESSOR_INFO' : [ 0xc0, {
+    'IdleTime' : [ 0x0, ['unsigned long long']],
+    'AvailableTime' : [ 0x8, ['unsigned long long']],
+    'UserTime' : [ 0x10, ['unsigned long long']],
+    'KernelTime' : [ 0x18, ['unsigned long long']],
+    'Interrupts' : [ 0x20, ['unsigned long']],
+    'DpcTime' : [ 0x28, ['unsigned long long']],
+    'InterruptTime' : [ 0x30, ['unsigned long long']],
+    'ClockInterrupts' : [ 0x38, ['unsigned long']],
+    'DpcCount' : [ 0x3c, ['unsigned long']],
+    'DpcRate' : [ 0x40, ['unsigned long']],
+    'C1Time' : [ 0x48, ['unsigned long long']],
+    'C2Time' : [ 0x50, ['unsigned long long']],
+    'C3Time' : [ 0x58, ['unsigned long long']],
+    'C1Transitions' : [ 0x60, ['unsigned long long']],
+    'C2Transitions' : [ 0x68, ['unsigned long long']],
+    'C3Transitions' : [ 0x70, ['unsigned long long']],
+    'StallTime' : [ 0x78, ['unsigned long long']],
+    'ParkingStatus' : [ 0x80, ['unsigned long']],
+    'CurrentFrequency' : [ 0x84, ['unsigned long']],
+    'PercentMaxFrequency' : [ 0x88, ['unsigned long']],
+    'StateFlags' : [ 0x8c, ['unsigned long']],
+    'NominalThroughput' : [ 0x90, ['unsigned long']],
+    'ActiveThroughput' : [ 0x94, ['unsigned long']],
+    'ScaledThroughput' : [ 0x98, ['unsigned long long']],
+    'ScaledKernelThroughput' : [ 0xa0, ['unsigned long long']],
+    'AverageIdleTime' : [ 0xa8, ['unsigned long long']],
+    'IdleBreakEvents' : [ 0xb0, ['unsigned long long']],
+    'PerformanceLimit' : [ 0xb8, ['unsigned long']],
+    'PerformanceLimitFlags' : [ 0xbc, ['unsigned long']],
+} ],
+  '_PCW_DATA' : [ 0x10, {
+    'Data' : [ 0x0, ['pointer64', ['void']]],
+    'Size' : [ 0x8, ['unsigned long']],
+} ],
+  '_SYNCH_COUNTERS' : [ 0xb8, {
+    'SpinLockAcquireCount' : [ 0x0, ['unsigned long']],
+    'SpinLockContentionCount' : [ 0x4, ['unsigned long']],
+    'SpinLockSpinCount' : [ 0x8, ['unsigned long']],
+    'IpiSendRequestBroadcastCount' : [ 0xc, ['unsigned long']],
+    'IpiSendRequestRoutineCount' : [ 0x10, ['unsigned long']],
+    'IpiSendSoftwareInterruptCount' : [ 0x14, ['unsigned long']],
+    'ExInitializeResourceCount' : [ 0x18, ['unsigned long']],
+    'ExReInitializeResourceCount' : [ 0x1c, ['unsigned long']],
+    'ExDeleteResourceCount' : [ 0x20, ['unsigned long']],
+    'ExecutiveResourceAcquiresCount' : [ 0x24, ['unsigned long']],
+    'ExecutiveResourceContentionsCount' : [ 0x28, ['unsigned long']],
+    'ExecutiveResourceReleaseExclusiveCount' : [ 0x2c, ['unsigned long']],
+    'ExecutiveResourceReleaseSharedCount' : [ 0x30, ['unsigned long']],
+    'ExecutiveResourceConvertsCount' : [ 0x34, ['unsigned long']],
+    'ExAcqResExclusiveAttempts' : [ 0x38, ['unsigned long']],
+    'ExAcqResExclusiveAcquiresExclusive' : [ 0x3c, ['unsigned long']],
+    'ExAcqResExclusiveAcquiresExclusiveRecursive' : [ 0x40, ['unsigned long']],
+    'ExAcqResExclusiveWaits' : [ 0x44, ['unsigned long']],
+    'ExAcqResExclusiveNotAcquires' : [ 0x48, ['unsigned long']],
+    'ExAcqResSharedAttempts' : [ 0x4c, ['unsigned long']],
+    'ExAcqResSharedAcquiresExclusive' : [ 0x50, ['unsigned long']],
+    'ExAcqResSharedAcquiresShared' : [ 0x54, ['unsigned long']],
+    'ExAcqResSharedAcquiresSharedRecursive' : [ 0x58, ['unsigned long']],
+    'ExAcqResSharedWaits' : [ 0x5c, ['unsigned long']],
+    'ExAcqResSharedNotAcquires' : [ 0x60, ['unsigned long']],
+    'ExAcqResSharedStarveExclusiveAttempts' : [ 0x64, ['unsigned long']],
+    'ExAcqResSharedStarveExclusiveAcquiresExclusive' : [ 0x68, ['unsigned long']],
+    'ExAcqResSharedStarveExclusiveAcquiresShared' : [ 0x6c, ['unsigned long']],
+    'ExAcqResSharedStarveExclusiveAcquiresSharedRecursive' : [ 0x70, ['unsigned long']],
+    'ExAcqResSharedStarveExclusiveWaits' : [ 0x74, ['unsigned long']],
+    'ExAcqResSharedStarveExclusiveNotAcquires' : [ 0x78, ['unsigned long']],
+    'ExAcqResSharedWaitForExclusiveAttempts' : [ 0x7c, ['unsigned long']],
+    'ExAcqResSharedWaitForExclusiveAcquiresExclusive' : [ 0x80, ['unsigned long']],
+    'ExAcqResSharedWaitForExclusiveAcquiresShared' : [ 0x84, ['unsigned long']],
+    'ExAcqResSharedWaitForExclusiveAcquiresSharedRecursive' : [ 0x88, ['unsigned long']],
+    'ExAcqResSharedWaitForExclusiveWaits' : [ 0x8c, ['unsigned long']],
+    'ExAcqResSharedWaitForExclusiveNotAcquires' : [ 0x90, ['unsigned long']],
+    'ExSetResOwnerPointerExclusive' : [ 0x94, ['unsigned long']],
+    'ExSetResOwnerPointerSharedNew' : [ 0x98, ['unsigned long']],
+    'ExSetResOwnerPointerSharedOld' : [ 0x9c, ['unsigned long']],
+    'ExTryToAcqExclusiveAttempts' : [ 0xa0, ['unsigned long']],
+    'ExTryToAcqExclusiveAcquires' : [ 0xa4, ['unsigned long']],
+    'ExBoostExclusiveOwner' : [ 0xa8, ['unsigned long']],
+    'ExBoostSharedOwners' : [ 0xac, ['unsigned long']],
+    'ExEtwSynchTrackingNotificationsCount' : [ 0xb0, ['unsigned long']],
+    'ExEtwSynchTrackingNotificationsAccountedCount' : [ 0xb4, ['unsigned long']],
+} ],
+  '_ETW_PERF_COUNTERS' : [ 0x18, {
+    'TotalActiveSessions' : [ 0x0, ['long']],
+    'TotalBufferMemoryNonPagedPool' : [ 0x4, ['long']],
+    'TotalBufferMemoryPagedPool' : [ 0x8, ['long']],
+    'TotalGuidsEnabled' : [ 0xc, ['long']],
+    'TotalGuidsNotEnabled' : [ 0x10, ['long']],
+    'TotalGuidsPreEnabled' : [ 0x14, ['long']],
+} ],
+  '_ETW_SESSION_PERF_COUNTERS' : [ 0x18, {
+    'BufferMemoryPagedPool' : [ 0x0, ['long']],
+    'BufferMemoryNonPagedPool' : [ 0x4, ['long']],
+    'EventsLoggedCount' : [ 0x8, ['unsigned long long']],
+    'EventsLost' : [ 0x10, ['long']],
+    'NumConsumers' : [ 0x14, ['long']],
+} ],
+  '_FILESYSTEM_DISK_COUNTERS' : [ 0x10, {
+    'FsBytesRead' : [ 0x0, ['unsigned long long']],
+    'FsBytesWritten' : [ 0x8, ['unsigned long long']],
+} ],
+  '_THERMAL_ZONE_COUNTERS' : [ 0x10, {
+    'Temperature' : [ 0x0, ['unsigned long']],
+    'ThrottleLimit' : [ 0x4, ['unsigned long']],
+    'ThrottleReasons' : [ 0x8, ['unsigned long']],
+    'TemperatureHighPrecision' : [ 0xc, ['unsigned long']],
+} ],
+  '_TEB32' : [ 0x1000, {
+    'NtTib' : [ 0x0, ['_NT_TIB32']],
+    'EnvironmentPointer' : [ 0x1c, ['unsigned long']],
+    'ClientId' : [ 0x20, ['_CLIENT_ID32']],
+    'ActiveRpcHandle' : [ 0x28, ['unsigned long']],
+    'ThreadLocalStoragePointer' : [ 0x2c, ['unsigned long']],
+    'ProcessEnvironmentBlock' : [ 0x30, ['unsigned long']],
+    'LastErrorValue' : [ 0x34, ['unsigned long']],
+    'CountOfOwnedCriticalSections' : [ 0x38, ['unsigned long']],
+    'CsrClientThread' : [ 0x3c, ['unsigned long']],
+    'Win32ThreadInfo' : [ 0x40, ['unsigned long']],
+    'User32Reserved' : [ 0x44, ['array', 26, ['unsigned long']]],
+    'UserReserved' : [ 0xac, ['array', 5, ['unsigned long']]],
+    'WOW32Reserved' : [ 0xc0, ['unsigned long']],
+    'CurrentLocale' : [ 0xc4, ['unsigned long']],
+    'FpSoftwareStatusRegister' : [ 0xc8, ['unsigned long']],
+    'ReservedForDebuggerInstrumentation' : [ 0xcc, ['array', 16, ['unsigned long']]],
+    'SystemReserved1' : [ 0x10c, ['array', 26, ['unsigned long']]],
+    'PlaceholderCompatibilityMode' : [ 0x174, ['unsigned char']],
+    'PlaceholderHydrationAlwaysExplicit' : [ 0x175, ['unsigned char']],
+    'PlaceholderReserved' : [ 0x176, ['array', 10, ['unsigned char']]],
+    'ProxiedProcessId' : [ 0x180, ['unsigned long']],
+    '_ActivationStack' : [ 0x184, ['_ACTIVATION_CONTEXT_STACK32']],
+    'WorkingOnBehalfTicket' : [ 0x19c, ['array', 8, ['unsigned char']]],
+    'ExceptionCode' : [ 0x1a4, ['long']],
+    'ActivationContextStackPointer' : [ 0x1a8, ['unsigned long']],
+    'InstrumentationCallbackSp' : [ 0x1ac, ['unsigned long']],
+    'InstrumentationCallbackPreviousPc' : [ 0x1b0, ['unsigned long']],
+    'InstrumentationCallbackPreviousSp' : [ 0x1b4, ['unsigned long']],
+    'InstrumentationCallbackDisabled' : [ 0x1b8, ['unsigned char']],
+    'SpareBytes' : [ 0x1b9, ['array', 23, ['unsigned char']]],
+    'TxFsContext' : [ 0x1d0, ['unsigned long']],
+    'GdiTebBatch' : [ 0x1d4, ['_GDI_TEB_BATCH32']],
+    'RealClientId' : [ 0x6b4, ['_CLIENT_ID32']],
+    'GdiCachedProcessHandle' : [ 0x6bc, ['unsigned long']],
+    'GdiClientPID' : [ 0x6c0, ['unsigned long']],
+    'GdiClientTID' : [ 0x6c4, ['unsigned long']],
+    'GdiThreadLocalInfo' : [ 0x6c8, ['unsigned long']],
+    'Win32ClientInfo' : [ 0x6cc, ['array', 62, ['unsigned long']]],
+    'glDispatchTable' : [ 0x7c4, ['array', 233, ['unsigned long']]],
+    'glReserved1' : [ 0xb68, ['array', 29, ['unsigned long']]],
+    'glReserved2' : [ 0xbdc, ['unsigned long']],
+    'glSectionInfo' : [ 0xbe0, ['unsigned long']],
+    'glSection' : [ 0xbe4, ['unsigned long']],
+    'glTable' : [ 0xbe8, ['unsigned long']],
+    'glCurrentRC' : [ 0xbec, ['unsigned long']],
+    'glContext' : [ 0xbf0, ['unsigned long']],
+    'LastStatusValue' : [ 0xbf4, ['unsigned long']],
+    'StaticUnicodeString' : [ 0xbf8, ['_STRING32']],
+    'StaticUnicodeBuffer' : [ 0xc00, ['array', 261, ['wchar']]],
+    'DeallocationStack' : [ 0xe0c, ['unsigned long']],
+    'TlsSlots' : [ 0xe10, ['array', 64, ['unsigned long']]],
+    'TlsLinks' : [ 0xf10, ['LIST_ENTRY32']],
+    'Vdm' : [ 0xf18, ['unsigned long']],
+    'ReservedForNtRpc' : [ 0xf1c, ['unsigned long']],
+    'DbgSsReserved' : [ 0xf20, ['array', 2, ['unsigned long']]],
+    'HardErrorMode' : [ 0xf28, ['unsigned long']],
+    'Instrumentation' : [ 0xf2c, ['array', 9, ['unsigned long']]],
+    'ActivityId' : [ 0xf50, ['_GUID']],
+    'SubProcessTag' : [ 0xf60, ['unsigned long']],
+    'PerflibData' : [ 0xf64, ['unsigned long']],
+    'EtwTraceData' : [ 0xf68, ['unsigned long']],
+    'WinSockData' : [ 0xf6c, ['unsigned long']],
+    'GdiBatchCount' : [ 0xf70, ['unsigned long']],
+    'CurrentIdealProcessor' : [ 0xf74, ['_PROCESSOR_NUMBER']],
+    'IdealProcessorValue' : [ 0xf74, ['unsigned long']],
+    'ReservedPad0' : [ 0xf74, ['unsigned char']],
+    'ReservedPad1' : [ 0xf75, ['unsigned char']],
+    'ReservedPad2' : [ 0xf76, ['unsigned char']],
+    'IdealProcessor' : [ 0xf77, ['unsigned char']],
+    'GuaranteedStackBytes' : [ 0xf78, ['unsigned long']],
+    'ReservedForPerf' : [ 0xf7c, ['unsigned long']],
+    'ReservedForOle' : [ 0xf80, ['unsigned long']],
+    'WaitingOnLoaderLock' : [ 0xf84, ['unsigned long']],
+    'SavedPriorityState' : [ 0xf88, ['unsigned long']],
+    'ReservedForCodeCoverage' : [ 0xf8c, ['unsigned long']],
+    'ThreadPoolData' : [ 0xf90, ['unsigned long']],
+    'TlsExpansionSlots' : [ 0xf94, ['unsigned long']],
+    'MuiGeneration' : [ 0xf98, ['unsigned long']],
+    'IsImpersonating' : [ 0xf9c, ['unsigned long']],
+    'NlsCache' : [ 0xfa0, ['unsigned long']],
+    'pShimData' : [ 0xfa4, ['unsigned long']],
+    'HeapData' : [ 0xfa8, ['unsigned long']],
+    'CurrentTransactionHandle' : [ 0xfac, ['unsigned long']],
+    'ActiveFrame' : [ 0xfb0, ['unsigned long']],
+    'FlsData' : [ 0xfb4, ['unsigned long']],
+    'PreferredLanguages' : [ 0xfb8, ['unsigned long']],
+    'UserPrefLanguages' : [ 0xfbc, ['unsigned long']],
+    'MergedPrefLanguages' : [ 0xfc0, ['unsigned long']],
+    'MuiImpersonation' : [ 0xfc4, ['unsigned long']],
+    'CrossTebFlags' : [ 0xfc8, ['unsigned short']],
+    'SpareCrossTebBits' : [ 0xfc8, ['BitField', dict(start_bit = 0, end_bit = 16, native_type='unsigned short')]],
+    'SameTebFlags' : [ 0xfca, ['unsigned short']],
+    'SafeThunkCall' : [ 0xfca, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned short')]],
+    'InDebugPrint' : [ 0xfca, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned short')]],
+    'HasFiberData' : [ 0xfca, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned short')]],
+    'SkipThreadAttach' : [ 0xfca, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned short')]],
+    'WerInShipAssertCode' : [ 0xfca, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned short')]],
+    'RanProcessInit' : [ 0xfca, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned short')]],
+    'ClonedThread' : [ 0xfca, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned short')]],
+    'SuppressDebugMsg' : [ 0xfca, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned short')]],
+    'DisableUserStackWalk' : [ 0xfca, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned short')]],
+    'RtlExceptionAttached' : [ 0xfca, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned short')]],
+    'InitialThread' : [ 0xfca, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned short')]],
+    'SessionAware' : [ 0xfca, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned short')]],
+    'LoadOwner' : [ 0xfca, ['BitField', dict(start_bit = 12, end_bit = 13, native_type='unsigned short')]],
+    'LoaderWorker' : [ 0xfca, ['BitField', dict(start_bit = 13, end_bit = 14, native_type='unsigned short')]],
+    'SkipLoaderInit' : [ 0xfca, ['BitField', dict(start_bit = 14, end_bit = 15, native_type='unsigned short')]],
+    'SpareSameTebBits' : [ 0xfca, ['BitField', dict(start_bit = 15, end_bit = 16, native_type='unsigned short')]],
+    'TxnScopeEnterCallback' : [ 0xfcc, ['unsigned long']],
+    'TxnScopeExitCallback' : [ 0xfd0, ['unsigned long']],
+    'TxnScopeContext' : [ 0xfd4, ['unsigned long']],
+    'LockCount' : [ 0xfd8, ['unsigned long']],
+    'WowTebOffset' : [ 0xfdc, ['long']],
+    'ResourceRetValue' : [ 0xfe0, ['unsigned long']],
+    'ReservedForWdf' : [ 0xfe4, ['unsigned long']],
+    'ReservedForCrt' : [ 0xfe8, ['unsigned long long']],
+    'EffectiveContainerId' : [ 0xff0, ['_GUID']],
+} ],
+  '_TEB64' : [ 0x1838, {
+    'NtTib' : [ 0x0, ['_NT_TIB64']],
+    'EnvironmentPointer' : [ 0x38, ['unsigned long long']],
+    'ClientId' : [ 0x40, ['_CLIENT_ID64']],
+    'ActiveRpcHandle' : [ 0x50, ['unsigned long long']],
+    'ThreadLocalStoragePointer' : [ 0x58, ['unsigned long long']],
+    'ProcessEnvironmentBlock' : [ 0x60, ['unsigned long long']],
+    'LastErrorValue' : [ 0x68, ['unsigned long']],
+    'CountOfOwnedCriticalSections' : [ 0x6c, ['unsigned long']],
+    'CsrClientThread' : [ 0x70, ['unsigned long long']],
+    'Win32ThreadInfo' : [ 0x78, ['unsigned long long']],
+    'User32Reserved' : [ 0x80, ['array', 26, ['unsigned long']]],
+    'UserReserved' : [ 0xe8, ['array', 5, ['unsigned long']]],
+    'WOW32Reserved' : [ 0x100, ['unsigned long long']],
+    'CurrentLocale' : [ 0x108, ['unsigned long']],
+    'FpSoftwareStatusRegister' : [ 0x10c, ['unsigned long']],
+    'ReservedForDebuggerInstrumentation' : [ 0x110, ['array', 16, ['unsigned long long']]],
+    'SystemReserved1' : [ 0x190, ['array', 30, ['unsigned long long']]],
+    'PlaceholderCompatibilityMode' : [ 0x280, ['unsigned char']],
+    'PlaceholderHydrationAlwaysExplicit' : [ 0x281, ['unsigned char']],
+    'PlaceholderReserved' : [ 0x282, ['array', 10, ['unsigned char']]],
+    'ProxiedProcessId' : [ 0x28c, ['unsigned long']],
+    '_ActivationStack' : [ 0x290, ['_ACTIVATION_CONTEXT_STACK64']],
+    'WorkingOnBehalfTicket' : [ 0x2b8, ['array', 8, ['unsigned char']]],
+    'ExceptionCode' : [ 0x2c0, ['long']],
+    'Padding0' : [ 0x2c4, ['array', 4, ['unsigned char']]],
+    'ActivationContextStackPointer' : [ 0x2c8, ['unsigned long long']],
+    'InstrumentationCallbackSp' : [ 0x2d0, ['unsigned long long']],
+    'InstrumentationCallbackPreviousPc' : [ 0x2d8, ['unsigned long long']],
+    'InstrumentationCallbackPreviousSp' : [ 0x2e0, ['unsigned long long']],
+    'TxFsContext' : [ 0x2e8, ['unsigned long']],
+    'InstrumentationCallbackDisabled' : [ 0x2ec, ['unsigned char']],
+    'UnalignedLoadStoreExceptions' : [ 0x2ed, ['unsigned char']],
+    'Padding1' : [ 0x2ee, ['array', 2, ['unsigned char']]],
+    'GdiTebBatch' : [ 0x2f0, ['_GDI_TEB_BATCH64']],
+    'RealClientId' : [ 0x7d8, ['_CLIENT_ID64']],
+    'GdiCachedProcessHandle' : [ 0x7e8, ['unsigned long long']],
+    'GdiClientPID' : [ 0x7f0, ['unsigned long']],
+    'GdiClientTID' : [ 0x7f4, ['unsigned long']],
+    'GdiThreadLocalInfo' : [ 0x7f8, ['unsigned long long']],
+    'Win32ClientInfo' : [ 0x800, ['array', 62, ['unsigned long long']]],
+    'glDispatchTable' : [ 0x9f0, ['array', 233, ['unsigned long long']]],
+    'glReserved1' : [ 0x1138, ['array', 29, ['unsigned long long']]],
+    'glReserved2' : [ 0x1220, ['unsigned long long']],
+    'glSectionInfo' : [ 0x1228, ['unsigned long long']],
+    'glSection' : [ 0x1230, ['unsigned long long']],
+    'glTable' : [ 0x1238, ['unsigned long long']],
+    'glCurrentRC' : [ 0x1240, ['unsigned long long']],
+    'glContext' : [ 0x1248, ['unsigned long long']],
+    'LastStatusValue' : [ 0x1250, ['unsigned long']],
+    'Padding2' : [ 0x1254, ['array', 4, ['unsigned char']]],
+    'StaticUnicodeString' : [ 0x1258, ['_STRING64']],
+    'StaticUnicodeBuffer' : [ 0x1268, ['array', 261, ['wchar']]],
+    'Padding3' : [ 0x1472, ['array', 6, ['unsigned char']]],
+    'DeallocationStack' : [ 0x1478, ['unsigned long long']],
+    'TlsSlots' : [ 0x1480, ['array', 64, ['unsigned long long']]],
+    'TlsLinks' : [ 0x1680, ['LIST_ENTRY64']],
+    'Vdm' : [ 0x1690, ['unsigned long long']],
+    'ReservedForNtRpc' : [ 0x1698, ['unsigned long long']],
+    'DbgSsReserved' : [ 0x16a0, ['array', 2, ['unsigned long long']]],
+    'HardErrorMode' : [ 0x16b0, ['unsigned long']],
+    'Padding4' : [ 0x16b4, ['array', 4, ['unsigned char']]],
+    'Instrumentation' : [ 0x16b8, ['array', 11, ['unsigned long long']]],
+    'ActivityId' : [ 0x1710, ['_GUID']],
+    'SubProcessTag' : [ 0x1720, ['unsigned long long']],
+    'PerflibData' : [ 0x1728, ['unsigned long long']],
+    'EtwTraceData' : [ 0x1730, ['unsigned long long']],
+    'WinSockData' : [ 0x1738, ['unsigned long long']],
+    'GdiBatchCount' : [ 0x1740, ['unsigned long']],
+    'CurrentIdealProcessor' : [ 0x1744, ['_PROCESSOR_NUMBER']],
+    'IdealProcessorValue' : [ 0x1744, ['unsigned long']],
+    'ReservedPad0' : [ 0x1744, ['unsigned char']],
+    'ReservedPad1' : [ 0x1745, ['unsigned char']],
+    'ReservedPad2' : [ 0x1746, ['unsigned char']],
+    'IdealProcessor' : [ 0x1747, ['unsigned char']],
+    'GuaranteedStackBytes' : [ 0x1748, ['unsigned long']],
+    'Padding5' : [ 0x174c, ['array', 4, ['unsigned char']]],
+    'ReservedForPerf' : [ 0x1750, ['unsigned long long']],
+    'ReservedForOle' : [ 0x1758, ['unsigned long long']],
+    'WaitingOnLoaderLock' : [ 0x1760, ['unsigned long']],
+    'Padding6' : [ 0x1764, ['array', 4, ['unsigned char']]],
+    'SavedPriorityState' : [ 0x1768, ['unsigned long long']],
+    'ReservedForCodeCoverage' : [ 0x1770, ['unsigned long long']],
+    'ThreadPoolData' : [ 0x1778, ['unsigned long long']],
+    'TlsExpansionSlots' : [ 0x1780, ['unsigned long long']],
+    'DeallocationBStore' : [ 0x1788, ['unsigned long long']],
+    'BStoreLimit' : [ 0x1790, ['unsigned long long']],
+    'MuiGeneration' : [ 0x1798, ['unsigned long']],
+    'IsImpersonating' : [ 0x179c, ['unsigned long']],
+    'NlsCache' : [ 0x17a0, ['unsigned long long']],
+    'pShimData' : [ 0x17a8, ['unsigned long long']],
+    'HeapData' : [ 0x17b0, ['unsigned long']],
+    'Padding7' : [ 0x17b4, ['array', 4, ['unsigned char']]],
+    'CurrentTransactionHandle' : [ 0x17b8, ['unsigned long long']],
+    'ActiveFrame' : [ 0x17c0, ['unsigned long long']],
+    'FlsData' : [ 0x17c8, ['unsigned long long']],
+    'PreferredLanguages' : [ 0x17d0, ['unsigned long long']],
+    'UserPrefLanguages' : [ 0x17d8, ['unsigned long long']],
+    'MergedPrefLanguages' : [ 0x17e0, ['unsigned long long']],
+    'MuiImpersonation' : [ 0x17e8, ['unsigned long']],
+    'CrossTebFlags' : [ 0x17ec, ['unsigned short']],
+    'SpareCrossTebBits' : [ 0x17ec, ['BitField', dict(start_bit = 0, end_bit = 16, native_type='unsigned short')]],
+    'SameTebFlags' : [ 0x17ee, ['unsigned short']],
+    'SafeThunkCall' : [ 0x17ee, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned short')]],
+    'InDebugPrint' : [ 0x17ee, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned short')]],
+    'HasFiberData' : [ 0x17ee, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned short')]],
+    'SkipThreadAttach' : [ 0x17ee, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned short')]],
+    'WerInShipAssertCode' : [ 0x17ee, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned short')]],
+    'RanProcessInit' : [ 0x17ee, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned short')]],
+    'ClonedThread' : [ 0x17ee, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned short')]],
+    'SuppressDebugMsg' : [ 0x17ee, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned short')]],
+    'DisableUserStackWalk' : [ 0x17ee, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned short')]],
+    'RtlExceptionAttached' : [ 0x17ee, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned short')]],
+    'InitialThread' : [ 0x17ee, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned short')]],
+    'SessionAware' : [ 0x17ee, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned short')]],
+    'LoadOwner' : [ 0x17ee, ['BitField', dict(start_bit = 12, end_bit = 13, native_type='unsigned short')]],
+    'LoaderWorker' : [ 0x17ee, ['BitField', dict(start_bit = 13, end_bit = 14, native_type='unsigned short')]],
+    'SkipLoaderInit' : [ 0x17ee, ['BitField', dict(start_bit = 14, end_bit = 15, native_type='unsigned short')]],
+    'SpareSameTebBits' : [ 0x17ee, ['BitField', dict(start_bit = 15, end_bit = 16, native_type='unsigned short')]],
+    'TxnScopeEnterCallback' : [ 0x17f0, ['unsigned long long']],
+    'TxnScopeExitCallback' : [ 0x17f8, ['unsigned long long']],
+    'TxnScopeContext' : [ 0x1800, ['unsigned long long']],
+    'LockCount' : [ 0x1808, ['unsigned long']],
+    'WowTebOffset' : [ 0x180c, ['long']],
+    'ResourceRetValue' : [ 0x1810, ['unsigned long long']],
+    'ReservedForWdf' : [ 0x1818, ['unsigned long long']],
+    'ReservedForCrt' : [ 0x1820, ['unsigned long long']],
+    'EffectiveContainerId' : [ 0x1828, ['_GUID']],
+} ],
+  '_HV_X64_HYPERVISOR_FEATURES' : [ 0x10, {
+    'PartitionPrivileges' : [ 0x0, ['_HV_PARTITION_PRIVILEGE_MASK']],
+    'MaxSupportedCState' : [ 0x8, ['BitField', dict(start_bit = 0, end_bit = 4, native_type='unsigned long')]],
+    'HpetNeededForC3PowerState_Deprecated' : [ 0x8, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
+    'Reserved' : [ 0x8, ['BitField', dict(start_bit = 5, end_bit = 32, native_type='unsigned long')]],
+    'MwaitAvailable_Deprecated' : [ 0xc, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
+    'GuestDebuggingAvailable' : [ 0xc, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
+    'PerformanceMonitorsAvailable' : [ 0xc, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
+    'CpuDynamicPartitioningAvailable' : [ 0xc, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
+    'XmmRegistersForFastHypercallAvailable' : [ 0xc, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
+    'GuestIdleAvailable' : [ 0xc, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
+    'HypervisorSleepStateSupportAvailable' : [ 0xc, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
+    'NumaDistanceQueryAvailable' : [ 0xc, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
+    'FrequencyRegsAvailable' : [ 0xc, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long')]],
+    'SyntheticMachineCheckAvailable' : [ 0xc, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long')]],
+    'GuestCrashRegsAvailable' : [ 0xc, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned long')]],
+    'DebugRegsAvailable' : [ 0xc, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned long')]],
+    'Npiep1Available' : [ 0xc, ['BitField', dict(start_bit = 12, end_bit = 13, native_type='unsigned long')]],
+    'DisableHypervisorAvailable' : [ 0xc, ['BitField', dict(start_bit = 13, end_bit = 14, native_type='unsigned long')]],
+    'ExtendedGvaRangesForFlushVirtualAddressListAvailable' : [ 0xc, ['BitField', dict(start_bit = 14, end_bit = 15, native_type='unsigned long')]],
+    'FastHypercallOutputAvailable' : [ 0xc, ['BitField', dict(start_bit = 15, end_bit = 16, native_type='unsigned long')]],
+    'SvmFeaturesAvailable' : [ 0xc, ['BitField', dict(start_bit = 16, end_bit = 17, native_type='unsigned long')]],
+    'SintPollingModeAvailable' : [ 0xc, ['BitField', dict(start_bit = 17, end_bit = 18, native_type='unsigned long')]],
+    'HypercallMsrLockAvailable' : [ 0xc, ['BitField', dict(start_bit = 18, end_bit = 19, native_type='unsigned long')]],
+    'DirectSyntheticTimers' : [ 0xc, ['BitField', dict(start_bit = 19, end_bit = 20, native_type='unsigned long')]],
+    'RegisterPatAvailable' : [ 0xc, ['BitField', dict(start_bit = 20, end_bit = 21, native_type='unsigned long')]],
+    'RegisterBndcfgsAvailable' : [ 0xc, ['BitField', dict(start_bit = 21, end_bit = 22, native_type='unsigned long')]],
+    'WatchdogTimerAvailable' : [ 0xc, ['BitField', dict(start_bit = 22, end_bit = 23, native_type='unsigned long')]],
+    'SyntheticTimeUnhaltedTimerAvailable' : [ 0xc, ['BitField', dict(start_bit = 23, end_bit = 24, native_type='unsigned long')]],
+    'DeviceDomainsAvailable' : [ 0xc, ['BitField', dict(start_bit = 24, end_bit = 25, native_type='unsigned long')]],
+    'S1DeviceDomainsAvailable' : [ 0xc, ['BitField', dict(start_bit = 25, end_bit = 26, native_type='unsigned long')]],
+    'LbrAvailable' : [ 0xc, ['BitField', dict(start_bit = 26, end_bit = 27, native_type='unsigned long')]],
+    'IptAvailable' : [ 0xc, ['BitField', dict(start_bit = 27, end_bit = 28, native_type='unsigned long')]],
+    'CrossVtlFlushAvailable' : [ 0xc, ['BitField', dict(start_bit = 28, end_bit = 29, native_type='unsigned long')]],
+    'Reserved1' : [ 0xc, ['BitField', dict(start_bit = 29, end_bit = 32, native_type='unsigned long')]],
+} ],
+  '_HV_PARTITION_PRIVILEGE_MASK' : [ 0x8, {
+    'AsUINT64' : [ 0x0, ['unsigned long long']],
+    'AccessVpRunTimeReg' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long long')]],
+    'AccessPartitionReferenceCounter' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long long')]],
+    'AccessSynicRegs' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long long')]],
+    'AccessSyntheticTimerRegs' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long long')]],
+    'AccessIntrCtrlRegs' : [ 0x0, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long long')]],
+    'AccessHypercallMsrs' : [ 0x0, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long long')]],
+    'AccessVpIndex' : [ 0x0, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long long')]],
+    'AccessResetReg' : [ 0x0, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long long')]],
+    'AccessStatsReg' : [ 0x0, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long long')]],
+    'AccessPartitionReferenceTsc' : [ 0x0, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long long')]],
+    'AccessGuestIdleReg' : [ 0x0, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned long long')]],
+    'AccessFrequencyRegs' : [ 0x0, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned long long')]],
+    'AccessDebugRegs' : [ 0x0, ['BitField', dict(start_bit = 12, end_bit = 13, native_type='unsigned long long')]],
+    'AccessReenlightenmentControls' : [ 0x0, ['BitField', dict(start_bit = 13, end_bit = 14, native_type='unsigned long long')]],
+    'AccessRootSchedulerReg' : [ 0x0, ['BitField', dict(start_bit = 14, end_bit = 15, native_type='unsigned long long')]],
+    'Reserved1' : [ 0x0, ['BitField', dict(start_bit = 15, end_bit = 32, native_type='unsigned long long')]],
+    'CreatePartitions' : [ 0x0, ['BitField', dict(start_bit = 32, end_bit = 33, native_type='unsigned long long')]],
+    'AccessPartitionId' : [ 0x0, ['BitField', dict(start_bit = 33, end_bit = 34, native_type='unsigned long long')]],
+    'AccessMemoryPool' : [ 0x0, ['BitField', dict(start_bit = 34, end_bit = 35, native_type='unsigned long long')]],
+    'AdjustMessageBuffers' : [ 0x0, ['BitField', dict(start_bit = 35, end_bit = 36, native_type='unsigned long long')]],
+    'PostMessages' : [ 0x0, ['BitField', dict(start_bit = 36, end_bit = 37, native_type='unsigned long long')]],
+    'SignalEvents' : [ 0x0, ['BitField', dict(start_bit = 37, end_bit = 38, native_type='unsigned long long')]],
+    'CreatePort' : [ 0x0, ['BitField', dict(start_bit = 38, end_bit = 39, native_type='unsigned long long')]],
+    'ConnectPort' : [ 0x0, ['BitField', dict(start_bit = 39, end_bit = 40, native_type='unsigned long long')]],
+    'AccessStats' : [ 0x0, ['BitField', dict(start_bit = 40, end_bit = 41, native_type='unsigned long long')]],
+    'Reserved2' : [ 0x0, ['BitField', dict(start_bit = 41, end_bit = 43, native_type='unsigned long long')]],
+    'Debugging' : [ 0x0, ['BitField', dict(start_bit = 43, end_bit = 44, native_type='unsigned long long')]],
+    'CpuManagement' : [ 0x0, ['BitField', dict(start_bit = 44, end_bit = 45, native_type='unsigned long long')]],
+    'ConfigureProfiler' : [ 0x0, ['BitField', dict(start_bit = 45, end_bit = 46, native_type='unsigned long long')]],
+    'AccessVpExitTracing' : [ 0x0, ['BitField', dict(start_bit = 46, end_bit = 47, native_type='unsigned long long')]],
+    'EnableExtendedGvaRangesForFlushVirtualAddressList' : [ 0x0, ['BitField', dict(start_bit = 47, end_bit = 48, native_type='unsigned long long')]],
+    'AccessVsm' : [ 0x0, ['BitField', dict(start_bit = 48, end_bit = 49, native_type='unsigned long long')]],
+    'AccessVpRegisters' : [ 0x0, ['BitField', dict(start_bit = 49, end_bit = 50, native_type='unsigned long long')]],
+    'UnusedBit' : [ 0x0, ['BitField', dict(start_bit = 50, end_bit = 51, native_type='unsigned long long')]],
+    'FastHypercallOutput' : [ 0x0, ['BitField', dict(start_bit = 51, end_bit = 52, native_type='unsigned long long')]],
+    'EnableExtendedHypercalls' : [ 0x0, ['BitField', dict(start_bit = 52, end_bit = 53, native_type='unsigned long long')]],
+    'StartVirtualProcessor' : [ 0x0, ['BitField', dict(start_bit = 53, end_bit = 54, native_type='unsigned long long')]],
+    'Isolation' : [ 0x0, ['BitField', dict(start_bit = 54, end_bit = 55, native_type='unsigned long long')]],
+    'Reserved3' : [ 0x0, ['BitField', dict(start_bit = 55, end_bit = 64, native_type='unsigned long long')]],
+} ],
+  '_KTIMER_TABLE' : [ 0x2200, {
+    'TimerExpiry' : [ 0x0, ['array', 64, ['pointer64', ['_KTIMER']]]],
+    'TimerEntries' : [ 0x200, ['array', 256, ['_KTIMER_TABLE_ENTRY']]],
+} ],
+  '_KTIMER_TABLE_ENTRY' : [ 0x20, {
+    'Lock' : [ 0x0, ['unsigned long long']],
+    'Entry' : [ 0x8, ['_LIST_ENTRY']],
+    'Time' : [ 0x18, ['_ULARGE_INTEGER']],
+} ],
+  '_XSTATE_SAVE' : [ 0x38, {
+    'Prev' : [ 0x0, ['pointer64', ['_XSTATE_SAVE']]],
+    'Thread' : [ 0x8, ['pointer64', ['_KTHREAD']]],
+    'Level' : [ 0x10, ['unsigned char']],
+    'XStateContext' : [ 0x18, ['_XSTATE_CONTEXT']],
+} ],
+  '_XSAVE_AREA' : [ 0x240, {
+    'LegacyState' : [ 0x0, ['_XSAVE_FORMAT']],
+    'Header' : [ 0x200, ['_XSAVE_AREA_HEADER']],
+} ],
+  '_KEXCEPTION_FRAME' : [ 0x140, {
+    'P1Home' : [ 0x0, ['unsigned long long']],
+    'P2Home' : [ 0x8, ['unsigned long long']],
+    'P3Home' : [ 0x10, ['unsigned long long']],
+    'P4Home' : [ 0x18, ['unsigned long long']],
+    'P5' : [ 0x20, ['unsigned long long']],
+    'Spare1' : [ 0x28, ['unsigned long long']],
+    'Xmm6' : [ 0x30, ['_M128A']],
+    'Xmm7' : [ 0x40, ['_M128A']],
+    'Xmm8' : [ 0x50, ['_M128A']],
+    'Xmm9' : [ 0x60, ['_M128A']],
+    'Xmm10' : [ 0x70, ['_M128A']],
+    'Xmm11' : [ 0x80, ['_M128A']],
+    'Xmm12' : [ 0x90, ['_M128A']],
+    'Xmm13' : [ 0xa0, ['_M128A']],
+    'Xmm14' : [ 0xb0, ['_M128A']],
+    'Xmm15' : [ 0xc0, ['_M128A']],
+    'TrapFrame' : [ 0xd0, ['unsigned long long']],
+    'OutputBuffer' : [ 0xd8, ['unsigned long long']],
+    'OutputLength' : [ 0xe0, ['unsigned long long']],
+    'Spare2' : [ 0xe8, ['unsigned long long']],
+    'MxCsr' : [ 0xf0, ['unsigned long long']],
+    'Rbp' : [ 0xf8, ['unsigned long long']],
+    'Rbx' : [ 0x100, ['unsigned long long']],
+    'Rdi' : [ 0x108, ['unsigned long long']],
+    'Rsi' : [ 0x110, ['unsigned long long']],
+    'R12' : [ 0x118, ['unsigned long long']],
+    'R13' : [ 0x120, ['unsigned long long']],
+    'R14' : [ 0x128, ['unsigned long long']],
+    'R15' : [ 0x130, ['unsigned long long']],
+    'Return' : [ 0x138, ['unsigned long long']],
+} ],
+  '_KTRAP_FRAME' : [ 0x190, {
+    'P1Home' : [ 0x0, ['unsigned long long']],
+    'P2Home' : [ 0x8, ['unsigned long long']],
+    'P3Home' : [ 0x10, ['unsigned long long']],
+    'P4Home' : [ 0x18, ['unsigned long long']],
+    'P5' : [ 0x20, ['unsigned long long']],
+    'PreviousMode' : [ 0x28, ['unsigned char']],
+    'InterruptRetpolineState' : [ 0x28, ['unsigned char']],
+    'PreviousIrql' : [ 0x29, ['unsigned char']],
+    'FaultIndicator' : [ 0x2a, ['unsigned char']],
+    'NmiMsrIbrs' : [ 0x2a, ['unsigned char']],
+    'ExceptionActive' : [ 0x2b, ['unsigned char']],
+    'MxCsr' : [ 0x2c, ['unsigned long']],
+    'Rax' : [ 0x30, ['unsigned long long']],
+    'Rcx' : [ 0x38, ['unsigned long long']],
+    'Rdx' : [ 0x40, ['unsigned long long']],
+    'R8' : [ 0x48, ['unsigned long long']],
+    'R9' : [ 0x50, ['unsigned long long']],
+    'R10' : [ 0x58, ['unsigned long long']],
+    'R11' : [ 0x60, ['unsigned long long']],
+    'GsBase' : [ 0x68, ['unsigned long long']],
+    'GsSwap' : [ 0x68, ['unsigned long long']],
+    'Xmm0' : [ 0x70, ['_M128A']],
+    'Xmm1' : [ 0x80, ['_M128A']],
+    'Xmm2' : [ 0x90, ['_M128A']],
+    'Xmm3' : [ 0xa0, ['_M128A']],
+    'Xmm4' : [ 0xb0, ['_M128A']],
+    'Xmm5' : [ 0xc0, ['_M128A']],
+    'FaultAddress' : [ 0xd0, ['unsigned long long']],
+    'ContextRecord' : [ 0xd0, ['unsigned long long']],
+    'Dr0' : [ 0xd8, ['unsigned long long']],
+    'Dr1' : [ 0xe0, ['unsigned long long']],
+    'Dr2' : [ 0xe8, ['unsigned long long']],
+    'Dr3' : [ 0xf0, ['unsigned long long']],
+    'Dr6' : [ 0xf8, ['unsigned long long']],
+    'Dr7' : [ 0x100, ['unsigned long long']],
+    'DebugControl' : [ 0x108, ['unsigned long long']],
+    'LastBranchToRip' : [ 0x110, ['unsigned long long']],
+    'LastBranchFromRip' : [ 0x118, ['unsigned long long']],
+    'LastExceptionToRip' : [ 0x120, ['unsigned long long']],
+    'LastExceptionFromRip' : [ 0x128, ['unsigned long long']],
+    'SegDs' : [ 0x130, ['unsigned short']],
+    'SegEs' : [ 0x132, ['unsigned short']],
+    'SegFs' : [ 0x134, ['unsigned short']],
+    'SegGs' : [ 0x136, ['unsigned short']],
+    'TrapFrame' : [ 0x138, ['unsigned long long']],
+    'Rbx' : [ 0x140, ['unsigned long long']],
+    'Rdi' : [ 0x148, ['unsigned long long']],
+    'Rsi' : [ 0x150, ['unsigned long long']],
+    'Rbp' : [ 0x158, ['unsigned long long']],
+    'ErrorCode' : [ 0x160, ['unsigned long long']],
+    'ExceptionFrame' : [ 0x160, ['unsigned long long']],
+    'Rip' : [ 0x168, ['unsigned long long']],
+    'SegCs' : [ 0x170, ['unsigned short']],
+    'Fill0' : [ 0x172, ['unsigned char']],
+    'Logging' : [ 0x173, ['unsigned char']],
+    'Fill1' : [ 0x174, ['array', 2, ['unsigned short']]],
+    'EFlags' : [ 0x178, ['unsigned long']],
+    'Fill2' : [ 0x17c, ['unsigned long']],
+    'Rsp' : [ 0x180, ['unsigned long long']],
+    'SegSs' : [ 0x188, ['unsigned short']],
+    'Fill3' : [ 0x18a, ['unsigned short']],
+    'Fill4' : [ 0x18c, ['unsigned long']],
+} ],
+  '_KTSS64' : [ 0x68, {
+    'Reserved0' : [ 0x0, ['unsigned long']],
+    'Rsp0' : [ 0x4, ['unsigned long long']],
+    'Rsp1' : [ 0xc, ['unsigned long long']],
+    'Rsp2' : [ 0x14, ['unsigned long long']],
+    'Ist' : [ 0x1c, ['array', 8, ['unsigned long long']]],
+    'Reserved1' : [ 0x5c, ['unsigned long long']],
+    'Reserved2' : [ 0x64, ['unsigned short']],
+    'IoMapBase' : [ 0x66, ['unsigned short']],
+} ],
+  '_KIST_BASE_FRAME' : [ 0x30, {
+    'KernelGsBase' : [ 0x0, ['pointer64', ['_KPCR']]],
+    'IstStack' : [ 0x8, ['pointer64', ['_KIST_LINK_FRAME']]],
+    'PreviousGsBase' : [ 0x10, ['unsigned long long']],
+    'PreviousCr3' : [ 0x18, ['unsigned long long']],
+    'IstPad' : [ 0x20, ['unsigned long long']],
+    'Reserved' : [ 0x28, ['unsigned long long']],
+} ],
+  '_KIST_LINK_FRAME' : [ 0x20, {
+    'IstBaseFrame' : [ 0x0, ['pointer64', ['_KIST_BASE_FRAME']]],
+    'Signature' : [ 0x8, ['unsigned long']],
+    'Reserved0' : [ 0xc, ['unsigned long']],
+    'Reserved' : [ 0x10, ['array', 2, ['unsigned long long']]],
+} ],
+  '__unnamed_1ad7' : [ 0x8, {
+    'LegacyDeviceNode' : [ 0x0, ['pointer64', ['_DEVICE_NODE']]],
+    'PendingDeviceRelations' : [ 0x0, ['pointer64', ['_DEVICE_RELATIONS']]],
+    'Information' : [ 0x0, ['pointer64', ['void']]],
+} ],
+  '__unnamed_1ad9' : [ 0x8, {
+    'NextResourceDeviceNode' : [ 0x0, ['pointer64', ['_DEVICE_NODE']]],
+} ],
+  '__unnamed_1add' : [ 0x20, {
+    'DockStatus' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: u'DOCK_NOTDOCKDEVICE', 1: u'DOCK_QUIESCENT', 2: u'DOCK_ARRIVING', 3: u'DOCK_DEPARTING', 4: u'DOCK_EJECTIRP_COMPLETED'})]],
+    'ListEntry' : [ 0x8, ['_LIST_ENTRY']],
+    'SerialNumber' : [ 0x18, ['pointer64', ['wchar']]],
+} ],
+  '_DEVICE_NODE' : [ 0x310, {
+    'Sibling' : [ 0x0, ['pointer64', ['_DEVICE_NODE']]],
+    'Child' : [ 0x8, ['pointer64', ['_DEVICE_NODE']]],
+    'Parent' : [ 0x10, ['pointer64', ['_DEVICE_NODE']]],
+    'LastChild' : [ 0x18, ['pointer64', ['_DEVICE_NODE']]],
+    'PhysicalDeviceObject' : [ 0x20, ['pointer64', ['_DEVICE_OBJECT']]],
+    'InstancePath' : [ 0x28, ['_UNICODE_STRING']],
+    'ServiceName' : [ 0x38, ['_UNICODE_STRING']],
+    'PendingIrp' : [ 0x48, ['pointer64', ['_IRP']]],
+    'FxDevice' : [ 0x50, ['pointer64', ['_POP_FX_DEVICE']]],
+    'FxDeviceLock' : [ 0x58, ['long']],
+    'FxRemoveEvent' : [ 0x60, ['_KEVENT']],
+    'FxActivationCount' : [ 0x78, ['long']],
+    'FxSleepCount' : [ 0x7c, ['long']],
+    'Plugin' : [ 0x80, ['pointer64', ['_POP_FX_PLUGIN']]],
+    'Level' : [ 0x88, ['unsigned long']],
+    'CurrentPowerState' : [ 0x8c, ['_POWER_STATE']],
+    'Notify' : [ 0x90, ['_PO_DEVICE_NOTIFY']],
+    'PoIrpManager' : [ 0xf8, ['_PO_IRP_MANAGER']],
+    'UniqueId' : [ 0x118, ['_UNICODE_STRING']],
+    'PowerFlags' : [ 0x128, ['unsigned long']],
+    'State' : [ 0x12c, ['Enumeration', dict(target = 'long', choices = {768: u'DeviceNodeUnspecified', 769: u'DeviceNodeUninitialized', 770: u'DeviceNodeInitialized', 771: u'DeviceNodeDriversAdded', 772: u'DeviceNodeResourcesAssigned', 773: u'DeviceNodeStartPending', 774: u'DeviceNodeStartCompletion', 775: u'DeviceNodeStartPostWork', 776: u'DeviceNodeStarted', 777: u'DeviceNodeQueryStopped', 778: u'DeviceNodeStopped', 779: u'DeviceNodeRestartCompletion', 780: u'DeviceNodeEnumeratePending', 781: u'DeviceNodeEnumerateCompletion', 782: u'DeviceNodeAwaitingQueuedDeletion', 783: u'DeviceNodeAwaitingQueuedRemoval', 784: u'DeviceNodeQueryRemoved', 785: u'DeviceNodeRemovePendingCloses', 786: u'DeviceNodeRemoved', 787: u'DeviceNodeDeletePendingCloses', 788: u'DeviceNodeDeleted', 789: u'MaxDeviceNodeState'})]],
+    'PreviousState' : [ 0x130, ['Enumeration', dict(target = 'long', choices = {768: u'DeviceNodeUnspecified', 769: u'DeviceNodeUninitialized', 770: u'DeviceNodeInitialized', 771: u'DeviceNodeDriversAdded', 772: u'DeviceNodeResourcesAssigned', 773: u'DeviceNodeStartPending', 774: u'DeviceNodeStartCompletion', 775: u'DeviceNodeStartPostWork', 776: u'DeviceNodeStarted', 777: u'DeviceNodeQueryStopped', 778: u'DeviceNodeStopped', 779: u'DeviceNodeRestartCompletion', 780: u'DeviceNodeEnumeratePending', 781: u'DeviceNodeEnumerateCompletion', 782: u'DeviceNodeAwaitingQueuedDeletion', 783: u'DeviceNodeAwaitingQueuedRemoval', 784: u'DeviceNodeQueryRemoved', 785: u'DeviceNodeRemovePendingCloses', 786: u'DeviceNodeRemoved', 787: u'DeviceNodeDeletePendingCloses', 788: u'DeviceNodeDeleted', 789: u'MaxDeviceNodeState'})]],
+    'StateHistory' : [ 0x134, ['array', 20, ['Enumeration', dict(target = 'long', choices = {768: u'DeviceNodeUnspecified', 769: u'DeviceNodeUninitialized', 770: u'DeviceNodeInitialized', 771: u'DeviceNodeDriversAdded', 772: u'DeviceNodeResourcesAssigned', 773: u'DeviceNodeStartPending', 774: u'DeviceNodeStartCompletion', 775: u'DeviceNodeStartPostWork', 776: u'DeviceNodeStarted', 777: u'DeviceNodeQueryStopped', 778: u'DeviceNodeStopped', 779: u'DeviceNodeRestartCompletion', 780: u'DeviceNodeEnumeratePending', 781: u'DeviceNodeEnumerateCompletion', 782: u'DeviceNodeAwaitingQueuedDeletion', 783: u'DeviceNodeAwaitingQueuedRemoval', 784: u'DeviceNodeQueryRemoved', 785: u'DeviceNodeRemovePendingCloses', 786: u'DeviceNodeRemoved', 787: u'DeviceNodeDeletePendingCloses', 788: u'DeviceNodeDeleted', 789: u'MaxDeviceNodeState'})]]],
+    'StateHistoryEntry' : [ 0x184, ['unsigned long']],
+    'CompletionStatus' : [ 0x188, ['long']],
+    'Flags' : [ 0x18c, ['unsigned long']],
+    'UserFlags' : [ 0x190, ['unsigned long']],
+    'Problem' : [ 0x194, ['unsigned long']],
+    'ProblemStatus' : [ 0x198, ['long']],
+    'ResourceList' : [ 0x1a0, ['pointer64', ['_CM_RESOURCE_LIST']]],
+    'ResourceListTranslated' : [ 0x1a8, ['pointer64', ['_CM_RESOURCE_LIST']]],
+    'DuplicatePDO' : [ 0x1b0, ['pointer64', ['_DEVICE_OBJECT']]],
+    'ResourceRequirements' : [ 0x1b8, ['pointer64', ['_IO_RESOURCE_REQUIREMENTS_LIST']]],
+    'InterfaceType' : [ 0x1c0, ['Enumeration', dict(target = 'long', choices = {0: u'Internal', 1: u'Isa', 2: u'Eisa', 3: u'MicroChannel', 4: u'TurboChannel', 5: u'PCIBus', 6: u'VMEBus', 7: u'NuBus', 8: u'PCMCIABus', 9: u'CBus', 10: u'MPIBus', 11: u'MPSABus', 12: u'ProcessorInternal', 13: u'InternalPowerBus', 14: u'PNPISABus', 15: u'PNPBus', 16: u'Vmcs', 17: u'ACPIBus', 18: u'MaximumInterfaceType', -1: u'InterfaceTypeUndefined'})]],
+    'BusNumber' : [ 0x1c4, ['unsigned long']],
+    'ChildInterfaceType' : [ 0x1c8, ['Enumeration', dict(target = 'long', choices = {0: u'Internal', 1: u'Isa', 2: u'Eisa', 3: u'MicroChannel', 4: u'TurboChannel', 5: u'PCIBus', 6: u'VMEBus', 7: u'NuBus', 8: u'PCMCIABus', 9: u'CBus', 10: u'MPIBus', 11: u'MPSABus', 12: u'ProcessorInternal', 13: u'InternalPowerBus', 14: u'PNPISABus', 15: u'PNPBus', 16: u'Vmcs', 17: u'ACPIBus', 18: u'MaximumInterfaceType', -1: u'InterfaceTypeUndefined'})]],
+    'ChildBusNumber' : [ 0x1cc, ['unsigned long']],
+    'ChildBusTypeIndex' : [ 0x1d0, ['unsigned short']],
+    'RemovalPolicy' : [ 0x1d2, ['unsigned char']],
+    'HardwareRemovalPolicy' : [ 0x1d3, ['unsigned char']],
+    'TargetDeviceNotify' : [ 0x1d8, ['_LIST_ENTRY']],
+    'DeviceArbiterList' : [ 0x1e8, ['_LIST_ENTRY']],
+    'DeviceTranslatorList' : [ 0x1f8, ['_LIST_ENTRY']],
+    'NoTranslatorMask' : [ 0x208, ['unsigned short']],
+    'QueryTranslatorMask' : [ 0x20a, ['unsigned short']],
+    'NoArbiterMask' : [ 0x20c, ['unsigned short']],
+    'QueryArbiterMask' : [ 0x20e, ['unsigned short']],
+    'OverUsed1' : [ 0x210, ['__unnamed_1ad7']],
+    'OverUsed2' : [ 0x218, ['__unnamed_1ad9']],
+    'BootResources' : [ 0x220, ['pointer64', ['_CM_RESOURCE_LIST']]],
+    'BootResourcesTranslated' : [ 0x228, ['pointer64', ['_CM_RESOURCE_LIST']]],
+    'CapabilityFlags' : [ 0x230, ['unsigned long']],
+    'DockInfo' : [ 0x238, ['__unnamed_1add']],
+    'DisableableDepends' : [ 0x258, ['unsigned long']],
+    'PendedSetInterfaceState' : [ 0x260, ['_LIST_ENTRY']],
+    'LegacyBusListEntry' : [ 0x270, ['_LIST_ENTRY']],
+    'DriverUnloadRetryCount' : [ 0x280, ['unsigned long']],
+    'PreviousParent' : [ 0x288, ['pointer64', ['_DEVICE_NODE']]],
+    'DeletedChildren' : [ 0x290, ['long']],
+    'NumaNodeIndex' : [ 0x294, ['unsigned long']],
+    'ContainerID' : [ 0x298, ['_GUID']],
+    'OverrideFlags' : [ 0x2a8, ['unsigned char']],
+    'DeviceIdsHash' : [ 0x2ac, ['unsigned long']],
+    'RequiresUnloadedDriver' : [ 0x2b0, ['unsigned char']],
+    'PendingEjectRelations' : [ 0x2b8, ['pointer64', ['_PENDING_RELATIONS_LIST_ENTRY']]],
+    'StateFlags' : [ 0x2c0, ['unsigned long']],
+    'RebalanceContext' : [ 0x2c8, ['pointer64', ['_PNP_REBALANCE_TRACE_CONTEXT']]],
+    'IommuExtension' : [ 0x2d0, ['pointer64', ['_DEVICE_NODE_IOMMU_EXTENSION']]],
+    'DirectedDripsState' : [ 0x2d8, ['_PO_DIRECTED_DRIPS_STATE']],
+} ],
+  '_MCGEN_TRACE_CONTEXT' : [ 0x48, {
+    'RegistrationHandle' : [ 0x0, ['unsigned long long']],
+    'Logger' : [ 0x8, ['unsigned long long']],
+    'MatchAnyKeyword' : [ 0x10, ['unsigned long long']],
+    'MatchAllKeyword' : [ 0x18, ['unsigned long long']],
+    'Flags' : [ 0x20, ['unsigned long']],
+    'IsEnabled' : [ 0x24, ['unsigned long']],
+    'Level' : [ 0x28, ['unsigned char']],
+    'Reserve' : [ 0x29, ['unsigned char']],
+    'EnableBitsCount' : [ 0x2a, ['unsigned short']],
+    'EnableBitMask' : [ 0x30, ['pointer64', ['unsigned long']]],
+    'EnableKeyWords' : [ 0x38, ['pointer64', ['unsigned long long']]],
+    'EnableLevel' : [ 0x40, ['pointer64', ['unsigned char']]],
+} ],
+  '_PNP_DEVICE_COMPLETION_QUEUE' : [ 0x50, {
+    'DispatchedList' : [ 0x0, ['_LIST_ENTRY']],
+    'DispatchedCount' : [ 0x10, ['unsigned long']],
+    'CompletedList' : [ 0x18, ['_LIST_ENTRY']],
+    'CompletedSemaphore' : [ 0x28, ['_KSEMAPHORE']],
+    'SpinLock' : [ 0x48, ['unsigned long long']],
+} ],
+  '_KSEMAPHORE' : [ 0x20, {
+    'Header' : [ 0x0, ['_DISPATCHER_HEADER']],
+    'Limit' : [ 0x18, ['long']],
+} ],
+  '_DEVOBJ_EXTENSION' : [ 0x68, {
+    'Type' : [ 0x0, ['short']],
+    'Size' : [ 0x2, ['unsigned short']],
+    'DeviceObject' : [ 0x8, ['pointer64', ['_DEVICE_OBJECT']]],
+    'PowerFlags' : [ 0x10, ['unsigned long']],
+    'Dope' : [ 0x18, ['pointer64', ['_DEVICE_OBJECT_POWER_EXTENSION']]],
+    'ExtensionFlags' : [ 0x20, ['unsigned long']],
+    'DeviceNode' : [ 0x28, ['pointer64', ['void']]],
+    'AttachedTo' : [ 0x30, ['pointer64', ['_DEVICE_OBJECT']]],
+    'StartIoCount' : [ 0x38, ['long']],
+    'StartIoKey' : [ 0x3c, ['long']],
+    'StartIoFlags' : [ 0x40, ['unsigned long']],
+    'Vpb' : [ 0x48, ['pointer64', ['_VPB']]],
+    'DependencyNode' : [ 0x50, ['pointer64', ['void']]],
+    'InterruptContext' : [ 0x58, ['pointer64', ['void']]],
+    'VerifierContext' : [ 0x60, ['pointer64', ['void']]],
+} ],
+  '_GROUP_AFFINITY' : [ 0x10, {
+    'Mask' : [ 0x0, ['unsigned long long']],
+    'Group' : [ 0x8, ['unsigned short']],
+    'Reserved' : [ 0xa, ['array', 3, ['unsigned short']]],
+} ],
+  '_KAFFINITY_EX' : [ 0xa8, {
+    'Count' : [ 0x0, ['unsigned short']],
+    'Size' : [ 0x2, ['unsigned short']],
+    'Reserved' : [ 0x4, ['unsigned long']],
+    'Bitmap' : [ 0x8, ['array', 20, ['unsigned long long']]],
+} ],
+  '_PNP_ASSIGN_RESOURCES_CONTEXT' : [ 0x10, {
+    'IncludeFailedDevices' : [ 0x0, ['unsigned long']],
+    'DeviceCount' : [ 0x4, ['unsigned long']],
+    'DeviceList' : [ 0x8, ['array', 1, ['pointer64', ['_DEVICE_OBJECT']]]],
+} ],
+  '_PNP_RESOURCE_REQUEST' : [ 0x40, {
+    'PhysicalDevice' : [ 0x0, ['pointer64', ['_DEVICE_OBJECT']]],
+    'Flags' : [ 0x8, ['unsigned long']],
+    'AllocationType' : [ 0xc, ['Enumeration', dict(target = 'long', choices = {0: u'ArbiterRequestLegacyReported', 1: u'ArbiterRequestHalReported', 2: u'ArbiterRequestLegacyAssigned', 3: u'ArbiterRequestPnpDetected', 4: u'ArbiterRequestPnpEnumerated', -1: u'ArbiterRequestUndefined'})]],
+    'Priority' : [ 0x10, ['unsigned long']],
+    'Position' : [ 0x14, ['unsigned long']],
+    'ResourceRequirements' : [ 0x18, ['pointer64', ['_IO_RESOURCE_REQUIREMENTS_LIST']]],
+    'ReqList' : [ 0x20, ['pointer64', ['void']]],
+    'ResourceAssignment' : [ 0x28, ['pointer64', ['_CM_RESOURCE_LIST']]],
+    'TranslatedResourceAssignment' : [ 0x30, ['pointer64', ['_CM_RESOURCE_LIST']]],
+    'Status' : [ 0x38, ['long']],
+} ],
+  '_IO_RESOURCE_REQUIREMENTS_LIST' : [ 0x48, {
+    'ListSize' : [ 0x0, ['unsigned long']],
+    'InterfaceType' : [ 0x4, ['Enumeration', dict(target = 'long', choices = {0: u'Internal', 1: u'Isa', 2: u'Eisa', 3: u'MicroChannel', 4: u'TurboChannel', 5: u'PCIBus', 6: u'VMEBus', 7: u'NuBus', 8: u'PCMCIABus', 9: u'CBus', 10: u'MPIBus', 11: u'MPSABus', 12: u'ProcessorInternal', 13: u'InternalPowerBus', 14: u'PNPISABus', 15: u'PNPBus', 16: u'Vmcs', 17: u'ACPIBus', 18: u'MaximumInterfaceType', -1: u'InterfaceTypeUndefined'})]],
+    'BusNumber' : [ 0x8, ['unsigned long']],
+    'SlotNumber' : [ 0xc, ['unsigned long']],
+    'Reserved' : [ 0x10, ['array', 3, ['unsigned long']]],
+    'AlternativeLists' : [ 0x1c, ['unsigned long']],
+    'List' : [ 0x20, ['array', 1, ['_IO_RESOURCE_LIST']]],
+} ],
+  '_EXCEPTION_RECORD64' : [ 0x98, {
+    'ExceptionCode' : [ 0x0, ['long']],
+    'ExceptionFlags' : [ 0x4, ['unsigned long']],
+    'ExceptionRecord' : [ 0x8, ['unsigned long long']],
+    'ExceptionAddress' : [ 0x10, ['unsigned long long']],
+    'NumberParameters' : [ 0x18, ['unsigned long']],
+    '__unusedAlignment' : [ 0x1c, ['unsigned long']],
+    'ExceptionInformation' : [ 0x20, ['array', 15, ['unsigned long long']]],
+} ],
+  '_EXCEPTION_RECORD32' : [ 0x50, {
+    'ExceptionCode' : [ 0x0, ['long']],
+    'ExceptionFlags' : [ 0x4, ['unsigned long']],
+    'ExceptionRecord' : [ 0x8, ['unsigned long']],
+    'ExceptionAddress' : [ 0xc, ['unsigned long']],
+    'NumberParameters' : [ 0x10, ['unsigned long']],
+    'ExceptionInformation' : [ 0x14, ['array', 15, ['unsigned long']]],
+} ],
+  '_DBGKM_EXCEPTION64' : [ 0xa0, {
+    'ExceptionRecord' : [ 0x0, ['_EXCEPTION_RECORD64']],
+    'FirstChance' : [ 0x98, ['unsigned long']],
+} ],
+  '_DBGKM_EXCEPTION32' : [ 0x54, {
+    'ExceptionRecord' : [ 0x0, ['_EXCEPTION_RECORD32']],
+    'FirstChance' : [ 0x50, ['unsigned long']],
+} ],
+  '_X86_KTRAP_FRAME' : [ 0x8c, {
+    'DbgEbp' : [ 0x0, ['unsigned long']],
+    'DbgEip' : [ 0x4, ['unsigned long']],
+    'DbgArgMark' : [ 0x8, ['unsigned long']],
+    'DbgArgPointer' : [ 0xc, ['unsigned long']],
+    'TempSegCs' : [ 0x10, ['unsigned long']],
+    'TempEsp' : [ 0x14, ['unsigned long']],
+    'Dr0' : [ 0x18, ['unsigned long']],
+    'Dr1' : [ 0x1c, ['unsigned long']],
+    'Dr2' : [ 0x20, ['unsigned long']],
+    'Dr3' : [ 0x24, ['unsigned long']],
+    'Dr6' : [ 0x28, ['unsigned long']],
+    'Dr7' : [ 0x2c, ['unsigned long']],
+    'SegGs' : [ 0x30, ['unsigned long']],
+    'SegEs' : [ 0x34, ['unsigned long']],
+    'SegDs' : [ 0x38, ['unsigned long']],
+    'Edx' : [ 0x3c, ['unsigned long']],
+    'Ecx' : [ 0x40, ['unsigned long']],
+    'Eax' : [ 0x44, ['unsigned long']],
+    'PreviousPreviousMode' : [ 0x48, ['unsigned char']],
+    'EntropyQueueDpc' : [ 0x49, ['unsigned char']],
+    'Reserved' : [ 0x4a, ['array', 2, ['unsigned char']]],
+    'ExceptionList' : [ 0x4c, ['unsigned long']],
+    'SegFs' : [ 0x50, ['unsigned long']],
+    'Edi' : [ 0x54, ['unsigned long']],
+    'Esi' : [ 0x58, ['unsigned long']],
+    'Ebx' : [ 0x5c, ['unsigned long']],
+    'Ebp' : [ 0x60, ['unsigned long']],
+    'ErrCode' : [ 0x64, ['unsigned long']],
+    'Eip' : [ 0x68, ['unsigned long']],
+    'SegCs' : [ 0x6c, ['unsigned long']],
+    'EFlags' : [ 0x70, ['unsigned long']],
+    'HardwareEsp' : [ 0x74, ['unsigned long']],
+    'HardwareSegSs' : [ 0x78, ['unsigned long']],
+    'V86Es' : [ 0x7c, ['unsigned long']],
+    'V86Ds' : [ 0x80, ['unsigned long']],
+    'V86Fs' : [ 0x84, ['unsigned long']],
+    'V86Gs' : [ 0x88, ['unsigned long']],
+} ],
+  '_X86_KTRAP_FRAME_BLUE' : [ 0x8c, {
+    'DbgEbp' : [ 0x0, ['unsigned long']],
+    'DbgEip' : [ 0x4, ['unsigned long']],
+    'DbgArgMark' : [ 0x8, ['unsigned long']],
+    'TempSegCs' : [ 0xc, ['unsigned short']],
+    'Logging' : [ 0xe, ['unsigned char']],
+    'FrameType' : [ 0xf, ['unsigned char']],
+    'TempEsp' : [ 0x10, ['unsigned long']],
+    'Dr0' : [ 0x14, ['unsigned long']],
+    'Dr1' : [ 0x18, ['unsigned long']],
+    'Dr2' : [ 0x1c, ['unsigned long']],
+    'Dr3' : [ 0x20, ['unsigned long']],
+    'Dr6' : [ 0x24, ['unsigned long']],
+    'Dr7' : [ 0x28, ['unsigned long']],
+    'SegGs' : [ 0x2c, ['unsigned long']],
+    'SegEs' : [ 0x30, ['unsigned long']],
+    'SegDs' : [ 0x34, ['unsigned long']],
+    'Edx' : [ 0x38, ['unsigned long']],
+    'Ecx' : [ 0x3c, ['unsigned long']],
+    'Eax' : [ 0x40, ['unsigned long']],
+    'PreviousPreviousMode' : [ 0x44, ['unsigned char']],
+    'EntropyQueueDpc' : [ 0x45, ['unsigned char']],
+    'Reserved' : [ 0x46, ['array', 2, ['unsigned char']]],
+    'MxCsr' : [ 0x48, ['unsigned long']],
+    'ExceptionList' : [ 0x4c, ['unsigned long']],
+    'SegFs' : [ 0x50, ['unsigned long']],
+    'Edi' : [ 0x54, ['unsigned long']],
+    'Esi' : [ 0x58, ['unsigned long']],
+    'Ebx' : [ 0x5c, ['unsigned long']],
+    'Ebp' : [ 0x60, ['unsigned long']],
+    'ErrCode' : [ 0x64, ['unsigned long']],
+    'Eip' : [ 0x68, ['unsigned long']],
+    'SegCs' : [ 0x6c, ['unsigned long']],
+    'EFlags' : [ 0x70, ['unsigned long']],
+    'HardwareEsp' : [ 0x74, ['unsigned long']],
+    'HardwareSegSs' : [ 0x78, ['unsigned long']],
+    'V86Es' : [ 0x7c, ['unsigned long']],
+    'V86Ds' : [ 0x80, ['unsigned long']],
+    'V86Fs' : [ 0x84, ['unsigned long']],
+    'V86Gs' : [ 0x88, ['unsigned long']],
+} ],
+  '_DBGKD_LOAD_SYMBOLS64' : [ 0x28, {
+    'PathNameLength' : [ 0x0, ['unsigned long']],
+    'BaseOfDll' : [ 0x8, ['unsigned long long']],
+    'ProcessId' : [ 0x10, ['unsigned long long']],
+    'CheckSum' : [ 0x18, ['unsigned long']],
+    'SizeOfImage' : [ 0x1c, ['unsigned long']],
+    'UnloadSymbols' : [ 0x20, ['unsigned char']],
+} ],
+  '_DBGKD_LOAD_SYMBOLS32' : [ 0x18, {
+    'PathNameLength' : [ 0x0, ['unsigned long']],
+    'BaseOfDll' : [ 0x4, ['unsigned long']],
+    'ProcessId' : [ 0x8, ['unsigned long']],
+    'CheckSum' : [ 0xc, ['unsigned long']],
+    'SizeOfImage' : [ 0x10, ['unsigned long']],
+    'UnloadSymbols' : [ 0x14, ['unsigned char']],
+} ],
+  '_DBGKD_READ_MEMORY64' : [ 0x10, {
+    'TargetBaseAddress' : [ 0x0, ['unsigned long long']],
+    'TransferCount' : [ 0x8, ['unsigned long']],
+    'ActualBytesRead' : [ 0xc, ['unsigned long']],
+} ],
+  '_DBGKD_READ_MEMORY32' : [ 0xc, {
+    'TargetBaseAddress' : [ 0x0, ['unsigned long']],
+    'TransferCount' : [ 0x4, ['unsigned long']],
+    'ActualBytesRead' : [ 0x8, ['unsigned long']],
+} ],
+  '_DBGKD_WRITE_MEMORY64' : [ 0x10, {
+    'TargetBaseAddress' : [ 0x0, ['unsigned long long']],
+    'TransferCount' : [ 0x8, ['unsigned long']],
+    'ActualBytesWritten' : [ 0xc, ['unsigned long']],
+} ],
+  '_DBGKD_WRITE_MEMORY32' : [ 0xc, {
+    'TargetBaseAddress' : [ 0x0, ['unsigned long']],
+    'TransferCount' : [ 0x4, ['unsigned long']],
+    'ActualBytesWritten' : [ 0x8, ['unsigned long']],
+} ],
+  '_DBGKD_WRITE_BREAKPOINT64' : [ 0x10, {
+    'BreakPointAddress' : [ 0x0, ['unsigned long long']],
+    'BreakPointHandle' : [ 0x8, ['unsigned long']],
+} ],
+  '_DBGKD_WRITE_BREAKPOINT32' : [ 0x8, {
+    'BreakPointAddress' : [ 0x0, ['unsigned long']],
+    'BreakPointHandle' : [ 0x4, ['unsigned long']],
+} ],
+  '_DBGKD_READ_WRITE_IO64' : [ 0x10, {
+    'IoAddress' : [ 0x0, ['unsigned long long']],
+    'DataSize' : [ 0x8, ['unsigned long']],
+    'DataValue' : [ 0xc, ['unsigned long']],
+} ],
+  '_DBGKD_READ_WRITE_IO32' : [ 0xc, {
+    'DataSize' : [ 0x0, ['unsigned long']],
+    'IoAddress' : [ 0x4, ['unsigned long']],
+    'DataValue' : [ 0x8, ['unsigned long']],
+} ],
+  '_DBGKD_READ_WRITE_IO_EXTENDED64' : [ 0x20, {
+    'DataSize' : [ 0x0, ['unsigned long']],
+    'InterfaceType' : [ 0x4, ['unsigned long']],
+    'BusNumber' : [ 0x8, ['unsigned long']],
+    'AddressSpace' : [ 0xc, ['unsigned long']],
+    'IoAddress' : [ 0x10, ['unsigned long long']],
+    'DataValue' : [ 0x18, ['unsigned long']],
+} ],
+  '_DBGKD_READ_WRITE_IO_EXTENDED32' : [ 0x18, {
+    'DataSize' : [ 0x0, ['unsigned long']],
+    'InterfaceType' : [ 0x4, ['unsigned long']],
+    'BusNumber' : [ 0x8, ['unsigned long']],
+    'AddressSpace' : [ 0xc, ['unsigned long']],
+    'IoAddress' : [ 0x10, ['unsigned long']],
+    'DataValue' : [ 0x14, ['unsigned long']],
+} ],
+  '_DBGKD_SET_SPECIAL_CALL32' : [ 0x4, {
+    'SpecialCall' : [ 0x0, ['unsigned long']],
+} ],
+  '_DBGKD_SET_SPECIAL_CALL64' : [ 0x8, {
+    'SpecialCall' : [ 0x0, ['unsigned long long']],
+} ],
+  '_DBGKD_SET_INTERNAL_BREAKPOINT32' : [ 0x8, {
+    'BreakpointAddress' : [ 0x0, ['unsigned long']],
+    'Flags' : [ 0x4, ['unsigned long']],
+} ],
+  '_DBGKD_SET_INTERNAL_BREAKPOINT64' : [ 0x10, {
+    'BreakpointAddress' : [ 0x0, ['unsigned long long']],
+    'Flags' : [ 0x8, ['unsigned long']],
+} ],
+  '_DBGKD_GET_INTERNAL_BREAKPOINT64' : [ 0x20, {
+    'BreakpointAddress' : [ 0x0, ['unsigned long long']],
+    'Flags' : [ 0x8, ['unsigned long']],
+    'Calls' : [ 0xc, ['unsigned long']],
+    'MaxCallsPerPeriod' : [ 0x10, ['unsigned long']],
+    'MinInstructions' : [ 0x14, ['unsigned long']],
+    'MaxInstructions' : [ 0x18, ['unsigned long']],
+    'TotalInstructions' : [ 0x1c, ['unsigned long']],
+} ],
+  '_DBGKD_GET_INTERNAL_BREAKPOINT32' : [ 0x1c, {
+    'BreakpointAddress' : [ 0x0, ['unsigned long']],
+    'Flags' : [ 0x4, ['unsigned long']],
+    'Calls' : [ 0x8, ['unsigned long']],
+    'MaxCallsPerPeriod' : [ 0xc, ['unsigned long']],
+    'MinInstructions' : [ 0x10, ['unsigned long']],
+    'MaxInstructions' : [ 0x14, ['unsigned long']],
+    'TotalInstructions' : [ 0x18, ['unsigned long']],
+} ],
+  '__unnamed_1bd5' : [ 0x28, {
+    'ReadMemory' : [ 0x0, ['_DBGKD_READ_MEMORY64']],
+    'WriteMemory' : [ 0x0, ['_DBGKD_WRITE_MEMORY64']],
+    'GetContext' : [ 0x0, ['_DBGKD_GET_CONTEXT']],
+    'SetContext' : [ 0x0, ['_DBGKD_SET_CONTEXT']],
+    'WriteBreakPoint' : [ 0x0, ['_DBGKD_WRITE_BREAKPOINT64']],
+    'RestoreBreakPoint' : [ 0x0, ['_DBGKD_RESTORE_BREAKPOINT']],
+    'Continue' : [ 0x0, ['_DBGKD_CONTINUE']],
+    'Continue2' : [ 0x0, ['_DBGKD_CONTINUE2']],
+    'ReadWriteIo' : [ 0x0, ['_DBGKD_READ_WRITE_IO64']],
+    'ReadWriteIoExtended' : [ 0x0, ['_DBGKD_READ_WRITE_IO_EXTENDED64']],
+    'QuerySpecialCalls' : [ 0x0, ['_DBGKD_QUERY_SPECIAL_CALLS']],
+    'SetSpecialCall' : [ 0x0, ['_DBGKD_SET_SPECIAL_CALL64']],
+    'SetInternalBreakpoint' : [ 0x0, ['_DBGKD_SET_INTERNAL_BREAKPOINT64']],
+    'GetInternalBreakpoint' : [ 0x0, ['_DBGKD_GET_INTERNAL_BREAKPOINT64']],
+    'GetVersion64' : [ 0x0, ['_DBGKD_GET_VERSION64']],
+    'BreakPointEx' : [ 0x0, ['_DBGKD_BREAKPOINTEX']],
+    'ReadWriteMsr' : [ 0x0, ['_DBGKD_READ_WRITE_MSR']],
+    'SearchMemory' : [ 0x0, ['_DBGKD_SEARCH_MEMORY']],
+    'GetSetBusData' : [ 0x0, ['_DBGKD_GET_SET_BUS_DATA']],
+    'FillMemory' : [ 0x0, ['_DBGKD_FILL_MEMORY']],
+    'QueryMemory' : [ 0x0, ['_DBGKD_QUERY_MEMORY']],
+    'SwitchPartition' : [ 0x0, ['_DBGKD_SWITCH_PARTITION']],
+    'GetContextEx' : [ 0x0, ['_DBGKD_CONTEXT_EX']],
+    'SetContextEx' : [ 0x0, ['_DBGKD_CONTEXT_EX']],
+    'WriteCustomBreakPoint' : [ 0x0, ['_DBGKD_WRITE_CUSTOM_BREAKPOINT']],
+} ],
+  '_DBGKD_MANIPULATE_STATE64' : [ 0x38, {
+    'ApiNumber' : [ 0x0, ['unsigned long']],
+    'ProcessorLevel' : [ 0x4, ['unsigned short']],
+    'Processor' : [ 0x6, ['unsigned short']],
+    'ReturnStatus' : [ 0x8, ['long']],
+    'u' : [ 0x10, ['__unnamed_1bd5']],
+} ],
+  '__unnamed_1bdc' : [ 0x28, {
+    'ReadMemory' : [ 0x0, ['_DBGKD_READ_MEMORY32']],
+    'WriteMemory' : [ 0x0, ['_DBGKD_WRITE_MEMORY32']],
+    'ReadMemory64' : [ 0x0, ['_DBGKD_READ_MEMORY64']],
+    'WriteMemory64' : [ 0x0, ['_DBGKD_WRITE_MEMORY64']],
+    'GetContext' : [ 0x0, ['_DBGKD_GET_CONTEXT']],
+    'SetContext' : [ 0x0, ['_DBGKD_SET_CONTEXT']],
+    'WriteBreakPoint' : [ 0x0, ['_DBGKD_WRITE_BREAKPOINT32']],
+    'RestoreBreakPoint' : [ 0x0, ['_DBGKD_RESTORE_BREAKPOINT']],
+    'Continue' : [ 0x0, ['_DBGKD_CONTINUE']],
+    'Continue2' : [ 0x0, ['_DBGKD_CONTINUE2']],
+    'ReadWriteIo' : [ 0x0, ['_DBGKD_READ_WRITE_IO32']],
+    'ReadWriteIoExtended' : [ 0x0, ['_DBGKD_READ_WRITE_IO_EXTENDED32']],
+    'QuerySpecialCalls' : [ 0x0, ['_DBGKD_QUERY_SPECIAL_CALLS']],
+    'SetSpecialCall' : [ 0x0, ['_DBGKD_SET_SPECIAL_CALL32']],
+    'SetInternalBreakpoint' : [ 0x0, ['_DBGKD_SET_INTERNAL_BREAKPOINT32']],
+    'GetInternalBreakpoint' : [ 0x0, ['_DBGKD_GET_INTERNAL_BREAKPOINT32']],
+    'GetVersion32' : [ 0x0, ['_DBGKD_GET_VERSION32']],
+    'BreakPointEx' : [ 0x0, ['_DBGKD_BREAKPOINTEX']],
+    'ReadWriteMsr' : [ 0x0, ['_DBGKD_READ_WRITE_MSR']],
+    'SearchMemory' : [ 0x0, ['_DBGKD_SEARCH_MEMORY']],
+    'GetContextEx' : [ 0x0, ['_DBGKD_CONTEXT_EX']],
+    'SetContextEx' : [ 0x0, ['_DBGKD_CONTEXT_EX']],
+} ],
+  '_DBGKD_MANIPULATE_STATE32' : [ 0x34, {
+    'ApiNumber' : [ 0x0, ['unsigned long']],
+    'ProcessorLevel' : [ 0x4, ['unsigned short']],
+    'Processor' : [ 0x6, ['unsigned short']],
+    'ReturnStatus' : [ 0x8, ['long']],
+    'u' : [ 0xc, ['__unnamed_1bdc']],
+} ],
+  '_DBGKD_READ_WRITE_MSR' : [ 0xc, {
+    'Msr' : [ 0x0, ['unsigned long']],
+    'DataValueLow' : [ 0x4, ['unsigned long']],
+    'DataValueHigh' : [ 0x8, ['unsigned long']],
+} ],
+  '_DBGKD_BREAKPOINTEX' : [ 0x8, {
+    'BreakPointCount' : [ 0x0, ['unsigned long']],
+    'ContinueStatus' : [ 0x4, ['long']],
+} ],
+  '_DBGKD_SEARCH_MEMORY' : [ 0x18, {
+    'SearchAddress' : [ 0x0, ['unsigned long long']],
+    'FoundAddress' : [ 0x0, ['unsigned long long']],
+    'SearchLength' : [ 0x8, ['unsigned long long']],
+    'PatternLength' : [ 0x10, ['unsigned long']],
+} ],
+  '_DBGKD_RESTORE_BREAKPOINT' : [ 0x4, {
+    'BreakPointHandle' : [ 0x0, ['unsigned long']],
+} ],
+  '_DBGKD_CONTINUE' : [ 0x4, {
+    'ContinueStatus' : [ 0x0, ['long']],
+} ],
+  '_DBGKD_CONTINUE2' : [ 0x20, {
+    'ContinueStatus' : [ 0x0, ['long']],
+    'ControlSet' : [ 0x4, ['_AMD64_DBGKD_CONTROL_SET']],
+    'AnyControlSet' : [ 0x4, ['_DBGKD_ANY_CONTROL_SET']],
+} ],
+  '_DEVICE_MANAGE_DATA_SET_ATTRIBUTES' : [ 0x1c, {
+    'Size' : [ 0x0, ['unsigned long']],
+    'Action' : [ 0x4, ['unsigned long']],
+    'Flags' : [ 0x8, ['unsigned long']],
+    'ParameterBlockOffset' : [ 0xc, ['unsigned long']],
+    'ParameterBlockLength' : [ 0x10, ['unsigned long']],
+    'DataSetRangesOffset' : [ 0x14, ['unsigned long']],
+    'DataSetRangesLength' : [ 0x18, ['unsigned long']],
+} ],
+  '_DEVICE_DATA_SET_RANGE' : [ 0x10, {
+    'StartingOffset' : [ 0x0, ['long long']],
+    'LengthInBytes' : [ 0x8, ['unsigned long long']],
+} ],
+  '_DEVICE_DSM_DEFINITION' : [ 0x1c, {
+    'Action' : [ 0x0, ['unsigned long']],
+    'SingleRange' : [ 0x4, ['unsigned char']],
+    'ParameterBlockAlignment' : [ 0x8, ['unsigned long']],
+    'ParameterBlockLength' : [ 0xc, ['unsigned long']],
+    'HasOutput' : [ 0x10, ['unsigned char']],
+    'OutputBlockAlignment' : [ 0x14, ['unsigned long']],
+    'OutputBlockLength' : [ 0x18, ['unsigned long']],
+} ],
+  '_DEVICE_MANAGE_DATA_SET_ATTRIBUTES_OUTPUT' : [ 0x24, {
+    'Size' : [ 0x0, ['unsigned long']],
+    'Action' : [ 0x4, ['unsigned long']],
+    'Flags' : [ 0x8, ['unsigned long']],
+    'OperationStatus' : [ 0xc, ['unsigned long']],
+    'ExtendedError' : [ 0x10, ['unsigned long']],
+    'TargetDetailedError' : [ 0x14, ['unsigned long']],
+    'ReservedStatus' : [ 0x18, ['unsigned long']],
+    'OutputBlockOffset' : [ 0x1c, ['unsigned long']],
+    'OutputBlockLength' : [ 0x20, ['unsigned long']],
+} ],
+  '_PEP_ACPI_RESOURCE' : [ 0x48, {
+    'Type' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: u'PepAcpiMemory', 1: u'PepAcpiIoPort', 2: u'PepAcpiInterrupt', 3: u'PepAcpiGpioIo', 4: u'PepAcpiGpioInt', 5: u'PepAcpiSpbI2c', 6: u'PepAcpiSpbSpi', 7: u'PepAcpiSpbUart', 8: u'PepAcpiExtendedMemory', 9: u'PepAcpiExtendedIo'})]],
+    'IoMemory' : [ 0x0, ['_PEP_ACPI_IO_MEMORY_RESOURCE']],
+    'Interrupt' : [ 0x0, ['_PEP_ACPI_INTERRUPT_RESOURCE']],
+    'Gpio' : [ 0x0, ['_PEP_ACPI_GPIO_RESOURCE']],
+    'SpbI2c' : [ 0x0, ['_PEP_ACPI_SPB_I2C_RESOURCE']],
+    'SpbSpi' : [ 0x0, ['_PEP_ACPI_SPB_SPI_RESOURCE']],
+    'SpbUart' : [ 0x0, ['_PEP_ACPI_SPB_UART_RESOURCE']],
+    'ExtendedAddress' : [ 0x0, ['_PEP_ACPI_EXTENDED_ADDRESS']],
+} ],
+  '_PEP_ACPI_IO_MEMORY_RESOURCE' : [ 0x20, {
+    'Type' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: u'PepAcpiMemory', 1: u'PepAcpiIoPort', 2: u'PepAcpiInterrupt', 3: u'PepAcpiGpioIo', 4: u'PepAcpiGpioInt', 5: u'PepAcpiSpbI2c', 6: u'PepAcpiSpbSpi', 7: u'PepAcpiSpbUart', 8: u'PepAcpiExtendedMemory', 9: u'PepAcpiExtendedIo'})]],
+    'Information' : [ 0x4, ['unsigned char']],
+    'MinimumAddress' : [ 0x8, ['_LARGE_INTEGER']],
+    'MaximumAddress' : [ 0x10, ['_LARGE_INTEGER']],
+    'Alignment' : [ 0x18, ['unsigned long']],
+    'Length' : [ 0x1c, ['unsigned long']],
+} ],
+  '_PEP_ACPI_INTERRUPT_RESOURCE' : [ 0x20, {
+    'Type' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: u'PepAcpiMemory', 1: u'PepAcpiIoPort', 2: u'PepAcpiInterrupt', 3: u'PepAcpiGpioIo', 4: u'PepAcpiGpioInt', 5: u'PepAcpiSpbI2c', 6: u'PepAcpiSpbSpi', 7: u'PepAcpiSpbUart', 8: u'PepAcpiExtendedMemory', 9: u'PepAcpiExtendedIo'})]],
+    'InterruptType' : [ 0x4, ['Enumeration', dict(target = 'long', choices = {0: u'LevelSensitive', 1: u'Latched'})]],
+    'InterruptPolarity' : [ 0x8, ['Enumeration', dict(target = 'long', choices = {0: u'InterruptPolarityUnknown', 1: u'InterruptRisingEdge', 2: u'InterruptFallingEdge', 3: u'InterruptActiveBothTriggerLow', 4: u'InterruptActiveBothTriggerHigh'})]],
+    'Flags' : [ 0xc, ['_PEP_ACPI_RESOURCE_FLAGS']],
+    'Count' : [ 0x10, ['unsigned char']],
+    'Pins' : [ 0x18, ['pointer64', ['unsigned long']]],
+} ],
+  '_PEP_ACPI_GPIO_RESOURCE' : [ 0x48, {
+    'Type' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: u'PepAcpiMemory', 1: u'PepAcpiIoPort', 2: u'PepAcpiInterrupt', 3: u'PepAcpiGpioIo', 4: u'PepAcpiGpioInt', 5: u'PepAcpiSpbI2c', 6: u'PepAcpiSpbSpi', 7: u'PepAcpiSpbUart', 8: u'PepAcpiExtendedMemory', 9: u'PepAcpiExtendedIo'})]],
+    'Flags' : [ 0x4, ['_PEP_ACPI_RESOURCE_FLAGS']],
+    'InterruptType' : [ 0x8, ['Enumeration', dict(target = 'long', choices = {0: u'LevelSensitive', 1: u'Latched'})]],
+    'InterruptPolarity' : [ 0xc, ['Enumeration', dict(target = 'long', choices = {0: u'InterruptPolarityUnknown', 1: u'InterruptRisingEdge', 2: u'InterruptFallingEdge', 3: u'InterruptActiveBothTriggerLow', 4: u'InterruptActiveBothTriggerHigh'})]],
+    'PinConfig' : [ 0x10, ['Enumeration', dict(target = 'long', choices = {0: u'PullDefault', 1: u'PullUp', 2: u'PullDown', 3: u'PullNone'})]],
+    'IoRestrictionType' : [ 0x14, ['Enumeration', dict(target = 'long', choices = {0: u'IoRestrictionNone', 1: u'IoRestrictionInputOnly', 2: u'IoRestrictionOutputOnly', 3: u'IoRestrictionNoneAndPreserve'})]],
+    'DriveStrength' : [ 0x18, ['unsigned short']],
+    'DebounceTimeout' : [ 0x1a, ['unsigned short']],
+    'PinTable' : [ 0x20, ['pointer64', ['wchar']]],
+    'PinCount' : [ 0x28, ['unsigned short']],
+    'ResourceSourceIndex' : [ 0x2a, ['unsigned char']],
+    'ResourceSourceName' : [ 0x30, ['pointer64', ['_UNICODE_STRING']]],
+    'VendorData' : [ 0x38, ['pointer64', ['unsigned char']]],
+    'VendorDataLength' : [ 0x40, ['unsigned short']],
+} ],
+  '_PEP_ACPI_SPB_I2C_RESOURCE' : [ 0x30, {
+    'SpbCommon' : [ 0x0, ['_PEP_ACPI_SPB_RESOURCE']],
+    'ConnectionSpeed' : [ 0x28, ['unsigned long']],
+    'SlaveAddress' : [ 0x2c, ['unsigned short']],
+} ],
+  '_PEP_ACPI_SPB_UART_RESOURCE' : [ 0x38, {
+    'SpbCommon' : [ 0x0, ['_PEP_ACPI_SPB_RESOURCE']],
+    'BaudRate' : [ 0x28, ['unsigned long']],
+    'RxBufferSize' : [ 0x2c, ['unsigned short']],
+    'TxBufferSize' : [ 0x2e, ['unsigned short']],
+    'Parity' : [ 0x30, ['unsigned char']],
+    'LinesInUse' : [ 0x31, ['unsigned char']],
+} ],
+  '_PEP_ACPI_SPB_SPI_RESOURCE' : [ 0x38, {
+    'SpbCommon' : [ 0x0, ['_PEP_ACPI_SPB_RESOURCE']],
+    'ConnectionSpeed' : [ 0x28, ['unsigned long']],
+    'DataBitLength' : [ 0x2c, ['unsigned char']],
+    'Phase' : [ 0x2d, ['unsigned char']],
+    'Polarity' : [ 0x2e, ['unsigned char']],
+    'DeviceSelection' : [ 0x30, ['unsigned short']],
+} ],
+  '_PEP_ACPI_EXTENDED_ADDRESS' : [ 0x48, {
+    'Type' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: u'PepAcpiMemory', 1: u'PepAcpiIoPort', 2: u'PepAcpiInterrupt', 3: u'PepAcpiGpioIo', 4: u'PepAcpiGpioInt', 5: u'PepAcpiSpbI2c', 6: u'PepAcpiSpbSpi', 7: u'PepAcpiSpbUart', 8: u'PepAcpiExtendedMemory', 9: u'PepAcpiExtendedIo'})]],
+    'Flags' : [ 0x4, ['_PEP_ACPI_RESOURCE_FLAGS']],
+    'ResourceFlags' : [ 0x8, ['unsigned char']],
+    'GeneralFlags' : [ 0x9, ['unsigned char']],
+    'TypeSpecificFlags' : [ 0xa, ['unsigned char']],
+    'RevisionId' : [ 0xb, ['unsigned char']],
+    'Reserved' : [ 0xc, ['unsigned char']],
+    'Granularity' : [ 0x10, ['unsigned long long']],
+    'MinimumAddress' : [ 0x18, ['unsigned long long']],
+    'MaximumAddress' : [ 0x20, ['unsigned long long']],
+    'TranslationAddress' : [ 0x28, ['unsigned long long']],
+    'AddressLength' : [ 0x30, ['unsigned long long']],
+    'TypeAttribute' : [ 0x38, ['unsigned long long']],
+    'DescriptorName' : [ 0x40, ['pointer64', ['_UNICODE_STRING']]],
+} ],
+  '_PPM_PLATFORM_STATES' : [ 0x1c0, {
+    'StateCount' : [ 0x0, ['unsigned long']],
+    'InterfaceVersion' : [ 0x4, ['unsigned long']],
+    'ProcessorCount' : [ 0x8, ['unsigned long']],
+    'CoordinatedInterface' : [ 0xc, ['unsigned char']],
+    'IdleTest' : [ 0x10, ['pointer64', ['void']]],
+    'IdlePreExecute' : [ 0x18, ['pointer64', ['void']]],
+    'IdleComplete' : [ 0x20, ['pointer64', ['void']]],
+    'QueryPlatformStateResidency' : [ 0x28, ['pointer64', ['void']]],
+    'Accounting' : [ 0x30, ['pointer64', ['_PLATFORM_IDLE_ACCOUNTING']]],
+    'DeepSleepEnabled' : [ 0x38, ['unsigned char']],
+    'State' : [ 0x40, ['array', 1, ['_PPM_PLATFORM_STATE']]],
+} ],
+  '_CPU_INFO' : [ 0x10, {
+    'AsUINT32' : [ 0x0, ['array', 4, ['unsigned long']]],
+    'Eax' : [ 0x0, ['unsigned long']],
+    'Ebx' : [ 0x4, ['unsigned long']],
+    'Ecx' : [ 0x8, ['unsigned long']],
+    'Edx' : [ 0xc, ['unsigned long']],
+} ],
+  '_POP_PPM_PROFILE' : [ 0x15a0, {
+    'Name' : [ 0x0, ['pointer64', ['wchar']]],
+    'Id' : [ 0x8, ['unsigned char']],
+    'Guid' : [ 0xc, ['_GUID']],
+    'Flags' : [ 0x1c, ['unsigned long']],
+    'Priority' : [ 0x20, ['unsigned char']],
+    'Settings' : [ 0x28, ['array', 2, ['_PPM_ENGINE_SETTINGS']]],
+    'StartTime' : [ 0x1578, ['unsigned long long']],
+    'Count' : [ 0x1580, ['unsigned long long']],
+    'MaxDuration' : [ 0x1588, ['unsigned long long']],
+    'MinDuration' : [ 0x1590, ['unsigned long long']],
+    'TotalDuration' : [ 0x1598, ['unsigned long long']],
+} ],
+  '_PPM_ENGINE_SETTINGS' : [ 0xaa8, {
+    'ExplicitSetting' : [ 0x0, ['array', 2, ['_PPM_POLICY_SETTINGS_MASK']]],
+    'ThrottlingPolicy' : [ 0x10, ['unsigned char']],
+    'PerfTimeCheck' : [ 0x14, ['unsigned long']],
+    'PerfHistoryCount' : [ 0x18, ['array', 2, ['unsigned char']]],
+    'PerfMinPolicy' : [ 0x1a, ['array', 2, ['unsigned char']]],
+    'PerfMaxPolicy' : [ 0x1c, ['array', 2, ['unsigned char']]],
+    'PerfDecreaseTime' : [ 0x1e, ['array', 2, ['unsigned char']]],
+    'PerfIncreaseTime' : [ 0x20, ['array', 2, ['unsigned char']]],
+    'PerfDecreasePolicy' : [ 0x22, ['array', 2, ['unsigned char']]],
+    'PerfIncreasePolicy' : [ 0x24, ['array', 2, ['unsigned char']]],
+    'PerfDecreaseThreshold' : [ 0x26, ['array', 2, ['unsigned char']]],
+    'PerfIncreaseThreshold' : [ 0x28, ['array', 2, ['unsigned char']]],
+    'PerfFrequencyCap' : [ 0x2c, ['array', 2, ['unsigned long']]],
+    'PerfBoostPolicy' : [ 0x34, ['unsigned long']],
+    'PerfBoostMode' : [ 0x38, ['unsigned long']],
+    'PerfReductionTolerance' : [ 0x3c, ['unsigned long']],
+    'EnergyPerfPreference' : [ 0x40, ['array', 2, ['unsigned long']]],
+    'AutonomousActivityWindow' : [ 0x48, ['unsigned long']],
+    'AutonomousPreference' : [ 0x4c, ['unsigned char']],
+    'LatencyHintPerf' : [ 0x4d, ['array', 2, ['unsigned char']]],
+    'LatencyHintUnpark' : [ 0x4f, ['array', 2, ['unsigned char']]],
+    'ResponsivenessDisableThreshold' : [ 0x54, ['array', 2, ['unsigned long']]],
+    'ResponsivenessEnableThreshold' : [ 0x5c, ['array', 2, ['unsigned long']]],
+    'ResponsivenessDisableTime' : [ 0x64, ['array', 2, ['unsigned char']]],
+    'ResponsivenessEnableTime' : [ 0x66, ['array', 2, ['unsigned char']]],
+    'ResponsivenessEppCeiling' : [ 0x68, ['array', 2, ['unsigned long']]],
+    'ResponsivenessPerfFloor' : [ 0x70, ['array', 2, ['unsigned long']]],
+    'DutyCycling' : [ 0x78, ['unsigned char']],
+    'ParkingPerfState' : [ 0x79, ['array', 2, ['unsigned char']]],
+    'DistributeUtility' : [ 0x7b, ['unsigned char']],
+    'CoreParkingOverUtilizationThreshold' : [ 0x7c, ['unsigned char']],
+    'CoreParkingConcurrencyThreshold' : [ 0x7d, ['unsigned char']],
+    'CoreParkingHeadroomThreshold' : [ 0x7e, ['unsigned char']],
+    'CoreParkingDistributionThreshold' : [ 0x7f, ['unsigned char']],
+    'CoreParkingDecreasePolicy' : [ 0x80, ['unsigned char']],
+    'CoreParkingIncreasePolicy' : [ 0x81, ['unsigned char']],
+    'CoreParkingDecreaseTime' : [ 0x84, ['unsigned long']],
+    'CoreParkingIncreaseTime' : [ 0x88, ['unsigned long']],
+    'CoreParkingMinCores' : [ 0x8c, ['array', 2, ['unsigned char']]],
+    'CoreParkingMaxCores' : [ 0x8e, ['array', 2, ['unsigned char']]],
+    'AllowScaling' : [ 0x90, ['unsigned char']],
+    'IdleDisabled' : [ 0x91, ['unsigned char']],
+    'IdleTimeCheck' : [ 0x94, ['unsigned long']],
+    'IdleDemotePercent' : [ 0x98, ['unsigned char']],
+    'IdlePromotePercent' : [ 0x99, ['unsigned char']],
+    'IdleStateMax' : [ 0x9a, ['unsigned char']],
+    'HeteroDecreaseTime' : [ 0x9b, ['unsigned char']],
+    'HeteroIncreaseTime' : [ 0x9c, ['unsigned char']],
+    'HeteroDecreaseThreshold' : [ 0x9d, ['array', 1280, ['unsigned char']]],
+    'HeteroIncreaseThreshold' : [ 0x59d, ['array', 1280, ['unsigned char']]],
+    'Class0FloorPerformance' : [ 0xa9d, ['unsigned char']],
+    'Class1InitialPerformance' : [ 0xa9e, ['unsigned char']],
+    'ThreadPolicies' : [ 0xaa0, ['array', 2, ['Enumeration', dict(target = 'long', choices = {0: u'KHeteroCpuPolicyAll', 1: u'KHeteroCpuPolicyLarge', 2: u'KHeteroCpuPolicyLargeOrIdle', 3: u'KHeteroCpuPolicySmall', 4: u'KHeteroCpuPolicySmallOrIdle', 5: u'KHeteroCpuPolicyStaticMax', 6: u'KHeteroCpuPolicyBiasedSmall', 7: u'KHeteroCpuPolicyBiasedLarge', 8: u'KHeteroCpuPolicyDefault', 9: u'KHeteroCpuPolicyMax'})]]],
+} ],
+  '_ESERVERSILO_GLOBALS' : [ 0x480, {
+    'ObSiloState' : [ 0x0, ['_OBP_SILODRIVERSTATE']],
+    'SeSiloState' : [ 0x2e0, ['_SEP_SILOSTATE']],
+    'SeRmSiloState' : [ 0x310, ['_SEP_RM_LSA_CONNECTION_STATE']],
+    'EtwSiloState' : [ 0x360, ['pointer64', ['_ETW_SILODRIVERSTATE']]],
+    'MiSessionLeaderProcess' : [ 0x368, ['pointer64', ['_EPROCESS']]],
+    'ExpDefaultErrorPortProcess' : [ 0x370, ['pointer64', ['_EPROCESS']]],
+    'ExpDefaultErrorPort' : [ 0x378, ['pointer64', ['void']]],
+    'HardErrorState' : [ 0x380, ['unsigned long']],
+    'WnfSiloState' : [ 0x388, ['_WNF_SILODRIVERSTATE']],
+    'DbgkSiloState' : [ 0x3c0, ['_DBGK_SILOSTATE']],
+    'PsProtectedCurrentDirectory' : [ 0x3e0, ['_UNICODE_STRING']],
+    'PsProtectedEnvironment' : [ 0x3f0, ['_UNICODE_STRING']],
+    'ApiSetSection' : [ 0x400, ['pointer64', ['void']]],
+    'ApiSetSchema' : [ 0x408, ['pointer64', ['void']]],
+    'OneCoreForwardersEnabled' : [ 0x410, ['unsigned char']],
+    'NtSystemRoot' : [ 0x418, ['_UNICODE_STRING']],
+    'SiloRootDirectoryName' : [ 0x428, ['_UNICODE_STRING']],
+    'Storage' : [ 0x438, ['pointer64', ['_PSP_STORAGE']]],
+    'State' : [ 0x440, ['Enumeration', dict(target = 'long', choices = {0: u'SERVERSILO_INITING', 1: u'SERVERSILO_STARTED', 2: u'SERVERSILO_SHUTTING_DOWN', 3: u'SERVERSILO_TERMINATING', 4: u'SERVERSILO_TERMINATED'})]],
+    'ExitStatus' : [ 0x444, ['long']],
+    'DeleteEvent' : [ 0x448, ['pointer64', ['_KEVENT']]],
+    'UserSharedData' : [ 0x450, ['pointer64', ['_SILO_USER_SHARED_DATA']]],
+    'UserSharedSection' : [ 0x458, ['pointer64', ['void']]],
+    'TerminateWorkItem' : [ 0x460, ['_WORK_QUEUE_ITEM']],
+} ],
+  '_SILO_USER_SHARED_DATA' : [ 0x248, {
+    'ServiceSessionId' : [ 0x0, ['unsigned long']],
+    'ActiveConsoleId' : [ 0x4, ['unsigned long']],
+    'ConsoleSessionForegroundProcessId' : [ 0x8, ['long long']],
+    'NtProductType' : [ 0x10, ['Enumeration', dict(target = 'long', choices = {1: u'NtProductWinNt', 2: u'NtProductLanManNt', 3: u'NtProductServer'})]],
+    'SuiteMask' : [ 0x14, ['unsigned long']],
+    'SharedUserSessionId' : [ 0x18, ['unsigned long']],
+    'IsMultiSessionSku' : [ 0x1c, ['unsigned char']],
+    'NtSystemRoot' : [ 0x1e, ['array', 260, ['wchar']]],
+    'UserModeGlobalLogger' : [ 0x226, ['array', 16, ['unsigned short']]],
+} ],
+  '_POP_FX_COMPONENT_FLAGS' : [ 0x8, {
+    'Value' : [ 0x0, ['long']],
+    'Value2' : [ 0x4, ['long']],
+    'RefCount' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 30, native_type='unsigned long')]],
+    'Idling' : [ 0x0, ['BitField', dict(start_bit = 30, end_bit = 31, native_type='unsigned long')]],
+    'Active' : [ 0x0, ['BitField', dict(start_bit = 31, end_bit = 32, native_type='unsigned long')]],
+    'CriticalIdleOverride' : [ 0x4, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
+    'ResidentOverride' : [ 0x4, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
+    'Reserved' : [ 0x4, ['BitField', dict(start_bit = 2, end_bit = 32, native_type='unsigned long')]],
+} ],
+  '_POP_FX_PERF_FLAGS' : [ 0x4, {
+    'Value' : [ 0x0, ['long']],
+    'Progress' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 3, native_type='unsigned long')]],
+    'Reserved' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 27, native_type='unsigned long')]],
+    'Synchronicity' : [ 0x0, ['BitField', dict(start_bit = 27, end_bit = 29, native_type='unsigned long')]],
+    'RequestPepCompleted' : [ 0x0, ['BitField', dict(start_bit = 29, end_bit = 30, native_type='unsigned long')]],
+    'RequestSucceeded' : [ 0x0, ['BitField', dict(start_bit = 30, end_bit = 31, native_type='unsigned long')]],
+    'NestedCallback' : [ 0x0, ['BitField', dict(start_bit = 31, end_bit = 32, native_type='unsigned long')]],
+} ],
+  '_POP_FX_DEVICE_STATUS' : [ 0x4, {
+    'Value' : [ 0x0, ['long']],
+    'SystemTransition' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
+    'PepD0Notify' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
+    'IdleTimerOn' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
+    'IgnoreIdleTimeout' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
+    'IrpInUse' : [ 0x0, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
+    'IrpPending' : [ 0x0, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
+    'DPNRDeviceNotified' : [ 0x0, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
+    'DPNRReceivedFromPep' : [ 0x0, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
+    'IrpFirstPendingIndex' : [ 0x0, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long')]],
+    'IrpLastPendingIndex' : [ 0x0, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long')]],
+    'SIrpBlocked' : [ 0x0, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned long')]],
+    'BlockFastResume' : [ 0x0, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned long')]],
+    'DirectedPoweredDown' : [ 0x0, ['BitField', dict(start_bit = 12, end_bit = 13, native_type='unsigned long')]],
+    'DirectedTransitionInProgress' : [ 0x0, ['BitField', dict(start_bit = 13, end_bit = 14, native_type='unsigned long')]],
+    'Reserved' : [ 0x0, ['BitField', dict(start_bit = 14, end_bit = 32, native_type='unsigned long')]],
+} ],
+  '_POP_RW_LOCK' : [ 0x10, {
+    'Lock' : [ 0x0, ['_EX_PUSH_LOCK']],
+    'Thread' : [ 0x8, ['pointer64', ['_KTHREAD']]],
+} ],
+  '_VOLUME_CACHE_MAP' : [ 0xd0, {
+    'NodeTypeCode' : [ 0x0, ['short']],
+    'NodeByteCode' : [ 0x2, ['short']],
+    'UseCount' : [ 0x4, ['unsigned long']],
+    'DeviceObject' : [ 0x8, ['pointer64', ['_DEVICE_OBJECT']]],
+    'VolumeCacheMapLinks' : [ 0x10, ['_LIST_ENTRY']],
+    'DirtyPages' : [ 0x20, ['unsigned long long']],
+    'LogHandleContext' : [ 0x28, ['_LOG_HANDLE_CONTEXT']],
+    'Flags' : [ 0xc0, ['unsigned long']],
+    'PagesQueuedToDisk' : [ 0xc4, ['unsigned long']],
+    'LoggedPagesQueuedToDisk' : [ 0xc8, ['unsigned long']],
+} ],
+  '_SHARED_CACHE_MAP' : [ 0x228, {
+    'NodeTypeCode' : [ 0x0, ['short']],
+    'NodeByteSize' : [ 0x2, ['short']],
+    'OpenCount' : [ 0x4, ['unsigned long']],
+    'FileSize' : [ 0x8, ['_LARGE_INTEGER']],
+    'BcbList' : [ 0x10, ['_LIST_ENTRY']],
+    'SectionSize' : [ 0x20, ['_LARGE_INTEGER']],
+    'ValidDataLength' : [ 0x28, ['_LARGE_INTEGER']],
+    'ValidDataGoal' : [ 0x30, ['_LARGE_INTEGER']],
+    'InitialVacbs' : [ 0x38, ['array', 4, ['pointer64', ['_VACB']]]],
+    'Vacbs' : [ 0x58, ['pointer64', ['pointer64', ['_VACB']]]],
+    'FileObjectFastRef' : [ 0x60, ['_EX_FAST_REF']],
+    'VacbLock' : [ 0x68, ['_EX_PUSH_LOCK']],
+    'DirtyPages' : [ 0x70, ['unsigned long']],
+    'LoggedStreamLinks' : [ 0x78, ['_LIST_ENTRY']],
+    'SharedCacheMapLinks' : [ 0x88, ['_LIST_ENTRY']],
+    'Flags' : [ 0x98, ['unsigned long']],
+    'Status' : [ 0x9c, ['long']],
+    'Mbcb' : [ 0xa0, ['pointer64', ['_MBCB']]],
+    'Section' : [ 0xa8, ['pointer64', ['void']]],
+    'CreateEvent' : [ 0xb0, ['pointer64', ['_KEVENT']]],
+    'WaitOnActiveCount' : [ 0xb8, ['pointer64', ['_KEVENT']]],
+    'PagesToWrite' : [ 0xc0, ['unsigned long']],
+    'BeyondLastFlush' : [ 0xc8, ['long long']],
+    'Callbacks' : [ 0xd0, ['pointer64', ['_CACHE_MANAGER_CALLBACKS']]],
+    'LazyWriteContext' : [ 0xd8, ['pointer64', ['void']]],
+    'PrivateList' : [ 0xe0, ['_LIST_ENTRY']],
+    'V1' : [ 0xf0, ['_LOGGED_STREAM_CALLBACK_V1']],
+    'V2' : [ 0xf0, ['_LOGGED_STREAM_CALLBACK_V2']],
+    'LargestLSN' : [ 0x100, ['_LARGE_INTEGER']],
+    'DirtyPageThreshold' : [ 0x108, ['unsigned long']],
+    'LazyWritePassCount' : [ 0x10c, ['unsigned long']],
+    'UninitializeEvent' : [ 0x110, ['pointer64', ['_CACHE_UNINITIALIZE_EVENT']]],
+    'BcbLock' : [ 0x118, ['_FAST_MUTEX']],
+    'LastUnmapBehindOffset' : [ 0x150, ['_LARGE_INTEGER']],
+    'Event' : [ 0x158, ['_KEVENT']],
+    'HighWaterMappingOffset' : [ 0x170, ['_LARGE_INTEGER']],
+    'PrivateCacheMap' : [ 0x178, ['_PRIVATE_CACHE_MAP']],
+    'WriteBehindWorkQueueEntry' : [ 0x1f0, ['pointer64', ['void']]],
+    'VolumeCacheMap' : [ 0x1f8, ['pointer64', ['_VOLUME_CACHE_MAP']]],
+    'ProcImagePathHash' : [ 0x200, ['unsigned long']],
+    'WritesInProgress' : [ 0x204, ['unsigned long']],
+    'AsyncReadRequestCount' : [ 0x208, ['unsigned long']],
+    'Partition' : [ 0x210, ['pointer64', ['_CC_PARTITION']]],
+    'InternalRefCount' : [ 0x218, ['unsigned long']],
+    'NumMappedVacb' : [ 0x21c, ['unsigned long']],
+    'NumActiveVacb' : [ 0x220, ['unsigned long']],
+} ],
+  '__unnamed_1cf9' : [ 0x10, {
+    'FileOffset' : [ 0x0, ['_LARGE_INTEGER']],
+    'ActiveCount' : [ 0x0, ['unsigned short']],
+    'Links' : [ 0x0, ['_LIST_ENTRY']],
+} ],
+  '_VACB' : [ 0x28, {
+    'BaseAddress' : [ 0x0, ['pointer64', ['void']]],
+    'SharedCacheMap' : [ 0x8, ['pointer64', ['_SHARED_CACHE_MAP']]],
+    'Overlay' : [ 0x10, ['__unnamed_1cf9']],
+    'ArrayHead' : [ 0x20, ['pointer64', ['_VACB_ARRAY_HEADER']]],
+} ],
+  '_CC_PARTITION' : [ 0x400, {
+    'NodeTypeCode' : [ 0x0, ['short']],
+    'NodeByteSize' : [ 0x2, ['short']],
+    'PartitionObject' : [ 0x8, ['pointer64', ['_EPARTITION']]],
+    'CleanSharedCacheMapList' : [ 0x10, ['_LIST_ENTRY']],
+    'CleanSharedCacheMapWithLogHandleList' : [ 0x20, ['_LIST_ENTRY']],
+    'DirtySharedCacheMapList' : [ 0x30, ['_SHARED_CACHE_MAP_LIST_CURSOR']],
+    'LazyWriteCursor' : [ 0x48, ['_SHARED_CACHE_MAP_LIST_CURSOR']],
+    'DirtySharedCacheMapWithLogHandleList' : [ 0x60, ['_LIST_ENTRY']],
+    'PrivateLock' : [ 0x80, ['unsigned long long']],
+    'ConsecutiveWorklessLazyScanCount' : [ 0x88, ['unsigned long']],
+    'ForcedDisableLazywriteScan' : [ 0x8c, ['unsigned char']],
+    'WorkQueueLock' : [ 0xc0, ['unsigned long long']],
+    'NumberWorkerThreads' : [ 0xc8, ['unsigned long']],
+    'NumberActiveWorkerThreads' : [ 0xcc, ['unsigned long']],
+    'IdleWorkerThreadList' : [ 0xd0, ['_LIST_ENTRY']],
+    'FastTeardownWorkQueue' : [ 0xe0, ['_LIST_ENTRY']],
+    'ExpressWorkQueue' : [ 0xf0, ['_LIST_ENTRY']],
+    'RegularWorkQueue' : [ 0x100, ['_LIST_ENTRY']],
+    'PostTickWorkQueue' : [ 0x110, ['_LIST_ENTRY']],
+    'IdleExtraWriteBehindThreadList' : [ 0x120, ['_LIST_ENTRY']],
+    'ActiveExtraWriteBehindThreads' : [ 0x130, ['unsigned long']],
+    'MaxExtraWriteBehindThreads' : [ 0x134, ['unsigned long']],
+    'QueueThrottle' : [ 0x138, ['unsigned char']],
+    'PostTickWorkItemCount' : [ 0x13c, ['unsigned long']],
+    'ThreadsActiveBeforeThrottle' : [ 0x140, ['unsigned long']],
+    'ExtraWBThreadsActiveBeforeThrottle' : [ 0x144, ['unsigned long']],
+    'ExecutingWriteBehindWorkItems' : [ 0x148, ['unsigned long']],
+    'ExecutingHighPriorityWorkItem' : [ 0x14c, ['unsigned long']],
+    'LowMemoryEvent' : [ 0x150, ['_KEVENT']],
+    'PowerEvent' : [ 0x168, ['_KEVENT']],
+    'PeriodicEvent' : [ 0x180, ['_KEVENT']],
+    'WaitingForTeardownEvent' : [ 0x198, ['_KEVENT']],
+    'CoalescingFlushEvent' : [ 0x1b0, ['_KEVENT']],
+    'PagesYetToWrite' : [ 0x1c8, ['unsigned long']],
+    'LazyWriter' : [ 0x1d0, ['_LAZY_WRITER']],
+    'DirtyPageStatistics' : [ 0x258, ['_DIRTY_PAGE_STATISTICS']],
+    'DirtyPageThresholds' : [ 0x270, ['_DIRTY_PAGE_THRESHOLDS']],
+    'ThroughputStats' : [ 0x2a8, ['pointer64', ['_WRITE_BEHIND_THROUGHPUT']]],
+    'ThroughputTrend' : [ 0x2b0, ['long']],
+    'AverageAvailablePages' : [ 0x2b8, ['unsigned long long']],
+    'AverageDirtyPages' : [ 0x2c0, ['unsigned long long']],
+    'PagesSkippedDueToHotSpot' : [ 0x2c8, ['unsigned long long']],
+    'PrevRegularQueueItemRunTime' : [ 0x2d0, ['_LARGE_INTEGER']],
+    'PrevExtraWBThreadCheckTime' : [ 0x2d8, ['_LARGE_INTEGER']],
+    'AddExtraWriteBehindThreads' : [ 0x2e0, ['unsigned char']],
+    'RemoveExtraThreadPending' : [ 0x2e1, ['unsigned char']],
+    'DeferredWrites' : [ 0x2e8, ['_LIST_ENTRY']],
+    'DeferredWriteSpinLock' : [ 0x300, ['unsigned long long']],
+    'IdleAsyncReadWorkerThreadList' : [ 0x308, ['pointer64', ['_LIST_ENTRY']]],
+    'NumberActiveAsyncReadWorkerThreads' : [ 0x310, ['pointer64', ['unsigned long']]],
+    'NumberActiveCompleteAsyncReadWorkItems' : [ 0x318, ['pointer64', ['unsigned long']]],
+    'AsyncReadWorkQueue' : [ 0x320, ['pointer64', ['_LIST_ENTRY']]],
+    'AsyncReadCompletionWorkQueue' : [ 0x328, ['pointer64', ['_LIST_ENTRY']]],
+    'NewAsyncReadRequestEvent' : [ 0x330, ['pointer64', ['_KEVENT']]],
+    'ReaderThreadsStats' : [ 0x338, ['pointer64', ['_ASYNC_READ_THREAD_STATS']]],
+    'AsyncReadWorkQueueLock' : [ 0x340, ['_EX_PUSH_LOCK']],
+    'VacbFreeHighPriorityList' : [ 0x348, ['_LIST_ENTRY']],
+    'NumberOfFreeHighPriorityVacbs' : [ 0x358, ['unsigned long']],
+    'LowPriWorkerThread' : [ 0x360, ['pointer64', ['_ETHREAD']]],
+    'LowPriSharedCacheMap' : [ 0x368, ['pointer64', ['_SHARED_CACHE_MAP']]],
+    'LowPriOldCpuPriority' : [ 0x370, ['long']],
+    'LowPriOldIoPriority' : [ 0x374, ['Enumeration', dict(target = 'long', choices = {0: u'IoPriorityVeryLow', 1: u'IoPriorityLow', 2: u'IoPriorityNormal', 3: u'IoPriorityHigh', 4: u'IoPriorityCritical', 5: u'MaxIoPriorityTypes'})]],
+    'LowPriorityWorkerThreadLock' : [ 0x378, ['_EX_PUSH_LOCK']],
+    'MaxNumberOfWriteBehindThreads' : [ 0x380, ['unsigned long']],
+    'CoalescingState' : [ 0x384, ['unsigned char']],
+    'ActivePartition' : [ 0x385, ['unsigned char']],
+    'RundownPhase' : [ 0x386, ['unsigned char']],
+    'RefCount' : [ 0x388, ['long long']],
+    'ExitEvent' : [ 0x390, ['_KEVENT']],
+    'FinalDereferenceEvent' : [ 0x3a8, ['_KEVENT']],
+    'LazyWriteScanThreadHandle' : [ 0x3c0, ['pointer64', ['void']]],
+} ],
+  '__unnamed_1d1f' : [ 0x10, {
+    'FileObject' : [ 0x0, ['pointer64', ['_FILE_OBJECT']]],
+    'DiskIoAttribution' : [ 0x8, ['pointer64', ['void']]],
+} ],
+  '__unnamed_1d21' : [ 0x8, {
+    'SharedCacheMap' : [ 0x0, ['pointer64', ['_SHARED_CACHE_MAP']]],
+} ],
+  '__unnamed_1d23' : [ 0x8, {
+    'Event' : [ 0x0, ['pointer64', ['_KEVENT']]],
+} ],
+  '__unnamed_1d25' : [ 0x4, {
+    'Reason' : [ 0x0, ['unsigned long']],
+} ],
+  '__unnamed_1d27' : [ 0x30, {
+    'SharedCacheMap' : [ 0x0, ['pointer64', ['_SHARED_CACHE_MAP']]],
+    'IoStatus' : [ 0x8, ['pointer64', ['_IO_STATUS_BLOCK']]],
+    'CallerWaitEvent' : [ 0x10, ['_KEVENT']],
+    'IsLowPriWriteBehind' : [ 0x28, ['unsigned char']],
+} ],
+  '__unnamed_1d2b' : [ 0x68, {
+    'SharedCacheMap' : [ 0x0, ['pointer64', ['_SHARED_CACHE_MAP']]],
+    'FileOffset' : [ 0x8, ['_LARGE_INTEGER']],
+    'FileObject' : [ 0x10, ['pointer64', ['_FILE_OBJECT']]],
+    'Length' : [ 0x18, ['unsigned long']],
+    'PrefetchList' : [ 0x20, ['pointer64', ['_SINGLE_LIST_ENTRY']]],
+    'PrefetchPagePriority' : [ 0x28, ['unsigned long']],
+    'Mdl' : [ 0x30, ['pointer64', ['_MDL']]],
+    'IoStatusBlock' : [ 0x38, ['pointer64', ['_IO_STATUS_BLOCK']]],
+    'CallbackContext' : [ 0x40, ['pointer64', ['_CC_ASYNC_READ_CONTEXT']]],
+    'OriginatingProcess' : [ 0x48, ['pointer64', ['_EPROCESS']]],
+    'IoIssuerThread' : [ 0x50, ['pointer64', ['_ETHREAD']]],
+    'DiskIoAttribution' : [ 0x58, ['pointer64', ['void']]],
+    'RequestorMode' : [ 0x60, ['unsigned char']],
+    'NestingLevel' : [ 0x64, ['unsigned long']],
+} ],
+  '__unnamed_1d2d' : [ 0x68, {
+    'Read' : [ 0x0, ['__unnamed_1d1f']],
+    'Write' : [ 0x0, ['__unnamed_1d21']],
+    'Event' : [ 0x0, ['__unnamed_1d23']],
+    'Notification' : [ 0x0, ['__unnamed_1d25']],
+    'LowPriWrite' : [ 0x0, ['__unnamed_1d27']],
+    'AsyncRead' : [ 0x0, ['__unnamed_1d2b']],
+} ],
+  '_WORK_QUEUE_ENTRY' : [ 0x88, {
+    'WorkQueueLinks' : [ 0x0, ['_LIST_ENTRY']],
+    'Parameters' : [ 0x10, ['__unnamed_1d2d']],
+    'Function' : [ 0x78, ['unsigned char']],
+    'Partition' : [ 0x80, ['pointer64', ['_CC_PARTITION']]],
+} ],
+  '_DEFERRED_WRITE' : [ 0x50, {
+    'NodeTypeCode' : [ 0x0, ['short']],
+    'NodeByteSize' : [ 0x2, ['short']],
+    'FileObject' : [ 0x8, ['pointer64', ['_FILE_OBJECT']]],
+    'BytesToWrite' : [ 0x10, ['unsigned long']],
+    'DeferredWriteLinks' : [ 0x18, ['_LIST_ENTRY']],
+    'Event' : [ 0x28, ['pointer64', ['_KEVENT']]],
+    'PostRoutine' : [ 0x30, ['pointer64', ['void']]],
+    'Context1' : [ 0x38, ['pointer64', ['void']]],
+    'Context2' : [ 0x40, ['pointer64', ['void']]],
+    'Partition' : [ 0x48, ['pointer64', ['_CC_PARTITION']]],
+} ],
+  '_SECTION_OBJECT_POINTERS' : [ 0x18, {
+    'DataSectionObject' : [ 0x0, ['pointer64', ['void']]],
+    'SharedCacheMap' : [ 0x8, ['pointer64', ['void']]],
+    'ImageSectionObject' : [ 0x10, ['pointer64', ['void']]],
+} ],
+  '_CC_EXTERNAL_CACHE_INFO' : [ 0x30, {
+    'Callback' : [ 0x0, ['pointer64', ['void']]],
+    'DirtyPageStatistics' : [ 0x8, ['_DIRTY_PAGE_STATISTICS']],
+    'Links' : [ 0x20, ['_LIST_ENTRY']],
+} ],
+  'VACB_LEVEL_ALLOCATION_LIST' : [ 0x20, {
+    'VacbLevelList' : [ 0x0, ['_LIST_ENTRY']],
+    'VacbLevelWithBcbListHeads' : [ 0x10, ['pointer64', ['void']]],
+    'VacbLevelsAllocated' : [ 0x18, ['unsigned long']],
+} ],
+  '_VACB_LEVEL_REFERENCE' : [ 0x8, {
+    'Reference' : [ 0x0, ['long']],
+    'SpecialReference' : [ 0x4, ['long']],
+} ],
+  '_LOG_HANDLE_CONTEXT' : [ 0x98, {
+    'LogHandle' : [ 0x0, ['pointer64', ['void']]],
